{"id":2212,"date":"2024-10-02T13:37:28","date_gmt":"2024-10-02T13:37:28","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=2212"},"modified":"2024-10-02T13:37:29","modified_gmt":"2024-10-02T13:37:29","slug":"ruta-graveolens-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses","title":{"rendered":"Ruta Graveolens &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Ruta Graveolens?<\/h2>\n\n\n\n<p>Ruta Graveolens, also known as rue, is an herbal and homeopathic medicine plant. It was originally found in Europe and has been employed to treat many diseases of the human body. <\/p>\n\n\n\n<p>In traditional medicine, Ruta is used for muscle and joint pains; therefore, it can be used to manage arthritis and sprains. It is also applied for eye problems such as fatigue resulting from extended use of computers or watching TV and bodily injuries that include bruises and tendon strains. <\/p>\n\n\n\n<p>In the homeopathic system of medicine, the crude drug Ruta Graveolens is employed in low concentration for the same purpose. This is why it is useful for treating physical pain – the plant contains substances for reducing inflammation and for anesthetic action. But again, it should be taken with a regulated measure since high levels can be lethal to the consumption of the product.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ruta Graveolens Chemical Constituents<\/h2>\n\n\n\n<p>Ruta graveolens contain a variety of chemical constituents that give it its medicinal and aromatic properties. Some of the key compounds include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Rutin: <\/strong>A powerful antioxidant and anti-inflammatory flavonoid.<\/li>\n\n\n\n<li><strong>Alkaloids:<\/strong> Including rutinine and arborinine, which contribute to its medicinal effects, such as muscle relaxation.<\/li>\n\n\n\n<li><strong>Essential Oils:<\/strong> Containing compounds like methyl-nonyl-ketone and methyl nonyl-acetate, responsible for its strong, pungent smell.<\/li>\n\n\n\n<li><strong>Furanocoumarins:<\/strong> Known for their photosensitizing properties, these can cause skin irritation when exposed to sunlight.<\/li>\n\n\n\n<li><strong>Coumarins:<\/strong> Compounds that may have anticoagulant and antimicrobial effects.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ruta Graveolens Preparation<\/h2>\n\n\n\n<p>To prepare Ruta graveolens (common rue) for medicinal or culinary use, you can follow these methods:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Decoction Preparation\n<ul class=\"wp-block-list\">\n<li><strong>Gather Ingredients:<\/strong> Use fresh leaves or dried leaves of Ruta graveolens.<\/li>\n\n\n\n<li><strong>Clean the Plant Material:<\/strong> If using fresh leaves, rinse them thoroughly to remove any dirt.<\/li>\n\n\n\n<li><strong>Combine with Water:<\/strong> Place about ½ cup of chopped fresh leaves (or 3 tablespoons of dried leaves) into a non-reactive pot and add 3 cups of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-cold-with-homeopathy\"   title=\"cold\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2413\">cold<\/a> water.<\/li>\n\n\n\n<li><strong>Boil and Simmer:<\/strong> Bring the mixture to a boil, then reduce the heat and let it simmer uncovered for about 20 minutes until the liquid reduces by approximately one-third.<\/li>\n\n\n\n<li><strong>Strain and Store:<\/strong> Strain the liquid into a container, discarding the plant material. This decoction can be consumed hot or cold and can be stored in the refrigerator for up to 48 hours.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Tincture Preparation\n<ul class=\"wp-block-list\">\n<li><strong>Maceration: <\/strong>Chop fresh Ruta graveolens leaves and place them in a jar. Cover with a high-proof alcohol (like vodka) in a 1:5 ratio (1 part plant to 5 parts alcohol).<\/li>\n\n\n\n<li><strong>Seal and Store:<\/strong> Seal the jar tightly and store it in a dark, cool place for about 2-4 weeks, shaking it gently every few days.<\/li>\n\n\n\n<li><strong>Strain and Bottle:<\/strong> After the steeping period, strain the mixture through a fine mesh or cheesecloth into a dark glass bottle for storage.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ruta Graveolens Mother Tincture<\/h2>\n\n\n\n<p>Ruta graveolens mother tincture is prepared in liquid form using fresh or dried leaves and stems of the Ruta graveolens plant. It consists of maceration in which the plant material is soaked in a solvent of ethanol and water to extract the active constituents, inclusive of the alkaloids, the flavonoids, and the essential oils. <\/p>\n\n\n\n<p>This seed mother tincture of homeopathy cures joint aches, eye strain, muscular rigidity, and tendon or ligament injuries. The mother tincture is so concentrated that it requires dilution before it can be used. The tincture is usually taken orally or applied locally; a few drops are placed in water and consumed. But it must be grassed in the right dosage, as Rutin&#8217;s toxicity levels can be realized.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits Of Ruta Graveolens<\/h2>\n\n\n\n<p>Ruta graveolens offers a range of health benefits due to its medicinal properties. Some key benefits include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pain Relief:<\/strong> It is commonly used to relieve muscle and joint pain, especially for conditions like arthritis, sprains, and injuries to tendons and ligaments.<\/li>\n\n\n\n<li><strong>Eye Strain:<\/strong> In homeopathy, it helps alleviate symptoms of eye strain and fatigue, particularly from overuse of the eyes, such as from reading or computer work.<\/li>\n\n\n\n<li><strong>Anti-Inflammatory:<\/strong> Ruta has anti-inflammatory properties, making it useful for reducing swelling and discomfort in various parts of the body.<\/li>\n\n\n\n<li><strong>Digestive Aid:<\/strong> It can be used to improve digestion and relieve gastrointestinal issues like bloating and cramps.<\/li>\n\n\n\n<li><strong>Antispasmodic:<\/strong> It helps relax muscles and prevent spasms, which is beneficial for muscle cramps and tension.<\/li>\n\n\n\n<li><strong>Skin Healing:<\/strong> Applied topically, Ruta can help heal bruises and wounds and reduce inflammation from skin conditions.<\/li>\n\n\n\n<li><strong>Calming Effect:<\/strong> It may help with calming nerves and alleviating <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1265\">anxiety<\/a> or stress in some cases.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Ruta Graveolens Treat?<\/h2>\n\n\n\n<p>Ruta graveolens, commonly known as rue, is a herb that has been used for a long time to help with various health issues. Here’s a look at some of the conditions it’s often used to treat:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Joint Pain and Arthritis:<\/strong> Rue is popular for easing pain and swelling in the joints, making it helpful for people with arthritis.<\/li>\n\n\n\n<li><strong>Muscle Stiffness:<\/strong> Its anti-inflammatory properties can help reduce stiffness and discomfort in the muscles.<\/li>\n\n\n\n<li><strong>Digestive Problems:<\/strong> Rue is known to help with digestive issues like bloating, gas, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-indigestion-with-homeopathy\"   title=\"indigestion\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1580\">indigestion<\/a>, and it may also help stimulate appetite.<\/li>\n\n\n\n<li><strong>Menstrual Issues:<\/strong> Traditionally, rue has been used to help regulate menstrual cycles and ease menstrual cramps.<\/li>\n\n\n\n<li><strong>Eye Strain:<\/strong> In homeopathy, rue is commonly recommended for relieving eye strain, especially for those who read or use screens for long periods.<\/li>\n\n\n\n<li><strong>Infections and Wounds:<\/strong> Thanks to its antimicrobial properties, rue can be applied to minor wounds and infections to aid healing.<\/li>\n\n\n\n<li><strong>Varicose Veins:<\/strong> Some believe that rue can improve blood circulation and may help relieve symptoms of varicose veins.<\/li>\n\n\n\n<li><strong>Headaches:<\/strong> Rue is also used by some people to help relieve headaches and migraines because of its relaxing effects.<\/li>\n\n\n\n<li><strong>Insect Bites and Repellent:<\/strong> Rue&#8217;s strong scent acts as a natural insect repellent and can be used to treat insect bites.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ruta Graveolens Homeopathic Uses<\/h2>\n\n\n\n<p>Ruta Graveolens homeopathic medicine is used for various health conditions, especially related to muscles, joints, and tendons. Key uses include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Joint and Muscle Pain:<\/strong> It helps relieve stiffness, pain, and soreness in the joints and muscles, particularly after injuries or overexertion.<\/li>\n\n\n\n<li><strong>Eye Strain:<\/strong> Ruta is commonly used for eye fatigue and strain, especially from excessive reading or screen use.<\/li>\n\n\n\n<li>Tendon and Ligament Injuries: It supports healing from injuries like sprains, strains, and tendonitis.<\/li>\n\n\n\n<li><strong>Bruises and Soft Tissue Damage:<\/strong> Ruta helps reduce pain and inflammation from bruises and minor injuries to soft tissues.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-back-pain-with-homeopathy\"   title=\"Back Pain\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"976\">Back Pain<\/a>:<\/strong> It is effective for lower back pain, especially when the pain feels worse after rest or sitting.<\/li>\n\n\n\n<li><strong>Carpal Tunnel Syndrome:<\/strong> Ruta is sometimes used for nerve pain and numbness in conditions like carpal tunnel syndrome.<\/li>\n\n\n\n<li><strong>Varicose Veins:<\/strong> It may help relieve discomfort from swollen veins and improve circulation.<\/li>\n\n\n\n<li><strong>Chronic Overuse Injuries: <\/strong>Useful for treating repetitive stress injuries like tennis elbow or writer’s cramp.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ruta Graveolens Dosage<\/h2>\n\n\n\n<p>Ruta graveolens dosage varies based on the form used and the specific health condition being treated. Here are the general guidelines:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Homeopathic Dilutions:<\/strong> The most commonly utilized potencies are 30C or 200C, which are often preferred. They are given as 3-5 pellets three times daily or as prescribed by a doctor.<\/li>\n\n\n\n<li><strong>Mother Tincture:<\/strong> The recommended dosage of the mother tincture is five to ten drops in a teaspoon of water – thrice or four times a day.<\/li>\n\n\n\n<li><strong>Herbal Tea: <\/strong>To prepare tea from dried leaves, about one teaspoon of dried Ruta leaves can be steeped in hot water for 10-15 minutes and taken once or twice a day.<\/li>\n\n\n\n<li><strong>Topical Applications:<\/strong> When using a topical ointment or infused oil, rub the product gently on the skin of the affected area as needed.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Ruta Graveolens Dosage For Adults:<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Homeopathic Remedies:\n<ul class=\"wp-block-list\">\n<li><strong>Potency:<\/strong> Common strengths are 30C or 200C.<\/li>\n\n\n\n<li><strong>Typical Dosage: <\/strong>Adults can take 3 to 5 pellets three times a day, but the dosage may be adjusted based on their response.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Herbal Extracts:\n<ul class=\"wp-block-list\">\n<li><strong>Tincture:<\/strong> A usual dose is 5-10 drops mixed in water, taken two to three times a day.<\/li>\n\n\n\n<li><strong>Capsules\/Tablets:<\/strong> Follow the instructions on the label, usually taking 1-2 capsules or tablets two to three times a day.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Ruta Graveolens Dosage For Children:<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Homeopathic Remedies:\n<ul class=\"wp-block-list\">\n<li><strong>Potency:<\/strong> Use lower strengths like 6C or 30C.<\/li>\n\n\n\n<li><strong>Typical Dosage: <\/strong>Children can take 1 to 3 pellets three times a day, but the exact amount may depend on their age and weight.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Herbal Extracts:\n<ul class=\"wp-block-list\">\n<li><strong>Tincture: <\/strong>For kids, it’s best to use smaller doses. A safe dosage is usually 1-3 drops in water, taken one to three times a day, but check with a healthcare professional for the right amount.<\/li>\n\n\n\n<li><strong>Capsules\/Tablets:<\/strong> If using capsules or tablets, consult a healthcare provider for the right dosage based on the child’s age and weight.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Ruta Graveolens?<\/h2>\n\n\n\n<p>Ruta graveolens can have health benefits, but it also comes with some risks and side effects. Here’s a simple overview of who should avoid it and what the potential issues are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant Women:<\/strong> Rue can cause contractions in the uterus, which may lead to miscarriage. Pregnant women should stay away from it completely.<\/li>\n\n\n\n<li><strong>Breastfeeding Mothers:<\/strong> There isn&#8217;t enough information on how safe rue is for nursing mothers, so it’s best to avoid it to protect the baby.<\/li>\n\n\n\n<li><strong>Children:<\/strong> While very small doses might be okay under a doctor’s guidance, children should generally avoid rue due to the risk of toxicity.<\/li>\n\n\n\n<li><strong>People with Allergies:<\/strong> If you are allergic to plants in the Rutaceae family, you should avoid rue, as it might cause allergic reactions.<\/li>\n\n\n\n<li><strong>Individuals with Certain Health Problems:<\/strong> Rue should not be used by individuals with kidney, liver, or gastrointestinal problems without consulting a doctor.<\/li>\n\n\n\n<li><strong>People Taking Certain Medications:<\/strong> Rue can interact with some medications, especially blood thinners. Always check with a healthcare provider if you’re on medication before using Ruta.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects And Risks Of Using Ruta Graveolens<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Toxicity:<\/strong> Taking large amounts of rue can be harmful and cause symptoms like nausea, vomiting, diarrhoea, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-stomach-pain-with-homeopathy\"   title=\"stomach pain\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"975\">stomach pain<\/a>.<\/li>\n\n\n\n<li><strong>Skin Irritation:<\/strong> Rue can irritate the skin, especially when exposed to sunlight, leading to rashes or blistering.<\/li>\n\n\n\n<li><strong>Digestive Issues:<\/strong> Some people might experience an upset stomach or cramping after using rue.<\/li>\n\n\n\n<li><strong>Headaches and Dizziness:<\/strong> High doses or sensitivity can lead to headaches and dizziness for some individuals.<\/li>\n\n\n\n<li><strong>Allergic Reactions:<\/strong> People sensitive to rue may develop skin reactions like rashes or hives.<\/li>\n\n\n\n<li><strong>Eye Damage:<\/strong> Rue can harm the eyes if it comes into contact with them, causing irritation or injury.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3124362\/<br>https:\/\/www.ucl.ac.uk\/~ucgajpd\/medicina%20antiqua\/sa_rue.html<br>https:\/\/www.drugs.com\/npp\/rue.html<br>https:\/\/onlinelibrary.wiley.com\/doi\/10.1155\/2020\/5626382<br>https:\/\/www.rxlist.com\/supplements\/rue.htm<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Ruta graveolens safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Ruta graveolens is generally considered safe when used in recommended potencies and under professional guidance.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Ruta graveolens to babies?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens can be given to babies in very diluted homeopathic forms, such as 30C pellets, typically 1-2 pellets dissolved in a small amount of water.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Ruta Graveolens work?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens has anti-inflammatory and analgesic effects, helping to relieve pain and reduce swelling in muscles and joints. Its active compounds promote the healing of soft tissues and improve circulation, making it effective for injuries and strains.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Ruta Graveolens take to work?<\/h4><p class=\"saswp-faq-answer-text\">The impact of Ruta graveolens can normally be observed for about 30 minutes to a few hours after administration, depending on the formulation and reaction of the person. In chronic diseases, it can take some time, at times several days, to see remarkable recovery.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Ruta graveolens be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens can be used daily and as a homeopathic remedy, but it should not be taken in large doses or regularly without knowing the right proportion. It should also be detected if administered as long-term therapy because of side effects or toxicity if taken at high doses.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Ruta graveolens used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens is used for disorders of the muscles, bones, and joints, eye strain, and other tissue injuries, including tendons and ligaments. It also fades bruises, inflammation, stomach ailments, and spasms.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Ruta graveolens used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, Ruta graveolens is also recommended to cure diseases such as joint or muscle pain caused by trauma or overuse. This is also good for the eyes, especially in cases of strain or injury, tendinitis, and for treatment of bruises.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of Ruta graveolens tonic?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens tonic has advantages in remedies for sprains, strains, injuries involving tendons and ligaments, eye strain, and fatigue. In addition, it has an anti-inflammatory effect useful for use in arthritic conditions and the gastrointestinal tract.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Ruta graveolens malt homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens malt is used in homeopathic medicine as a painkiller for joint and muscular pain resulting from overstress or injuries. It also has functions of treating bruises and tendon injury, with an anti-inflammatory function and aiding in the healing process.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Ruta graveolens homeopathic medicine used for?<\/h4><p class=\"saswp-faq-answer-text\">Ruta graveolens homeopathic remedy is used to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use. It also relieves eye strain, reduces susceptibility to bruising and inflammation, and enhances the healing of soft tissue injury.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Ruta Graveolens? Ruta Graveolens, also known as rue, is an herbal and homeopathic medicine plant. It was originally found in Europe and has been employed to treat many diseases of the human body. In traditional medicine, Ruta is used for muscle and joint pains; therefore, it can be used to manage arthritis and sprains. It is also applied for eye problems such as fatigue resulting from extended use of computers or watching TV and bodily injuries that include bruises and tendon strains. In the homeopathic system of medicine, the crude drug Ruta Graveolens is employed in low concentration <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-2212","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ruta Graveolens - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Ruta Graveolens Homeopathic Uses to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ruta Graveolens - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Ruta Graveolens Homeopathic Uses to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-10-02T13:37:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-02T13:37:29+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Ruta Graveolens - Uses, Dosage, Side Effects, Composition And More","description":"Ruta Graveolens Homeopathic Uses to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses","og_locale":"en_US","og_type":"article","og_title":"Ruta Graveolens - Uses, Dosage, Side Effects, Composition And More","og_description":"Ruta Graveolens Homeopathic Uses to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use.","og_url":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-10-02T13:37:28+00:00","article_modified_time":"2024-10-02T13:37:29+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Ruta Graveolens &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-10-02T13:37:28+00:00","dateModified":"2024-10-02T13:37:29+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses"},"wordCount":1744,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses","url":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses","name":"Ruta Graveolens - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-10-02T13:37:28+00:00","dateModified":"2024-10-02T13:37:29+00:00","description":"Ruta Graveolens Homeopathic Uses to treat muscular and arthritis pains, especially those arising from accidental impacts or excessive joint use.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/ruta-graveolens-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/ruta-graveolens-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Ruta Graveolens &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2212","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=2212"}],"version-history":[{"count":5,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2212\/revisions"}],"predecessor-version":[{"id":3486,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2212\/revisions\/3486"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=2212"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=2212"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=2212"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}