{"id":2230,"date":"2024-10-05T14:19:06","date_gmt":"2024-10-05T14:19:06","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=2230"},"modified":"2025-01-14T16:25:15","modified_gmt":"2025-01-14T16:25:15","slug":"rauvolfia-serpentina-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/rauvolfia-serpentina-uses","title":{"rendered":"Rauvolfia Serpentina &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What Is Rauvolfia Serpentina?<\/h2>\n\n\n\n<p>Rauvolfia serpentina is commonly known as Indian snakeroot, devil pepper, serpentine wood, sarpagandha or locally known as chandrika. It is a species of flower coming from the milkweed family Apocynaceae. It is native to the Indian subcontinent and East Asia, which is from India to Indonesia. It has been widely used in folk medicine in India for centuries to treat a wide variety of maladies, including snake and insect bites, febrile conditions, malaria, abdominal pain, and dysentery. It was also used as a uterine stimulant, febrifuge, and cure for insanity.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Rauvolfia Serpentina Chemical Constituents<\/h2>\n\n\n\n<p>Rauvolfia serpentina contains large quantities of alkaloids of the indole alkaloid family, including ajmaline, ajmalicine, reserpine, and serpentine, among others. Rauwolfia serpentina contains several other compounds, including carbohydrates, flavonoids, glycosides, phlobatannins, phenols, resins, saponins, and sterols. In addition to these, the dried roots of the plant have been found to contain new compounds such as indole alkaloids, iridoid glucosides, and sucrose derivatives.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Rauvolfia Serpentina Preparation<\/h2>\n\n\n\n<p>Rauvolfia serpentina is prepared through various methods depending on the desired results and the potency of the drug required.<\/p>\n\n\n\n<p>Here are some of the commonly used methods of preparation of Rauvolfia serpentina:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The mother tincture is made by extracting the entire Rauwolfia serpentina plant, including roots, stems, leaves, and flowers, using a solvent like alcohol to capture its therapeutic properties. The dried root is soaked in a mixture of alcohol and water for several weeks and then filtered to remove any impurities. After that, the extract is diluted with water or alcohol before being taken orally.<\/li>\n\n\n\n<li>For the methanolic root extract, the roots are ground into powder and soaked in methanol overnight. The mixture is then filtered and concentrated until dry.<\/li>\n\n\n\n<li>To create a nanosuspension, an antisolvent precipitation method is used, combining Rauwolfia serpentina with hydroxypropyl methyl cellulose (HPMC).<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Rauvolfia Serpentina Mother Tincture<\/h2>\n\n\n\n<p>Rauwolfia serpentina mother tincture is useful for lowering high <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"blood pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1006\">blood pressure<\/a>, calming restlessness, and improving sleep. It helps soothe the nervous system and reduce feelings of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1268\">anxiety<\/a>. This medicine can also help with symptoms like an irregular heartbeat, emotional excitability, irritability in the central nervous system, and general restlessness.<\/p>\n\n\n\n<p>Here are some of the major benefits of Rauvolfia serpentina discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>It can help control high blood pressure and its related symptoms.<\/li>\n\n\n\n<li>May assist in reducing headaches.<\/li>\n\n\n\n<li>Helps relieve dryness and congestion in the nose.<\/li>\n\n\n\n<li>Calms the nervous system and reduces anxiety.<\/li>\n\n\n\n<li>Relaxes blood vessels by lowering noradrenaline levels, improving blood flow.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits Of Rauvolfia Serpentina<\/h2>\n\n\n\n<p>Rauvolfia serpentina is a medicinal plant known for its various health benefits, particularly in traditional medicine. Here are some of the major benefits of Rauvolfia serpentina discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Lower High Blood Pressure:<\/strong> The alkaloids present in Rauvolfia serpentina, particularly reserpine, relax blood vessels, improving blood flow and helping reduce overall blood pressure levels.<\/li>\n\n\n\n<li><strong>Relaxes Nervous System:<\/strong> It has a calming effect on the nervous system, making it useful for people dealing with anxiety, restlessness, or nervousness. It helps reduce emotional excitability and promotes a sense of relaxation.<\/li>\n\n\n\n<li><strong>Promotes Better Sleep:<\/strong> Rauvolfia serpentina helps people who suffer from <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-insomnia-with-homeopathy\"   title=\"insomnia\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1005\">insomnia<\/a> or sleeplessness by soothing the mind and body, making it easier to fall asleep naturally.<\/li>\n\n\n\n<li><strong>Regulates Heart Function:<\/strong> This plant is beneficial for regulating heart function by managing symptoms like irregular heartbeats or palpitations, maintaining a stable heart rate, and promoting overall cardiovascular health.<\/li>\n\n\n\n<li><strong>Relieves Headaches and Migraines:<\/strong> The ability to relax blood vessels and calm the nerves makes it an effective remedy for managing tension-related headaches and migraines.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Rauvolfia Serpentina Treat?<\/h2>\n\n\n\n<p>Rauvolfia serpentina is widely used to treat various medical conditions. It is especially known for its ability to treat various conditions related to the heart, nervous system, and mental health.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>High Blood Pressure (Hypertension):<\/strong> Perhaps the most famous example of Rauvolfia serpentine being used to cure hypertension is that it contains reserpine, a chemical that helps to reduce blood pressure. Reserpine dilates blood vessels and decreases the levels of a catecholamine hormone called noradrenaline, which constricts blood vessels.<\/li>\n\n\n\n<li><strong>Anxiety and Restlessness:<\/strong> This assists in sedating the Central Nervous System it also eradicates anxieties or tension. For this reason, he suggests using it as a cure for psychological disorders and any stress-related complaints.<\/li>\n\n\n\n<li><strong>Mental Health Conditions:<\/strong> It also helps in stabilizing emotions which makes it easier for anyone with mood swings, irritability or overly emotional reactions.<\/li>\n\n\n\n<li><strong>Headaches and Migraines:<\/strong> It assists in curing headaches, mainly tension headaches and headaches that result from high blood pressure. It can help in reducing blood pressure in veins and nerves; hence, it has the capacity to prevent both usual headaches and severe migraines.<\/li>\n\n\n\n<li><strong>Nasal Congestion and Respiratory Issues:<\/strong> The whole plant of Rauvolfia serpentina is employed in the treatment of conditions that affect the respiration system, especially sinusitis conditions. It offers relief from the stuffy nose as it eliminates congestion and dryness enabling everyone to breathe well.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Rauvolfia Serpentina Homeopathic Uses<\/h2>\n\n\n\n<p>Rauvolfia serpentina is a plant used in homeopathic medicine for treating various health issues. Here are some of the major homeopathic medicine uses of Rauvolfia serpentina discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Hypertension:<\/strong> It relaxes blood vessels, making it easier for blood to flow and helping to lower blood pressure naturally.<\/li>\n\n\n\n<li><strong>Anxiety and Stress:<\/strong> Rauvolfia serpentina is known for its calming effects and is believed to help people who feel very tense or agitated. Some People who experience constant stress, restlessness, or anxiety majorly Rauvolfia serpentina to calm their nerves.<\/li>\n\n\n\n<li><strong>Sleeplessness:<\/strong> Rauvolfia serpentina is helpful for those who have trouble sleeping due to anxiety or an overactive mind. It relaxes the mind and helps people get quality sleep.<\/li>\n\n\n\n<li><strong>Mental Health:<\/strong> In homeopathy, Rauvolfia serpentina is sometimes used to support individuals dealing with mild mental health conditions like depression or emotional instability.<\/li>\n\n\n\n<li><strong>Heart Health:<\/strong> Rauvolfia serpentina is used in homeopathy to support overall heart health. It benefits the heart by lowering blood pressure and reducing strain.<\/li>\n\n\n\n<li><strong>Nervous System Issues:<\/strong> Rauvolfia serpentina also treats medical conditions affecting the nervous system, such as tremors, twitching, or other signs of nervous tension.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Rauvolfia Serpentina Dosage<\/h2>\n\n\n\n<p>The dosage of Rauvolfia serpentina in homeopathy can vary depending on the condition being treated and the individual’s needs. In the case of higher potencies like 6C or 30C, 2-3 pellets may be taken once or twice daily, depending on the recommendation of a homeopath. Homeopathic remedies like Rauvolfia serpentina are typically taken on an empty stomach and should be placed under the tongue for better absorption.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Rauvolfia Serpentina Dosage For Adults<\/h3>\n\n\n\n<p>The dosage of Rauvolfia serpentina for adults in homeopathy depends on the condition being treated and the form of the medicine like the mother tincture or diluted potencies. Always consult a doctor before starting mother tincture, as it can have a stronger effect. <\/p>\n\n\n\n<p>Lower potencies of Rauvolfia serpentina, like 6C, may be used for mild symptoms like anxiety or headaches, while higher potencies, like 30C, are used for more chronic conditions such as hypertension or mental stress. It is important to take the remedy on an empty stomach and avoid strong flavours like mint, coffee, or garlic close to the time of taking medicine for better effectiveness.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Rauvolfia Serpentina Dosage For Children<\/h3>\n\n\n\n<p>The dosage of Rauvolfia serpentina for children in homeopathy should be carefully monitored and adjusted based on the child’s age, weight, and condition. It is always best to consult a homeopathic doctor before administering this medicine to children. Higher potencies, such as 30C, may be used in older children or for more chronic conditions but under a homeopath&#8217;s guidance. Always consult a pediatrician or homeopath for the safest and most effective dosage for children.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Rauvolfia Serpentina?<\/h2>\n\n\n\n<p>Rauvolfia serpentina is a natural medicine, but it may not be suitable for everyone. While it has many benefits, there are certain people who should avoid it, and there can be side effects or risks if not used properly.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant or Breastfeeding Women:<\/strong> Due to a lack of proper research on the effects of this medicine on pregnant or breastfeeding women, it is generally not safe to use Rauvolfia serpentina because it may affect the baby’s health.<\/li>\n\n\n\n<li><strong>People with Low Blood Pressure:<\/strong> Since Rauvolfia serpentina is used to lower high blood pressure, people who already have low blood pressure should avoid it, as it could make their blood pressure drop too low, causing dizziness or fainting.<\/li>\n\n\n\n<li><strong>People Taking Certain Medications:<\/strong> If you are already taking medication for high blood pressure, heart problems, or mental health issues, you should avoid Rauvolfia serpentina unless advised by a doctor.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects And Risks Of Using Rauvolfia Serpentina<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Drowsiness and Fatigue:<\/strong> Rauvolfia serpentina has calming effects on the nervous system, hence one common side effect is feeling very sleepy or tired.<\/li>\n\n\n\n<li><strong>Depression and Mood Changes:<\/strong> High doses or prolonged use of Rauvolfia serpentina can sometimes cause depressive symptoms or mood swings.<\/li>\n\n\n\n<li><strong>Stomach Upset: <\/strong>Rauvolfia serpentina can irritate the stomach, leading to nausea, vomiting, or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1440\">diarrhea<\/a> in some people.<\/li>\n\n\n\n<li><strong>Heart Issues:<\/strong> If Rauvolfia serpentina is used incorrectly or in combination with other medications, it can cause a slow heart rate or other heart problems.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4566472\/<br>https:\/\/www.sciencedirect.com\/topics\/pharmacology-toxicology-and-pharmaceutical-science\/rauvolfia-serpentina<br>https:\/\/go.drugbank.com\/drugs\/DB09363<br>https:\/\/www.webmd.com\/vitamins\/ai\/ingredientmono-787\/indian-snakeroot<br>https:\/\/www.britannica.com\/plant\/Rauvolfia<br>https:\/\/www.1mg.com\/otc\/sbl-rauwolfia-serpentina-mother-tincture-q-otc338425?wpsrc=Google+Organic+Search<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Rauvolfia serpentina safe?<\/h4><p class=\"saswp-faq-answer-text\">Homeopathic Rauvolfia serpentina is generally considered safe when used in highly diluted forms and under the guidance of a healthcare professional. However, it may not be suitable for pregnant women, people with low blood pressure, or those taking certain medications.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Rauvolfia serpentina to babies?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina should only be given to babies under the guidance of a qualified homeopathic doctor. Dosages for infants are typically very small, using highly diluted potencies like 6C or 12C. Avoid using mother tincture for babies, and consult a healthcare professional for the safest approach.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Rauvolfia serpentina work?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina works by lowering blood pressure and calming the nervous system. It contains alkaloids like reserpine, which help relax blood vessels, reduce heart rate, and decrease nerve impulses, leading to a calming effect on the body and mind.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Rauvolfia serpentina take to work?<\/h4><p class=\"saswp-faq-answer-text\">The effects of Rauvolfia serpentina can take a few days to a couple of weeks to become noticeable, depending on the condition being treated and the dosage used. For issues like high blood pressure, it may take longer, while calming effects for anxiety or stress may be felt sooner.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Rauvolfia serpentina be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina can be taken daily, but only under the supervision of a healthcare professional. Long-term use or incorrect dosage can lead to side effects, so it&#8217;s important to follow medical advice for safe and effective daily use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Rauvolfia serpentina used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina is used to treat high blood pressure, anxiety, stress, insomnia, and certain mental health conditions. It also helps with nervous system issues and headaches.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Rauvolfia serpentina used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, Rauvolfia serpentina is primarily used to treat high blood pressure, anxiety, insomnia, restlessness, and nervous system disorders.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of Rauvolfia serpentina tonic?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina tonic helps lower high blood pressure, reduce anxiety, calm the nervous system, and improve sleep. It may also relieve stress-related headaches and support heart health.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Rauvolfia serpentina homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Rauvolfia serpentina homeopathic medicine is used to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders. It helps calm the mind, promote relaxation, and manage tension-related headaches.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you use Rauvolfia serpentina mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">To use Rauvolfia serpentina mother tincture, typically take 5 to 10 drops diluted in half a cup of water 2-3 times a day. It should be taken on an empty stomach, and it is important to consult a healthcare professional for specific dosage and guidance.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What Is Rauvolfia Serpentina? Rauvolfia serpentina is commonly known as Indian snakeroot, devil pepper, serpentine wood, sarpagandha or locally known as chandrika. It is a species of flower coming from the milkweed family Apocynaceae. It is native to the Indian subcontinent and East Asia, which is from India to Indonesia. It has been widely used in folk medicine in India for centuries to treat a wide variety of maladies, including snake and insect bites, febrile conditions, malaria, abdominal pain, and dysentery. It was also used as a uterine stimulant, febrifuge, and cure for insanity. Rauvolfia Serpentina Chemical Constituents Rauvolfia serpentina <\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-2230","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Rauvolfia Serpentina - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Rauvolfia Serpentina Homeopathic Uses to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Rauvolfia Serpentina - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Rauvolfia Serpentina Homeopathic Uses to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-10-05T14:19:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2025-01-14T16:25:15+00:00\" \/>\n<meta name=\"author\" content=\"Dheeraj Sharma\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dheeraj Sharma\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Rauvolfia Serpentina - Uses, Dosage, Side Effects, Composition And More","description":"Rauvolfia Serpentina Homeopathic Uses to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses","og_locale":"en_US","og_type":"article","og_title":"Rauvolfia Serpentina - Uses, Dosage, Side Effects, Composition And More","og_description":"Rauvolfia Serpentina Homeopathic Uses to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders.","og_url":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-10-05T14:19:06+00:00","article_modified_time":"2025-01-14T16:25:15+00:00","author":"Dheeraj Sharma","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Dheeraj Sharma","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/rauvolfia-serpentina-uses"},"author":{"name":"Dheeraj Sharma","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3"},"headline":"Rauvolfia Serpentina &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-10-05T14:19:06+00:00","dateModified":"2025-01-14T16:25:15+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/rauvolfia-serpentina-uses"},"wordCount":1557,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/rauvolfia-serpentina-uses","url":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses","name":"Rauvolfia Serpentina - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-10-05T14:19:06+00:00","dateModified":"2025-01-14T16:25:15+00:00","description":"Rauvolfia Serpentina Homeopathic Uses to treat high blood pressure, anxiety, insomnia, stress, and nervous system disorders.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/rauwolfia-serpentina-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Rauvolfia Serpentina &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3","name":"Dheeraj Sharma","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","caption":"Dheeraj Sharma"},"description":"Dr. Dheeraj Sharma stands as a distinguished figure in the field of homoeopathy and is renowned for his innovative approach and steadfast commitment to excellence. Dr. Sharma has established himself as a leader in healthcare, blending traditional healing techniques with modern medical advancements to deliver holistic and patient-centered care. His dedication to improving patient outcomes and pushing the boundaries of healthcare has earned him widespread recognition and admiration in the field.","sameAs":["https:\/\/weclinic.in\/dr-dheeraj-sharma.php","https:\/\/www.linkedin.com\/in\/dr-dheeraj-sharma-35a93821b"],"url":"https:\/\/weclinic.in\/blog\/author\/dheeraj_sharma"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2230","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=2230"}],"version-history":[{"count":5,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2230\/revisions"}],"predecessor-version":[{"id":2675,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2230\/revisions\/2675"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=2230"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=2230"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=2230"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}