{"id":520,"date":"2024-02-23T05:44:06","date_gmt":"2024-02-23T05:44:06","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=520"},"modified":"2024-02-23T05:44:11","modified_gmt":"2024-02-23T05:44:11","slug":"azadirachta-indica-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses","title":{"rendered":"Azadirachta Indica &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Azadirachta Indica?<\/h2>\n\n\n\n<p>Azadirachta Indica, commonly known as Neem or Nimba, is a large evergreen tree native to India and Burma. It has been widely used in traditional Indian medicine for centuries to treat various ailments. The medicinal constituents of Neem include azadirachtin, nimbidin, and quercetin. <\/p>\n\n\n\n<p>Combining these medicinal constituents makes Azadirachta Indica a valuable natural remedy with many therapeutic applications. Its traditional use in Indian medicine is supported by modern scientific research, highlighting its potential in treating various health conditions.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Azadirachta Indica chemical constituents<\/h2>\n\n\n\n<p>The primary chemical constituents of Neem are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Nimbidin:<\/strong> Nimbidin, a bitter alkaloid extracted from the neem tree, exhibits anti-inflammatory and antioxidant properties. Its anti-inflammatory effects are attributed to its ability to inhibit the production of inflammatory mediators, while its antioxidant properties help protect cells from damage caused by free radicals.<\/li>\n\n\n\n<li><strong>Quercetin:<\/strong> Quercetin, a flavonoid found in the neem tree, possesses antioxidant and anti-allergic properties. As an antioxidant, it helps neutralize free radicals, protecting cells from damage. It has anti-allergic properties due to its ability to inhibit the release of histamine, a key mediator of allergic reactions.<\/li>\n\n\n\n<li><strong>Nimbin:<\/strong> Nimbin, a bitter principle isolated from the neem tree, exhibits anti-inflammatory and antipyretic properties. Its anti-inflammatory effects are attributed to its ability to inhibit the production of inflammatory mediators, while its antipyretic properties help reduce fever by lowering body temperature.<\/li>\n\n\n\n<li><strong>Gedunin:<\/strong> Gedunin, a limonoid found in the neem tree, possesses anti-inflammatory and antitumor properties. Its anti-inflammatory effects and its ability to inhibit the production of inflammatory mediators. In contrast, its antitumor properties to its ability to induce apoptosis, or programmed cell death, in cancer cells.<\/li>\n\n\n\n<li><strong>Azadiradione:<\/strong> Azadiradione, a triterpenoid isolated from the neem tree, exhibits anti-inflammatory and antitumor properties. Its anti-inflammatory effects and its ability to inhibit the production of inflammatory mediators. In contrast, its antitumor properties are compared to its ability to inhibit the growth and proliferation of cancer cells.<\/li>\n\n\n\n<li><strong>Azadirachtin:<\/strong> Azadirachtin, a potent insecticide and antifeedant, is derived from the neem tree. It disrupts the growth and development of insects, making it an effective natural pest control agent. Additionally, it possesses antifeedant properties, deterring insects from feeding on treated plants.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Azadirachta Indica Preparation<\/h2>\n\n\n\n<p>Steps which are needed to be followed for Azadirachta medicine preparation :<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Collection of fresh Neem leaves:<\/strong> The first step in preparing a homeopathic mother tincture of Azadirachta Indica is to collect fresh leaves from the neem tree. These leaves are carefully selected for their quality and potency.<\/li>\n\n\n\n<li><strong>Thorough washing of the leaves: <\/strong>Once collected, the neem leaves are thoroughly washed to remove any dirt, dust, or impurities. It ensures the purity and cleanliness of the final tincture.<\/li>\n\n\n\n<li><strong>Crushing and maceration of the leaves:<\/strong> The washed neem leaves are then crushed or macerated to release their active constituents. This process helps extract the medicinal properties of the leaves into the alcohol.<\/li>\n\n\n\n<li><strong>Maceration in alcohol for several weeks:<\/strong> The crushed neem leaves are macerated in alcohol for several weeks. It allows the alcohol to dissolve and extract the active compounds from the leaves. The duration of maceration depends on the desired potency of the tincture.<\/li>\n\n\n\n<li><strong>Filtration of the tincture: <\/strong>After maceration, the mixture is filtered to remove any solid particles, such as leaf fragments or impurities. This results in a clear and potent tincture.<\/li>\n\n\n\n<li><strong>Dilution to the desired potency:<\/strong> The filtered tincture is then diluted to the desired potency using a specific dilution method. This process reduces the concentration of the tincture while preserving its therapeutic properties.<\/li>\n\n\n\n<li><strong>Storage of the mother tincture:<\/strong> The prepared mother tincture is stored in a cool, dark place to maintain its potency and stability over time.<\/li>\n\n\n\n<li><strong>Homeopathic preparation:<\/strong> The mother tincture can be further diluted and potentized using homeopathic techniques to create various potencies suitable for different individuals and conditions.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Azadirachta Indica mother tincture<\/h2>\n\n\n\n<p>The mother tincture of Azadirachta Indica is a highly concentrated extract of the neem leaves. It is used to prepare homeopathic dilutions, which are utilized to treat various ailments. The mother tincture is also employed in aromatherapy and as a natural insect repellent. The mother tincture of Neem is commonly used in homeopathy to treat various ailments, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Skin conditions:<\/strong> Azadirachta Indica (Neem) effectively treats acne, eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"147\">psoriasis<\/a>, and other skin problems due to its antibacterial and anti-inflammatory properties.<\/li>\n\n\n\n<li><strong>Digestive issues<\/strong> can help alleviate digestive problems such as indigestion, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-constipation-with-homeopathy\"   title=\"constipation\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"938\">constipation<\/a>, and diarrhea. It also helps improve liver function.<\/li>\n\n\n\n<li><strong>Infections: <\/strong>Its antibacterial and antiviral properties make it helpful in treating diseases of the respiratory tract, urinary tract, and gastrointestinal tract.<\/li>\n\n\n\n<li><strong>Malaria: <\/strong>Neem is traditionally used to prevent and treat malaria. It is believed to have antimalarial properties.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Azadirachta Indica<\/h2>\n\n\n\n<p>Expected benefits of Azadirachta Indica include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Antibacterial:<\/strong> Neem is effective against many bacteria, including Staphylococcus aureus, Escherichia coli, and Pseudomonas aeruginosa.<\/li>\n\n\n\n<li><strong>Antifungal:<\/strong> Neem has also been shown to be effective against a variety of fungi, including Candida albicans and Aspergillus niger.<\/li>\n\n\n\n<li><strong>Antiviral:<\/strong> It is effective against various viruses, including herpes simplex virus, influenza virus, and HIV.<\/li>\n\n\n\n<li><strong>Anti-inflammatory:<\/strong> Neem has been shown to reduce inflammation in various animal models.<\/li>\n\n\n\n<li><strong>Antioxidant:<\/strong> It has been shown to protect cells from damage caused by free radicals.<\/li>\n\n\n\n<li><strong>Antidiabetic:<\/strong> Neem has been shown to lower blood sugar levels in animal models.<\/li>\n\n\n\n<li><strong>Anticancer:<\/strong> It has been shown to inhibit the growth of cancer cells in vitro and animal models.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Azadirachta Indica treat?<\/h2>\n\n\n\n<p>Common and severe ailments that Azadirachta Indica can treat are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Acne:<\/strong> It helps clear acne by reducing inflammation and killing the bacteria that cause it.<\/li>\n\n\n\n<li><strong>Athlete&#8217;s foot:<\/strong> Azadirachta Indica&#8217;s antifungal and antibacterial properties help eliminate the fungus that causes athlete&#8217;s foot, relieving itching and burning.<\/li>\n\n\n\n<li><strong>Boils:<\/strong> Azadirachta Indica helps to draw out pus and promote the healing of boils, reducing pain and discomfort.<\/li>\n\n\n\n<li><strong>Burns:<\/strong> Azadirachta Indica&#8217;s soothing and healing properties help to relieve pain and promote faster healing of burns.<\/li>\n\n\n\n<li><strong>Chickenpox:<\/strong> It helps to reduce itching and promote the healing of chickenpox blisters, easing discomfort and preventing scarring.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-cold-with-homeopathy\"   title=\"Cold\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2368\">Cold<\/a> sores:<\/strong> It helps reduce the duration and severity of cold sores, relieving pain and discomfort.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-dandruff-with-homeopathy\"   title=\"Dandruff\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"786\">Dandruff<\/a>: <\/strong>Azadirachta Indica helps reduce the itching and flaking associated with dandruff, leaving hair and scalp healthier.<\/li>\n\n\n\n<li><strong>Dermatitis:<\/strong> It helps reduce inflammation and itching associated with dermatitis, relieving discomfort and promoting healing.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"Eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1661\">Eczema<\/a>: <\/strong>Azadirachta Indica helps to reduce inflammation and itching associated with eczema, providing relief from discomfort and promoting healing.<\/li>\n\n\n\n<li><strong>Fever: <\/strong>Azadirachta Indica helps reduce fever by promoting sweating, relieving discomfort, and aiding in the body&#8217;s natural healing process.<\/li>\n\n\n\n<li><strong>Flu: <\/strong>It helps reduce flu symptoms, such as fever, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-homeopathy-can-help-in-treating-cough\"   title=\"cough\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"84\">cough<\/a>, and sore throat, aiding recovery and promoting overall well-being.<\/li>\n\n\n\n<li><strong>Herpes:<\/strong> Azadirachta Indica helps to reduce the duration and severity of herpes outbreaks, providing relief from pain and discomfort.<\/li>\n\n\n\n<li><strong>Insect bites and stings:<\/strong> Azadirachta Indica helps to reduce itching and swelling caused by insect bites and stings, providing relief from discomfort and promoting healing.<\/li>\n\n\n\n<li><strong>Malaria:<\/strong> It is effective in treating malaria, a severe and potentially life-threatening disease.<\/li>\n\n\n\n<li><strong>Psoriasis:<\/strong> Azadirachta Indica helps reduce inflammation and itching associated with psoriasis, relieving discomfort and promoting healing.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-ringworm-with-homeopathy\"   title=\"Ringworm\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"183\">Ringworm<\/a>:<\/strong> Azadirachta Indica&#8217;s antifungal properties help to treat ringworm, a common skin infection caused by a fungus.<\/li>\n\n\n\n<li><strong>Scabies: <\/strong>It helps kill scabies mites and relieve itching, relieving discomfort and promoting healing.<\/li>\n\n\n\n<li><strong>Shingles:<\/strong> Azadirachta Indica helps to reduce pain and itching associated with shingles, a viral infection that can cause severe discomfort.<\/li>\n\n\n\n<li><strong>Skin infections:<\/strong> Azadirachta Indica&#8217;s antibacterial and antifungal properties help treat various skin infections, relieving discomfort and promoting healing.<\/li>\n\n\n\n<li><strong>Thrush: <\/strong>Azadirachta Indica&#8217;s antifungal properties help to treat thrush, a common fungal infection that can cause discomfort and pain.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-warts-with-homeopathy\"   title=\"Warts\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"63\">Warts<\/a>: <\/strong>It helps remove warts, common skin growths that can be unsightly and uncomfortable.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Azadirachta Indica Homeopathic Medicine Uses<\/h2>\n\n\n\n<p>Azadirachta Indica (Neem) is given in various forms:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Oral administration for internal ailments:<\/strong> Neem can be taken orally in tablets, capsules, or liquid extracts to treat multiple internal ailments, such as acne, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"46\">diabetes<\/a>, and malaria. It is believed to have antibacterial, antiviral, and anti-inflammatory properties to help alleviate symptoms and promote healing.<\/li>\n\n\n\n<li><strong>Topical application for skin conditions:<\/strong> Neem can be applied directly to the skin in the form of creams, ointments, or oils to treat a variety of skin conditions, including eczema, psoriasis, and ringworm. Its antibacterial, antifungal, and anti-inflammatory properties help soothe irritated skin, reduce inflammation, and promote healing.<\/li>\n\n\n\n<li><strong>Inhalation for respiratory problems:<\/strong> Neem can be inhaled as steam or vapor to treat respiratory issues, such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-asthma-with-homeopathy\"   title=\"asthma\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"847\">asthma<\/a> and bronchitis. Its decongestant and expectorant properties help clear nasal congestion, reduce inflammation in the airways, and promote easier breathing.<\/li>\n\n\n\n<li><strong>Neem oil:<\/strong> It is extracted from the neem tree and is commonly used in oral and topical applications. It is believed to have antibacterial, antiviral, and antifungal properties, making it beneficial for treating various ailments, including skin infections, lice, and dental problems.<\/li>\n\n\n\n<li><strong>Neem leaves for traditional remedies:<\/strong> Neem leaves have been traditionally used in different cultures for their medicinal properties. They can be consumed fresh or dried as extracts to support overall health and well-being. Neem leaves are believed to have antioxidant, anti-inflammatory, and blood-purifying properties.<\/li>\n\n\n\n<li><strong>Neem bark for dental care:<\/strong> Neem bark is known for its astringent and antibacterial properties. Traditional dental care often uses it to strengthen gums, reduce inflammation, and prevent tooth decay. Neem bark extracts can be found in various oral hygiene products, such as toothpaste and mouthwash.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Azadirachta Indica dosage<\/h2>\n\n\n\n<p>Important points that should be considered regarding dosage of Azadirachta indica are :<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Dosage should be individualized:<\/strong> The dosage of Azadirachta Indica should be determined case-by-case, considering the patient&#8217;s condition, symptoms, and overall health.<\/li>\n\n\n\n<li><strong>Start with a low dose:<\/strong> It is generally recommended to start with a low dose of medicine and gradually increase the dosage as needed under the guidance of a qualified homeopathic practitioner at WeClinic.<\/li>\n\n\n\n<li><strong>Follow the instructions of your homeopathic practitioner:<\/strong> The specific dosage of Azadirachta Indica that is right for you will depend on your individual needs and the condition being treated. Always follow your homeopathic practitioner&#8217;s instructions regarding dosage and administration frequency.<\/li>\n\n\n\n<li><strong>Consider the form of Azadirachta Indica:<\/strong> It is available in various forms, including tablets, capsules, liquid extracts, and topical ointments or creams. The dosage may vary depending on the form of Azadirachta Indica being used.<\/li>\n\n\n\n<li><strong>Monitor your response to treatment: <\/strong>It is crucial to monitor your response to therapy with Azadirachta Indica and discuss any changes or concerns with your homeopathic practitioner. They may adjust the dosage or frequency of administration as needed.<\/li>\n\n\n\n<li><strong>Please stay within the recommended dosage:<\/strong> It is vital to adhere to the recommended dosage of medicine and stay within it. Taking more than the recommended dosage may not provide additional benefits and may increase the risk of side effects.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Azadirachta Indica dosage for adults<\/h3>\n\n\n\n<p>The recommended dosage for adults is 1-2 tablets or capsules thrice daily. However, it is essential to note that this is a general guideline, and the dosage may vary depending on the patient. Patients should always consult a qualified homeopathic practitioner at WeClinic to determine the appropriate dosage for their specific condition.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Azadirachta Indica dosage for children<\/h3>\n\n\n\n<p>The recommended dosage for children is 1\/2 to 1 tablet or capsule thrice daily. However, it is important to note that this is a general guideline, and the dosage may vary depending on the patient. Patients should always consult a qualified <a href=\"https:\/\/weclinic.in\/\">homeopathic practitioner<\/a> to determine the appropriate dosage for their condition.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who should avoid Azadirachta Indica? \/ Side effects and risks of using of Azadirachta Indica<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant women:<\/strong> Neem should be avoided during pregnancy as it may stimulate uterine contractions and potentially lead to miscarriage.<\/li>\n\n\n\n<li><strong>Breastfeeding women:<\/strong> Neem should be avoided during breastfeeding as it may pass into breast milk and potentially harm the baby.<\/li>\n\n\n\n<li><strong>Children under two years of age:<\/strong> Neem should not be given to children under two years of age as their bodies are still developing and may be more susceptible to side effects.<\/li>\n\n\n\n<li><strong>People with liver or kidney disease:<\/strong> Neem should be used with caution in individuals with liver or kidney disease as it may worsen their condition.<\/li>\n\n\n\n<li><strong>People taking blood thinners:<\/strong> Neem may interact with blood thinners and increase the risk of bleeding. Therefore, you must consult a healthcare professional before taking Neem if you are on blood thinners.<\/li>\n\n\n\n<li><strong>People taking diabetes medications:<\/strong> Neem may interact with diabetes medications and lower blood sugar levels too much. Hence, individuals with diabetes should consult their doctor before taking Neem to avoid potential complications.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Boericke, Materia Medica with Repertory<\/li>\n\n\n\n<li>Clarke. A Dictionary of Practical Materia Medica<\/li>\n\n\n\n<li>Kent, J. T. Lectures on Materia Medica<\/li>\n<\/ul>\n\n\n\n<p><strong>FAQS<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is homoeopathic Azadirachta Indica safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Azadirachta Indica is safe when taken in the recommended dosage. However, it is essential to note that this is a general guideline, and the dosage may vary depending on the patient. Patients should always consult a qualified homeopathic practitioner at WeClinic to determine the appropriate dosage for their specific condition.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Azadirachta Indica used for?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica treats various ailments, including acne, diabetes, and malaria.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to give Azadirachta Indica to babies?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica should not be given to babies under two years of age.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How does Azadirachta Indica work?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica works by stimulating the body&#8217;s natural healing response. It is thought to work by increasing the production of white blood cells, which help to fight infection.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How long does Azadirachta Indica take to work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for Azadirachta Indica to work varies depending on the condition being treated. In general, taking It For at least six weeks before expecting to see results is recommended.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Azadirachta Indica be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Azadirachta Indica can be taken daily. However, it is important to note that this is a general guideline, and the dosage may vary depending on the patient. Patients should always consult a qualified homeopathic practitioner at WeClinic to determine the appropriate dosage for their specific condition.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Azadirachta Indica used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica treats various ailments, including acne, diabetes, and malaria.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is the use of Azadirachta Indica in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica is used in homeopathy to treat various ailments, including acne, diabetes, and malaria.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Azadirachta Indica used for?<\/h4><p class=\"saswp-faq-answer-text\">Azadirachta Indica used for treating Acne,  Diabetes, Malaria and Other ailments like Fever, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Rheumatism, Arthritis, Cancer<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How do you use Azadirachta Indica mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">The mother tincture of Azadirachta Indica is used to prepare homeopathic dilutions, which are utilized to treat various ailments. The mother tincture is also employed in aromatherapy and as a natural insect repellent.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Azadirachta Indica? Azadirachta Indica, commonly known as Neem or Nimba, is a large evergreen tree native to India and Burma. It has been widely used in traditional Indian medicine for centuries to treat various ailments. The medicinal constituents of Neem include azadirachtin, nimbidin, and quercetin. Combining these medicinal constituents makes Azadirachta Indica a valuable natural remedy with many therapeutic applications. Its traditional use in Indian medicine is supported by modern scientific research, highlighting its potential in treating various health conditions. Azadirachta Indica chemical constituents The primary chemical constituents of Neem are: Azadirachta Indica Preparation Steps which are needed <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-520","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Azadirachta Indica - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Azadirachta Indica uses for treating Acne, Diabetes, Malaria, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Arthritis, and Cancer.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Azadirachta Indica - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Azadirachta Indica uses for treating Acne, Diabetes, Malaria, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Arthritis, and Cancer.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-02-23T05:44:06+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-02-23T05:44:11+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Azadirachta Indica - Uses, Dosage, Side Effects, Composition And More","description":"Azadirachta Indica uses for treating Acne, Diabetes, Malaria, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Arthritis, and Cancer.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses","og_locale":"en_US","og_type":"article","og_title":"Azadirachta Indica - Uses, Dosage, Side Effects, Composition And More","og_description":"Azadirachta Indica uses for treating Acne, Diabetes, Malaria, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Arthritis, and Cancer.","og_url":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-02-23T05:44:06+00:00","article_modified_time":"2024-02-23T05:44:11+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Azadirachta Indica &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-02-23T05:44:06+00:00","dateModified":"2024-02-23T05:44:11+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses"},"wordCount":2075,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses","url":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses","name":"Azadirachta Indica - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-02-23T05:44:06+00:00","dateModified":"2024-02-23T05:44:11+00:00","description":"Azadirachta Indica uses for treating Acne, Diabetes, Malaria, Diarrhoea, Dysentery, Skin infections, Stomach ulcers, Arthritis, and Cancer.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/azadirachta-indica-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/azadirachta-indica-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Azadirachta Indica &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/520","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=520"}],"version-history":[{"count":11,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/520\/revisions"}],"predecessor-version":[{"id":3441,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/520\/revisions\/3441"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=520"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=520"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=520"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}