{"id":527,"date":"2024-02-26T06:10:05","date_gmt":"2024-02-26T06:10:05","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=527"},"modified":"2024-02-26T06:10:06","modified_gmt":"2024-02-26T06:10:06","slug":"bellis-perennis-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses","title":{"rendered":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Bellis Perennis?<\/h2>\n\n\n\n<p>Bellis perennis, commonly known as the common daisy, is a small, flowering plant belonging to the Asteraceae family. It is native to Europe and Asia but has naturalized in many other parts of the world. Bellis perennis has a long history of use in traditional medicine, and homeopaths have recognized its medicinal properties for centuries. The homeopathic mother tincture is prepared from the fresh, whole plant, including the flowers, leaves, and stems.<\/p>\n\n\n\n<p>The medicinal constituents of Bellis perennis include flavonoids, saponins, triterpenes, and essential oils. These compounds have been shown to possess anti-inflammatory, antioxidant, and antimicrobial properties.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Bellis Perennis Chemical Constituents<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Flavonoids:<\/strong> These compounds are found in many plants and have potent antioxidant and anti-inflammatory properties. They help to protect cells from damage and reduce inflammation throughout the body.<\/li>\n\n\n\n<li><strong>Saponins: <\/strong>These compounds are also found in many plants and have expectorant and anti-inflammatory properties. They help clear mucus from the lungs and airways, and they can also help reduce inflammation in the body.<\/li>\n\n\n\n<li><strong>Triterpenes: <\/strong>These compounds are found in many plants and have anti-inflammatory and antimicrobial properties. They help to reduce inflammation and fight infection.<\/li>\n\n\n\n<li><strong>Essential oils:<\/strong> These compounds in many plants have antiseptic and antimicrobial properties. They help to kill bacteria and other microorganisms, and they can also help to promote healing.<\/li>\n<\/ul>\n\n\n\n<p>In addition to these four main groups of compounds, Bellis perennis also contains other beneficial compounds, such as vitamins, minerals, and polysaccharides. These compounds work together to provide a wide range of health benefits.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Bellis Perennis Preparation<\/h2>\n\n\n\n<p>The homeopathic mother tincture of Bellis perennis is prepared according to the Homoeopathic Pharmacopoeia of the United States (HPUS). This process involves several steps:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Harvesting:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The fresh, whole Bellis perennis plant is harvested during its flowering season, typically in the spring or summer.<\/li>\n\n\n\n<li>The plant is harvested at its peak potency when it is full of medicinal properties.<\/li>\n\n\n\n<li>The plant&#8217;s flowers, leaves, and stems are all used to make the mother tincture.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Maceration:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The harvested plant material is macerated, which means it is soaked in a mixture of alcohol and water.<\/li>\n\n\n\n<li>This process helps extract the plant&#8217;s medicinal properties into the liquid.<\/li>\n\n\n\n<li>The mixture is left to macerate for a while, typically several weeks.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Potentization:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The resulting tincture is then potentized, a unique homeopathic process that involves diluting the tincture and shaking it vigorously multiple times.<\/li>\n\n\n\n<li>This process is believed to enhance the therapeutic properties of the tincture and make it more effective.<\/li>\n\n\n\n<li>The tincture is diluted and succussed multiple times, typically until it reaches a potency of 1X.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Dilution:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The potentized tincture is further diluted to create different potencies, such as 3X, 6X, and 12X.<\/li>\n\n\n\n<li>The potency of a homeopathic remedy refers to the number of times it has been diluted and succeeded.<\/li>\n\n\n\n<li>Higher potencies are more dilute than lower potencies.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Storage:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The mother tincture and its dilutions are stored in amber glass bottles to protect them from light and maintain their potency.<\/li>\n\n\n\n<li>The bottles are sealed tightly to prevent contamination.<\/li>\n\n\n\n<li>The tinctures are stored in a cool, dark place.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Bellis Perennis Mother Tincture<\/h2>\n\n\n\n<p>Bellis perennis mother tincture is a homeopathic remedy from the common daisy plant. It is traditionally used to treat various conditions, including bruises, sprains, and muscle pain. Bellis perennis is also said to have anti-inflammatory and antioxidant properties.<\/p>\n\n\n\n<p>The mother tincture is the original tincture prepared from fresh plant material. It is the most potent form of the remedy and is used to make further dilutions. The mother tincture is typically diluted to a potency of 1X, which means it has been cut one part tincture to nine parts diluent. Higher potencies, such as 3X, 6X, and 12X, are also available.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Bellis Perennis<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Anti-inflammatory:<\/strong> Bellis perennis has been shown to reduce inflammation in the body. It makes the Bellis perennis medicine helpful for treating conditions such as arthritis, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-gout-with-homeopathy\"   title=\"gout\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"415\">gout<\/a>, and bursitis.<\/li>\n\n\n\n<li><strong>Antioxidant:<\/strong> Bellis perennis contains antioxidants that help to protect cells from damage caused by free radicals. It may help to prevent chronic diseases such as cancer and heart disease.<\/li>\n\n\n\n<li><strong>Antimicrobial:<\/strong> Bellis perennis has been shown to have antimicrobial activity against various bacteria and fungi. It makes it helpful for treating infections such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-urine-infection-with-homeopathy\"   title=\"urinary tract infections\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"270\">urinary tract infections<\/a>, skin infections, and athlete&#8217;s foot.<\/li>\n\n\n\n<li><strong>Wound healing:<\/strong> Bellis perennis has been shown to promote wound healing. It is likely due to its anti-inflammatory and antimicrobial properties.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Bellis Perennis Treat?<\/h2>\n\n\n\n<p>Bellis Perennis is helpful for the treatment of various diseases:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Arthritis:<\/strong> Bellis perennis can help to relieve pain, stiffness, and inflammation in people with arthritis. It can also help to improve joint mobility and function.<\/li>\n\n\n\n<li><strong>Gout: <\/strong>Bellis perennis can help to reduce pain and swelling in people with gout. It can also help to prevent gout attacks from occurring.<\/li>\n\n\n\n<li><strong>Bursitis: <\/strong>Bellis perennis, which are fluid-filled sacs that cushion joints, can help reduce inflammation and pain in bursae. It can also help to prevent bursitis from developing.<\/li>\n\n\n\n<li><strong>Inflammation:<\/strong> Bellis perennis has anti-inflammatory properties that can help to reduce inflammation throughout the body. It can help treat a variety of conditions, including arthritis, gout, bursitis, and skin conditions.<\/li>\n\n\n\n<li><strong>Pain:<\/strong> Bellis perennis can help to relieve pain from a variety of sources, including injuries, headaches, and menstrual cramps. It reduces inflammation and blocks pain signals from being sent to the brain.<\/li>\n\n\n\n<li><strong>Bruises:<\/strong> Bellis perennis can help to heal bruises faster and reduce pain and swelling. It does this by promoting blood circulation to the bruised area and assisting the body to absorb the blood clot.<\/li>\n\n\n\n<li><strong>Sprains:<\/strong> Bellis perennis can help to reduce pain and swelling in sprains and promote healing. It works by reducing inflammation and helping to strengthen the ligaments that have been injured.<\/li>\n\n\n\n<li><strong>Muscle strains:<\/strong> Bellis perennis can help relieve pain and stiffness in muscle strains and promote healing. It does this by reducing inflammation and helping to relax the muscles.<\/li>\n\n\n\n<li><strong>Skin conditions:<\/strong> Bellis perennis can help to treat a variety of skin conditions, including eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"148\">psoriasis<\/a>, and acne. It works by reducing inflammation and helping to heal the skin.<\/li>\n\n\n\n<li><strong>Infections:<\/strong> Bellis perennis has antimicrobial properties that can help to fight infection. It can treat various diseases, including urinary tract infections, skin infections, and athlete&#8217;s foot.<\/li>\n\n\n\n<li><strong>Wounds: <\/strong>Bellis perennis can help to promote wound healing and reduce the risk of infection. It does this by reducing inflammation and helping to form new tissue.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Bellis Perennis Homeopathic Medicine Uses<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Oral administration:<\/strong>\n<ul class=\"wp-block-list\">\n<li><strong>Arthritis: <\/strong>Bellis perennis can be taken orally to help relieve pain, stiffness, and inflammation in people with arthritis. It can also help to improve joint mobility and function. <\/li>\n\n\n\n<li><strong>Gout: <\/strong>Bellis perennis can be taken orally to help reduce pain and swelling in people with gout. It can also help to prevent gout attacks from occurring. <\/li>\n\n\n\n<li><strong>Bursitis: <\/strong>Bellis perennis can be taken orally to help reduce inflammation and pain in bursae, which are fluid-filled sacs that cushion joints. It can also help to prevent bursitis from developing. <\/li>\n\n\n\n<li><strong>Inflammation:<\/strong> Bellis perennis can be taken orally to help reduce inflammation throughout the body. This can help treat a variety of conditions, including arthritis, gout, bursitis, and skin conditions. <\/li>\n\n\n\n<li><strong>Pain:<\/strong> Bellis perennis can be taken orally to help relieve pain from various sources, including injuries, headaches, and menstrual cramps. It reduces inflammation and blocks pain signals from being sent to the brain. <\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Local application:<\/strong>\n<ul class=\"wp-block-list\">\n<li><strong>Skin conditions:<\/strong> Bellis perennis can be applied topically to the skin to help treat various skin conditions, including <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1662\">eczema<\/a>, psoriasis, and acne. It works by reducing inflammation and helping to heal the skin. <\/li>\n\n\n\n<li><strong>Bruises:<\/strong> Bellis perennis can be applied topically to bruises to help speed healing and reduce pain and swelling. It does this by promoting blood circulation to the bruised area and assisting the body to absorb the blood clot. <\/li>\n\n\n\n<li><strong>Sprains:<\/strong> Bellis perennis can be applied topically to sprains to help reduce pain and swelling and promote healing. It works by reducing inflammation and helping to strengthen the ligaments that have been injured. <\/li>\n\n\n\n<li><strong>Muscle strains:<\/strong> Bellis perennis can be applied topically to muscle strains to help relieve pain and stiffness and promote healing. It does this by reducing inflammation and helping to relax the muscles. <\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<p>It is important to note that Bellis perennis should not be taken orally or applied topically if you are allergic to daisies or other members of the Asteraceae family.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Bellis Perennis Dosage<\/h2>\n\n\n\n<p>The general dosage of Bellis perennis mother tincture is 5-10 drops, taken 3 times daily. This dosage effectively treats various conditions, including arthritis, gout, bursitis, and skin conditions. However, in some cases, a higher or lower dosage may be necessary. For example, a higher dosage may be needed for acute conditions, while a lower dosage may be sufficient for chronic conditions. <\/p>\n\n\n\n<p>It is essential to consult a qualified homeopathic practitioner to determine the appropriate dosage for your needs. A qualified homeopathic practitioner can also help you determine if Bellis perennis mother tincture is right for you and can help you monitor your progress while taking the remedy. <\/p>\n\n\n\n<p>If you are considering using Bellis perennis mother tincture, please consult with your doctor or a qualified homeopathic practitioner. You can also contact <a href=\"https:\/\/weclinic.in\/\">WeClinic<\/a> to discuss the benefits and risks of using Bellis perennis mother tincture.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Bellis Perennis Dosage for Adults<\/h3>\n\n\n\n<p>The general dosage of Bellis perennis mother tincture for adults is 5-10 drops, taken 3 times daily. However, the specific dosage may vary depending on the condition being treated. It is essential to consult a qualified homeopathic practitioner to determine the appropriate dosage for your needs.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Bellis Perennis Dosage for Children<\/h3>\n\n\n\n<p>The general dosage of Bellis perennis mother tincture for children is 2-5 drops, taken 3 times daily. However, the specific dosage may vary depending on the condition being treated. It is essential to consult a qualified homeopathic practitioner to determine the appropriate dosage for your child&#8217;s needs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Bellis Perennis? \/ Side Effects and Risks of Using Bellis Perennis<\/h2>\n\n\n\n<p>Bellis perennis is generally considered to be safe for most people when taken in recommended doses. However, some people may experience side effects, especially if they take high doses or are sensitive to the plant.<\/p>\n\n\n\n<p>Common side effects of Bellis perennis include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"Nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1764\">Nausea<\/a>: <\/strong>Bellis perennis can cause nausea, which is a feeling of sickness and an urge to vomit.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vomiting-with-homeopathy\"   title=\"Vomiting\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2132\">Vomiting<\/a>: <\/strong>Bellis perennis can cause vomiting, which is the forceful expulsion of stomach contents through the mouth.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"Diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1356\">Diarrhea<\/a>: <\/strong>Bellis perennis can cause diarrhea and the frequent passage of loose or watery stools.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-skin-rashes-with-homeopathy\"   title=\"Skin rash\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"359\">Skin rash<\/a>:<\/strong> Bellis perennis can cause skin rash, a red, itchy, and irritated skin area.<\/li>\n\n\n\n<li>People who are allergic to daisies or other members of the Asteraceae family should avoid using Bellis perennis, as it may cause an allergic reaction.<\/li>\n<\/ul>\n\n\n\n<p>It is important to note that Bellis perennis can interact with certain medications, such as blood thinners and sedatives. Therefore, you must talk to your doctor before taking Bellis perennis if you are taking any medications.<\/p>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>Boericke, Materia Medica with Repertory.<br>Clarke, A Dictionary of Practical Materia Medica. London.<br>Kent Lectures on Homoeopathic Materia Medica.<br>The Homoeopathic Pharmacopoeia of the United States (HPUS).<br>British Homoeopathic Pharmacopoeia.<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is homeopathic Bellis Perennis safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Bellis perennis are generally safe for most people. However, some people may experience side effects such as nausea, vomiting, diarrhea, or skin rash. People who are allergic to daisies or other members of the Asteraceae family should avoid using Bellis perennis.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Bellis Perennis used for?<\/h4><p class=\"saswp-faq-answer-text\">Bellis perennis is used to treat a variety of conditions, including arthritis, gout, bursitis, inflammation, pain, bruises, sprains, muscle strains, skin conditions, infections, and wounds.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to give Bellis Perennis to babies?<\/h4><p class=\"saswp-faq-answer-text\">The general dosage of Bellis perennis mother tincture for children is 2-5 drops, taken 3 times daily. However, the specific dosage may vary depending on the condition being treated. It is essential to consult with a qualified homeopathic practitioner to determine the appropriate dosage for your child&#8217;s individual needs.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How does Bellis Perennis work?<\/h4><p class=\"saswp-faq-answer-text\">Bellis perennis is believed to work by stimulating the body&#8217;s natural healing processes. It is thought to have anti-inflammatory, antioxidant, and antimicrobial properties.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How long does Bellis Perennis take to work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for Bellis perennis to work varies depending on the condition being treated and the individual patient. Some people may experience relief within a few days, while others may take several weeks or months to see results.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Bellis Perennis be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Bellis perennis can be taken daily. However, it is essential to consult with a qualified homeopathic practitioner to determine the appropriate dosage and duration of treatment.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Bellis Perennis used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Bellis perennis is used to treat a variety of conditions, including arthritis, gout, bursitis, inflammation, pain, bruises, sprains, muscle strains, skin conditions, infections, and wounds.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is the use of Bellis Perennis in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">Bellis perennis is used in homeopathy to treat a variety of conditions, including arthritis, gout, bursitis, inflammation, pain, bruises, sprains, muscle strains, skin conditions, infections, and wounds.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Bellis Perennis used for?<\/h4><p class=\"saswp-faq-answer-text\">Bellis perennis is used to treat a variety of conditions, including arthritis, gout, bursitis, inflammation, pain, bruises, sprains, muscle strains, skin conditions, infections, and wounds.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How do you use Bellis Perennis&#8217;s mother&#8217;s tincture?<\/h4><p class=\"saswp-faq-answer-text\">The general dosage of Bellis perennis mother tincture is 5-10 drops, taken 3 times daily. However, the specific dosage may vary depending on the condition being treated. It is essential to consult a qualified homeopathic practitioner to determine the appropriate dosage for your needs.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Bellis Perennis? Bellis perennis, commonly known as the common daisy, is a small, flowering plant belonging to the Asteraceae family. It is native to Europe and Asia but has naturalized in many other parts of the world. Bellis perennis has a long history of use in traditional medicine, and homeopaths have recognized its medicinal properties for centuries. The homeopathic mother tincture is prepared from the fresh, whole plant, including the flowers, leaves, and stems. The medicinal constituents of Bellis perennis include flavonoids, saponins, triterpenes, and essential oils. These compounds have been shown to possess anti-inflammatory, antioxidant, and antimicrobial <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-527","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More<\/title>\n<meta name=\"description\" content=\"Bellis perennis homeopathic uses to treat arthritis, gout, bursitis, inflammation, pain, bruises, sprains etc.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/bellis-perennis-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More\" \/>\n<meta property=\"og:description\" content=\"Bellis perennis homeopathic uses to treat arthritis, gout, bursitis, inflammation, pain, bruises, sprains etc.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/bellis-perennis-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-02-26T06:10:05+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-02-26T06:10:06+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More","description":"Bellis perennis homeopathic uses to treat arthritis, gout, bursitis, inflammation, pain, bruises, sprains etc.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses","og_locale":"en_US","og_type":"article","og_title":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More","og_description":"Bellis perennis homeopathic uses to treat arthritis, gout, bursitis, inflammation, pain, bruises, sprains etc.","og_url":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-02-26T06:10:05+00:00","article_modified_time":"2024-02-26T06:10:06+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More","datePublished":"2024-02-26T06:10:05+00:00","dateModified":"2024-02-26T06:10:06+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses"},"wordCount":1840,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses","url":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses","name":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-02-26T06:10:05+00:00","dateModified":"2024-02-26T06:10:06+00:00","description":"Bellis perennis homeopathic uses to treat arthritis, gout, bursitis, inflammation, pain, bruises, sprains etc.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/bellis-perennis-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/bellis-perennis-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Bellis Perennis: Uses, Dosage, Side Effects, Composition, and More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/527","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=527"}],"version-history":[{"count":9,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/527\/revisions"}],"predecessor-version":[{"id":3265,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/527\/revisions\/3265"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=527"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=527"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=527"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}