{"id":565,"date":"2024-03-01T04:12:51","date_gmt":"2024-03-01T04:12:51","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=565"},"modified":"2024-03-01T04:13:59","modified_gmt":"2024-03-01T04:13:59","slug":"justicia-adhatoda-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses","title":{"rendered":"Justicia Adhatoda &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Justicia Adhatoda?<\/h2>\n\n\n\n<p>Justicia Adhatoda, also known as Malabar Nut or Vasaka, is a flowering plant belonging to the Acanthaceae family. It is native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. The plant has been traditionally used in Ayurvedic and Unani medicine for centuries. It is now gaining popularity in modern medicine due to its wide range of therapeutic properties. <\/p>\n\n\n\n<p>Justicia Adhatoda is a shrub or small tree growing up to 3 meters tall. It has ovate leaves with serrated edges and produces small, white flowers. The plant is known for its bitter taste and pungent odor, which are attributed to the presence of various alkaloids and glycosides. These compounds are responsible for the plant&#8217;s medicinal properties, including its anti-inflammatory, antimicrobial, and expectorant effects.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Justicia Adhatoda Chemical Constituents<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Vasicine:<\/strong> A major alkaloid found in Justicia Adhatoda, vasicine is responsible for the plant&#8217;s anti-inflammatory, antibacterial, and antiviral properties.<\/li>\n\n\n\n<li><strong>Vasicinone: <\/strong>Another alkaloid present in the plant, vasicinone exhibits bronchodilatory and antitussive effects, helping to relieve respiratory ailments.<\/li>\n\n\n\n<li><strong>Adhatodic Acid:<\/strong> A triterpenoid compound, adhatodic acid possesses anti-inflammatory and antioxidant properties.<\/li>\n\n\n\n<li><strong>Glycosides:<\/strong> Justicia Adhatoda contains various glycosides, including vasicinol, adhatodoides, and adhatodoides B. These compounds contribute to the plant&#8217;s expectorant and antitussive effects.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Justicia Adhatoda Homoeopathic Medicine Preparation<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Collection:<\/strong> Fresh Justicia Adhatoda leaves and flowers are collected from organically grown plants.<\/li>\n\n\n\n<li>Preparation: The leaves and flowers are cleaned and dried, then cut into small pieces.<\/li>\n\n\n\n<li><strong>Tincture Creation:<\/strong> The plant material is soaked in alcohol and water for some time. This process extracts the active compounds from the plant into the liquid.<\/li>\n\n\n\n<li><strong>Dilution:<\/strong> The tincture is diluted in a series of steps, each using a specific tincture ratio to water or alcohol. This dilution process is what makes homeopathic medicine.<\/li>\n\n\n\n<li><strong>Potentization: <\/strong>Each dilution step is accompanied by vigorous shaking or succussion. This process is believed to enhance the therapeutic properties of the medicine.<\/li>\n<\/ul>\n\n\n\n<p><strong>Justicia Adhatoda can be prepared in various forms for medicinal use:<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Decoction:<\/strong> To make a decoction, boil 1-2 teaspoons of dried Justicia Adhatoda leaves in 1 cup of water for 10-15 minutes. Strain the decoction and drink it twice daily.<\/li>\n\n\n\n<li><strong>Infusion:<\/strong> Steep 1-2 teaspoons of dried Justicia Adhatoda leaves in a cup of hot water for 10-15 minutes. Strain the infusion and drink it twice daily.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> Prepare a tincture by soaking 1 part of dried Justicia Adhatoda leaves in 5 parts of alcohol (such as vodka or brandy) for 2-4 weeks. Strain the tincture and take 1-2 teaspoons twice daily.<\/li>\n\n\n\n<li><strong>Capsules or Tablets:<\/strong> Justicia Adhatoda is also available in capsule or tablet form and typically contains standardized plant extracts. Follow the dosage instructions on the product label.<\/li>\n<\/ul>\n\n\n\n<p><strong>Justicia Adhatoda Mother Tincture<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Justicia Adhatoda mother tincture is a potent fresh plant extract made by soaking it in alcohol and water. This concentrated extract retains the plant&#8217;s full spectrum of therapeutic compounds. It is diluted with water or alcohol to create a homeopathic remedy.<\/li>\n\n\n\n<li>Dilute a few drops of the mother tincture in water or juice.<\/li>\n\n\n\n<li>Take the diluted solution as directed by your healthcare practitioner.<\/li>\n\n\n\n<li>Follow the recommended dosage and frequency for best results.<\/li>\n\n\n\n<li>The mother tincture of Justicia Adhatoda is used to treat a wide range of ailments, including respiratory problems, digestive disorders, and skin conditions. It is also believed to have anti-inflammatory, antioxidant, and immune-boosting properties.<\/li>\n<\/ul>\n\n\n\n<p><strong>Benefits of Justicia Adhatoda<\/strong><\/p>\n\n\n\n<p>Justicia Adhatoda offers numerous health benefits due to its various bioactive compounds:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Respiratory Support:<\/strong> The plant&#8217;s expectorant and bronchodilatory properties help relieve coughs, bronchitis, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-asthma-with-homeopathy\"   title=\"asthma\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"851\">asthma<\/a>. It helps loosen mucus and soothe irritated airways.<\/li>\n\n\n\n<li><strong>Anti-inflammatory:<\/strong> Justicia Adhatoda&#8217;s anti-inflammatory compounds can help reduce inflammation, relieving arthritis, rheumatism, and inflammatory bowel disease.<\/li>\n\n\n\n<li><strong>Antimicrobial:<\/strong> The plant&#8217;s antimicrobial properties help fight against bacterial and viral infections. It can treat sore throats, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-urine-infection-with-homeopathy\"   title=\"urinary tract infections\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"274\">urinary tract infections<\/a>, and skin infections.<\/li>\n\n\n\n<li><strong>Digestive Aid: <\/strong>Justicia Adhatoda can help improve digestion and relieve stomach ailments. It can help reduce gas, bloating, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-constipation-with-homeopathy\"   title=\"constipation\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"944\">constipation<\/a>.<\/li>\n\n\n\n<li><strong>Skin Care:<\/strong> The plant&#8217;s anti-inflammatory and antimicrobial properties make it beneficial for treating skin conditions like eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"157\">psoriasis<\/a>, and acne.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Justicia Adhatoda Treat?<\/h2>\n\n\n\n<p>Justicia Adhatoda is a versatile herbal remedy used for centuries to treat many ailments. It is particularly effective for respiratory conditions, digestive problems, skin issues, infections, and other health concerns.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Respiratory Conditions:\n<ul class=\"wp-block-list\">\n<li><strong>Coughs:<\/strong> Justicia Adhatoda&#8217;s expectorant and anti-inflammatory properties help to soothe coughs and clear mucus from the airways.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-bronchitis-with-homeopathy\"   title=\"Bronchitis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2044\">Bronchitis<\/a>:<\/strong> The herb&#8217;s anti-inflammatory and antimicrobial effects help to reduce inflammation and fight infection in the bronchial tubes.<\/li>\n\n\n\n<li><strong>Asthma:<\/strong> Justicia Adhatoda can help relax the airways and reduce inflammation, making breathing more accessible for people with asthma.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-sore-throat-with-homeopathy\"   title=\"Sore throat\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2306\">Sore throat<\/a>:<\/strong> The herb&#8217;s soothing and anti-inflammatory properties help to relieve sore throats and reduce pain.<\/li>\n\n\n\n<li><strong>Laryngitis:<\/strong> Justicia Adhatoda&#8217;s anti-inflammatory and antimicrobial effects help to reduce inflammation and fight infection in the larynx.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-pneumonia-with-homeopathy\"   title=\"Pneumonia\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2104\">Pneumonia<\/a>:<\/strong> The herb&#8217;s expectorant and antimicrobial properties help to clear mucus from the lungs and fight infection.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Digestive Conditions:\n<ul class=\"wp-block-list\">\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-indigestion-with-homeopathy\"   title=\"Indigestion\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1543\">Indigestion<\/a>:<\/strong> Justicia Adhatoda&#8217;s carminative and anti-inflammatory properties help to relieve indigestion and gas.<\/li>\n\n\n\n<li><strong>Gas and bloating:<\/strong> The herb&#8217;s carminative properties help to reduce gas and bloating.<\/li>\n\n\n\n<li><strong>Constipation:<\/strong> Justicia Adhatoda&#8217;s laxative properties help to relieve constipation and promote regularity.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"Diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1360\">Diarrhea<\/a>:<\/strong> The herb&#8217;s astringent and anti-inflammatory properties help to reduce diarrhea and soothe the digestive tract.<\/li>\n\n\n\n<li><strong>Dysentery: <\/strong>Justicia Adhatoda&#8217;s antimicrobial and anti-inflammatory properties help to fight infection and reduce inflammation in the intestines.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"Eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1669\">Eczema<\/a>: <\/strong>Justicia Adhatoda&#8217;s anti-inflammatory and antimicrobial properties help to reduce inflammation and fight infection in the skin.<\/li>\n\n\n\n<li><strong>Psoriasis:<\/strong> The herb&#8217;s anti-inflammatory and antiproliferative properties help to reduce inflammation and slow the growth of skin cells.<\/li>\n\n\n\n<li><strong>Acne:<\/strong> Justicia Adhatoda&#8217;s antimicrobial and anti-inflammatory properties help to fight infection and reduce inflammation in the skin.<\/li>\n\n\n\n<li><strong>Boils: <\/strong>The herb&#8217;s antimicrobial and anti-inflammatory properties help to fight infection and reduce inflammation in boils.<\/li>\n\n\n\n<li><strong>Wounds:<\/strong> Justicia Adhatoda&#8217;s antimicrobial and wound-healing properties help to fight infection and promote healing.<\/li>\n\n\n\n<li><strong>Bacterial and viral infections:<\/strong> The herb&#8217;s antimicrobial properties help to fight a wide range of bacterial and viral infections.<\/li>\n\n\n\n<li><strong>Urinary tract infections:<\/strong> Justicia Adhatoda&#8217;s antimicrobial and anti-inflammatory properties help to fight disease and reduce inflammation in the urinary tract.<\/li>\n\n\n\n<li><strong>Arthritis:<\/strong> The herb&#8217;s anti-inflammatory and analgesic properties help reduce inflammation and joint pain.<\/li>\n\n\n\n<li><strong>Rheumatism: <\/strong>Justicia Adhatoda&#8217;s anti-inflammatory and analgesic properties help to reduce inflammation and pain in the muscles and joints.<\/li>\n\n\n\n<li><strong>Inflammatory bowel disease:<\/strong> The herb&#8217;s anti-inflammatory and antimicrobial properties help to reduce inflammation and fight infection in the digestive tract.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"Diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"48\">Diabetes<\/a>:<\/strong> Justicia Adhatoda&#8217;s hypoglycemic properties help to lower blood sugar levels.<\/li>\n\n\n\n<li><strong>Malaria:<\/strong> The herb&#8217;s antimalarial properties help to fight malaria infection.<\/li>\n\n\n\n<li><strong>Snakebites:<\/strong> Justicia Adhatoda&#8217;s antivenom properties help to neutralize snake venom and reduce its effects.<\/li>\n\n\n\n<li><strong>Scorpion stings: <\/strong>The herb&#8217;s antivenom properties help to neutralize scorpion venom and reduce its impact.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Justicia Adhatoda Homeopathic Uses<\/h2>\n\n\n\n<p>Justicia Adhatoda can be used in various forms for different purposes:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Respiratory Support:<\/strong> Take a decoction or infusion of Justicia Adhatoda leaves to relieve coughs, bronchitis, and asthma. You can also use a tincture or capsule form of the plant.<\/li>\n\n\n\n<li><strong>Digestive Aid: <\/strong>Take a decoction or infusion of Justicia Adhatoda leaves to improve digestion and relieve stomach ailments. You can also use a tincture or capsule form of the plant.<\/li>\n\n\n\n<li><strong>Skin Care:<\/strong> Apply a paste made from Justicia Adhatoda leaves to affected skin areas to treat eczema, psoriasis, and acne. You can also use the plant&#8217;s tincture or capsule form internally to support skin health.<\/li>\n\n\n\n<li><strong>Infections:<\/strong> To fight against bacterial and viral infections, take a decoction or infusion of Justicia Adhatoda leaves. You can also use a tincture or capsule form of the plant.<\/li>\n\n\n\n<li><strong>Inflammatory Conditions:<\/strong> To reduce inflammation and relieve pain in conditions like arthritis and rheumatism, take a decoction or infusion of Justicia Adhatoda leaves. You can also use a tincture or capsule form of the plant.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Justicia Adhatoda Dosage<\/h2>\n\n\n\n<p>The dosage of Justicia Adhatoda varies depending on the treated condition and the plant&#8217;s form. Following the dosage instructions on the product label or consulting with a healthcare professional for personalized guidance is essential.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Decoction or Infusion: <\/strong>Typically, 1-2 teaspoons of dried Justicia Adhatoda leaves are used to prepare a decoction or infusion. This can be taken twice daily.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> The usual dosage for a tincture is 1-2 teaspoons twice daily.<\/li>\n\n\n\n<li><strong>Capsules or Tablets:<\/strong> Follow the dosage instructions on the product label.<\/li>\n\n\n\n<li><strong>Mother Tincture:<\/strong> The mother tincture is typically diluted with water before use. The dosage depends on the specific condition being treated and should be determined by a qualified homeopathic practitioner.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Justicia Adhatoda Dosage for Adults<\/h3>\n\n\n\n<p>For adults, the typical dosage of Justicia Adhatoda is:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Decoction or Infusion: <\/strong>1-2 teaspoons of dried leaves, steeped in 1 cup of hot water for 10-15 minutes. Drink twice daily.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> 1-2 teaspoons twice daily.<\/li>\n\n\n\n<li><strong>Capsules or Tablets:<\/strong> Follow the dosage instructions on the product label.<\/li>\n<\/ul>\n\n\n\n<p>It is important to note that the dosage may vary depending on the condition being treated and the individual&#8217;s health status. Always consult with a healthcare professional before using Justicia Adhatoda, especially if you have any underlying health conditions or are taking other medications.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Justicia Adhatoda Dosage for Children<\/h3>\n\n\n\n<p>A qualified healthcare professional should determine the dosage of Justicia Adhatoda for children. The dosage may vary depending on the child&#8217;s age, weight, and the condition being treated. <\/p>\n\n\n\n<p>Generally, children may be given a lower dosage than adults. For example, a child may be given 1\/2 to 1 teaspoon of a decoction or infusion twice daily or a smaller tincture or capsule form dose.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Justicia Adhatoda?<\/h2>\n\n\n\n<p>Justicia Adhatoda is generally considered safe for most people. However, specific individuals should avoid using the plant or use it with caution:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant and Nursing Women:<\/strong> Justicia Adhatoda&#8217;s safety during pregnancy and breastfeeding has not been established. Therefore, it is best to avoid using the plant during these periods.<\/li>\n\n\n\n<li><strong>Children Under 2 Years Old:<\/strong> Justicia Adhatoda is not recommended for children under 2 years old.<\/li>\n\n\n\n<li><strong>People with Liver or Kidney Problems:<\/strong> Individuals with liver or kidney problems should use Justicia Adhatoda with caution, as the plant may affect the metabolism and excretion of the drug.<\/li>\n\n\n\n<li><strong>People Taking Certain Medications: <\/strong>Justicia Adhatoda may interact with certain medications, such as blood thinners, sedatives, and anticonvulsants. Therefore, you must consult a <a href=\"https:\/\/weclinic.in\/\">healthcare professional<\/a> before using the plant if you take any medications.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What are the Side Effects and Risks of Using Justicia Adhatoda?<\/h2>\n\n\n\n<p>Side Effects: Justicia Adhatoda is generally well-tolerated. However, some people may experience mild side effects, such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1774\">nausea<\/a>, vomiting, diarrhea, and headache. These side effects are usually mild and go away after a few days. If you experience any severe side effects, stop using the plant and consult with a healthcare professional immediately.<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is homeopathic Justicia Adhatoda safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Justicia Adhatoda is generally considered safe for most people when used in recommended dosages. However, it is essential to note that the safety of Justicia Adhatoda during pregnancy and breastfeeding has not been established, so it is best to avoid using the plant during these periods. Additionally, children under 2 years old and individuals with liver or kidney problems should use Justicia Adhatoda with caution.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Justicia Adhatoda used for?<\/h4><p class=\"saswp-faq-answer-text\">Justicia Adhatoda is used to treat a wide range of ailments, including respiratory conditions, digestive problems, skin conditions, infections, and inflammatory conditions. It is commonly used to relieve coughs, bronchitis, asthma, indigestion, gas, bloating, constipation, eczema, psoriasis, acne, and arthritis.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to give Justicia Adhatoda to babies?<\/h4><p class=\"saswp-faq-answer-text\">Justicia Adhatoda is not recommended for children under 2 years old. Suppose you are considering giving Justicia Adhatoda to a child. In that case, it is essential to consult with a qualified healthcare professional to determine the appropriate dosage and safety precautions.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How does Justicia Adhatoda work?<\/h4><p class=\"saswp-faq-answer-text\">Justicia Adhatoda contains various bioactive compounds, including vasicine, vasicinone, adhatodic acid, and glycosides. These compounds exert various pharmacological effects, including anti-inflammatory, antimicrobial, expectorant, antitussive, and digestive-stimulating effects.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How long does Justicia Adhatoda take to work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for Justicia Adhatoda to work can vary depending on the treated condition and the individual&#8217;s response to the plant. Relief may be experienced within a few days for acute conditions like coughs or indigestion. For chronic conditions like asthma or arthritis, it may take several weeks or months of regular use to see significant improvement.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Justicia Adhatoda be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Justicia Adhatoda can be taken daily at the recommended dosage. However, following the dosage instructions on the product label or consulting with a healthcare professional to determine the appropriate dosage for your specific condition is essential.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Justicia Adhatoda used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Justicia Adhatoda is used to treat a wide range of ailments, including respiratory conditions, digestive problems, skin conditions, infections, and inflammatory conditions. It is commonly used to relieve coughs, bronchitis, asthma, indigestion, gas, bloating, constipation, eczema, psoriasis, acne, and arthritis.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Justicia Adhatoda good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Justicia Adhatoda may benefit from acid reflux due to its anti-inflammatory and digestive-stimulating properties. It can help reduce inflammation in the digestive tract and improve digestion, which may help alleviate symptoms of acid reflux. However, it is essential to note that Justicia Adhatoda should not be used as a substitute for prescribed medications for acid reflux.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Justicia Adhatoda safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Justicia Adhatoda&#8217;s safety during pregnancy has not been established. Therefore, it is best to avoid using the plant during pregnancy. If you are pregnant or planning to become pregnant, you should consult with your healthcare provider before using Justicia Adhatoda.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Justicia Adhatoda? Justicia Adhatoda, also known as Malabar Nut or Vasaka, is a flowering plant belonging to the Acanthaceae family. It is native to tropical and subtropical regions of Asia, including India, China, and Southeast Asia. The plant has been traditionally used in Ayurvedic and Unani medicine for centuries. It is now gaining popularity in modern medicine due to its wide range of therapeutic properties. Justicia Adhatoda is a shrub or small tree growing up to 3 meters tall. It has ovate leaves with serrated edges and produces small, white flowers. The plant is known for its bitter <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-565","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Justicia Adhatoda - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Justicia Adhatoda Homeopathic Uses to relieve coughs, bronchitis, asthma, indigestion, constipation, eczema, psoriasis, acne, and arthritis.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Justicia Adhatoda - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Justicia Adhatoda Homeopathic Uses to relieve coughs, bronchitis, asthma, indigestion, constipation, eczema, psoriasis, acne, and arthritis.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-03-01T04:12:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-03-01T04:13:59+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Justicia Adhatoda - Uses, Dosage, Side Effects, Composition And More","description":"Justicia Adhatoda Homeopathic Uses to relieve coughs, bronchitis, asthma, indigestion, constipation, eczema, psoriasis, acne, and arthritis.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses","og_locale":"en_US","og_type":"article","og_title":"Justicia Adhatoda - Uses, Dosage, Side Effects, Composition And More","og_description":"Justicia Adhatoda Homeopathic Uses to relieve coughs, bronchitis, asthma, indigestion, constipation, eczema, psoriasis, acne, and arthritis.","og_url":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-03-01T04:12:51+00:00","article_modified_time":"2024-03-01T04:13:59+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Justicia Adhatoda &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-03-01T04:12:51+00:00","dateModified":"2024-03-01T04:13:59+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses"},"wordCount":1758,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses","url":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses","name":"Justicia Adhatoda - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-03-01T04:12:51+00:00","dateModified":"2024-03-01T04:13:59+00:00","description":"Justicia Adhatoda Homeopathic Uses to relieve coughs, bronchitis, asthma, indigestion, constipation, eczema, psoriasis, acne, and arthritis.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/justicia-adhatoda-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Justicia Adhatoda &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/565","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=565"}],"version-history":[{"count":14,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/565\/revisions"}],"predecessor-version":[{"id":3394,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/565\/revisions\/3394"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=565"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=565"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=565"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}