{"id":588,"date":"2024-04-06T11:35:22","date_gmt":"2024-04-06T11:35:22","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=588"},"modified":"2024-04-06T11:35:22","modified_gmt":"2024-04-06T11:35:22","slug":"ocimum-sanctum-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses","title":{"rendered":"Ocimum Sanctum &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Ocimum Sanctum?<\/h2>\n\n\n\n<p>Ocimum Sanctum, commonly known as Holy Basil, is an aromatic herb native to India. It holds a sacred place in Homoeopathic medicine and is widely used for its therapeutic properties. This versatile plant has been traditionally employed to treat various ailments, including stress, anxiety, inflammation, and digestive issues.<\/p>\n\n\n\n<p>Ocimum Sanctum is characterized by its distinct clove-like scent and purple-tinged leaves. It is a rich source of essential oils, flavonoids, and other bioactive compounds that contribute to its medicinal value. Holy Basil is a versatile and powerful herb that has been used in traditional medicine for centuries. Its medicinal properties make it an excellent addition to any herbal remedy, and its ease of cultivation makes it a great option for anyone interested in growing their own medicine.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ocimum Sanctum Chemical Constituents<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Eugenol:<\/strong> This aromatic compound is responsible for the characteristic scent of Ocimum Sanctum. It possesses antioxidant, anti-inflammatory, and antimicrobial properties.<\/li>\n\n\n\n<li><strong>Linalool:<\/strong> This terpene alcohol contributes to the calming and soothing effects of Ocimum Sanctum. It is also known for its anti-anxiety and sleep-promoting properties.<\/li>\n\n\n\n<li><strong>Camphor:<\/strong> This compound is known for its stimulating and expectorant effects. It aids in clearing congestion and improving respiratory function.<\/li>\n\n\n\n<li><strong>Thymol:<\/strong> This phenolic compound exhibits strong antiseptic and antifungal properties. It is effective in combating infections and promoting wound healing.<\/li>\n\n\n\n<li><strong>Rosmarinic acid:<\/strong> This antioxidant compound protects against cellular damage and inflammation. It also supports liver health and reduces the risk of chronic diseases.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ocimum Sanctum Preparation<\/h2>\n\n\n\n<p>Ocimum Sanctum, commonly known as Holy Basil, is a revered herb in Ayurvedic medicine renowned for its remarkable healing properties. In homeopathy, It is primarily used as a mother tincture, a concentrated extract that captures the therapeutic essence of the whole plant. Let&#8217;s delve deeper into the preparation of this potent remedy.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Raw Material Selection:<\/strong> The first step involves carefully selecting fresh or dried leaves of Ocimum Sanctum from reputable sources. The quality of the raw material directly influences the potency of the final product.<\/li>\n\n\n\n<li><strong>Maceration:<\/strong> The selected leaves are then subjected to maceration. This process involves soaking them in a mixture of alcohol and water for an extended period. This allows the therapeutic compounds from the plant to leach into the solvent.<\/li>\n\n\n\n<li><strong>Extraction: <\/strong>After maceration, the mixture is filtered to separate the liquid extract from the plant material. The resulting solution contains the concentrated essence of Ocimum Sanctum, capturing its medicinal properties.<\/li>\n\n\n\n<li><strong>Dilution and Potentiation:<\/strong> The mother tincture is further diluted with alcohol and water, following specific homeopathic principles. This process, known as potentization, enhances the potency and therapeutic range of the remedy.<\/li>\n\n\n\n<li><strong>Storage and Shelf Life:<\/strong> Store the Ocimum Sanctum mother tincture in a cool, dark place away from direct sunlight and heat sources. When stored properly, the remedy can retain its potency for an extended period.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ocimum Sanctum Mother Tincture<\/h2>\n\n\n\n<p>The dosage and frequency of Ocimum Sanctum mother tincture vary depending on the individual&#8217;s health condition and the severity of their symptoms. It is crucial to consult a qualified homeopathic practitioner for personalized guidance.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stress and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1203\">anxiety<\/a>:<\/strong> Ocimum Sanctum is a natural calming agent that helps reduce stress, promote relaxation, and improve sleep quality.<\/li>\n\n\n\n<li><strong>Digestive issues:<\/strong> It alleviates digestive discomfort, reduces inflammation, and supports healthy digestion.<\/li>\n\n\n\n<li><strong>Respiratory problems:<\/strong> It clears congestion, reduces inflammation in the airways, and eases breathing difficulties.<\/li>\n\n\n\n<li><strong>Skin conditions:<\/strong> Its antiseptic and anti-inflammatory properties make it effective in treating acne, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1672\">eczema<\/a>, and other skin irritations.<\/li>\n\n\n\n<li><strong>Inflammatory conditions:<\/strong> Ocimum Sanctum&#8217;s anti-inflammatory properties help reduce inflammation throughout the body, providing relief from conditions like arthritis and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-gout-with-homeopathy\"   title=\"gout\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"420\">gout<\/a>.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Ocimum Sanctum<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Antioxidant Protection:<\/strong> Ocimum Sanctum is a potent antioxidant that protects cells from damage caused by free radicals. Free radicals are unstable molecules that can cause cellular damage, leading to numerous health problems such as cancer, heart disease, and neurodegenerative diseases. By consuming Ocimum Sanctum, individuals can help protect their cells from oxidative stress and promote overall health and well-being.<\/li>\n\n\n\n<li><strong>Anti-inflammatory Properties:<\/strong> Ocimum Sanctum effectively reduces inflammation throughout the body, alleviating pain and discomfort. Chronic inflammation has been linked to numerous health problems, including arthritis, heart disease, and cancer. By consuming Ocimum Sanctum regularly, individuals can help reduce inflammation and promote overall health and well-being.<\/li>\n\n\n\n<li><strong>Antimicrobial Effects: <\/strong>Ocimum Sanctum has antiseptic and antifungal properties that help combat infections and promote wound healing. Infections are a common health problem, and Ocimum Sanctum&#8217;s antimicrobial effects can help fight off harmful bacteria and fungi. By consuming Ocimum Sanctum regularly, individuals can help reduce the risk of infections and promote overall health and well-being.<\/li>\n\n\n\n<li><strong>Adaptogenic Qualities:<\/strong> Ocimum Sanctum helps the body adapt to stress and maintain homeostasis. In today&#8217;s fast-paced world, stress is becoming increasingly common. By consuming Ocimum Sanctum regularly, individuals can help the body adapt to stress and maintain a healthy balance of hormones and neurotransmitters.<\/li>\n\n\n\n<li><strong>Neuroprotective Benefits:<\/strong> Ocimum Sanctum protects brain cells from damage and improves cognitive function. As people age, the brain is more susceptible to damage from toxins and oxidative stress. By consuming Ocimum Sanctum regularly, individuals can help protect their brain cells from damage and promote optimal cognitive function.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Ocimum Sanctum Treat?<\/h2>\n\n\n\n<p>Ocimum Sanctum has been used for centuries in traditional and alternative medicine to alleviate a diverse range of health conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stress and Anxiety Disorders:<\/strong> Ocimum Sanctum possesses calming and anxiolytic effects, helping to soothe the mind, reduce stress levels, and promote relaxation. It can be beneficial for individuals experiencing anxiety, nervousness, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-insomnia-with-homeopathy\"   title=\"insomnia\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"19\">insomnia<\/a>.<\/li>\n\n\n\n<li><strong>Digestive Disorders:<\/strong> Ocimum Sanctum improves digestion, relieving <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-indigestion-with-homeopathy\"   title=\"indigestion\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1545\">indigestion<\/a>, gas, and other gastrointestinal complaints. It stimulates the production of digestive enzymes and supports healthy gut function.<\/li>\n\n\n\n<li><strong>Respiratory Infections:<\/strong> Ocimum Sanctum effectively clears congestion, reduces inflammation, and eases breathing. It is commonly used to treat colds, coughs, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-bronchitis-with-homeopathy\"   title=\"bronchitis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2047\">bronchitis<\/a>, and other respiratory ailments.<\/li>\n\n\n\n<li><strong>Skin Conditions:<\/strong> Ocimum Sanctum has antibacterial and anti-inflammatory properties that make it effective in treating acne, eczema, and other skin irritations. It helps reduce inflammation, soothe itching, and promote skin healing.<\/li>\n\n\n\n<li><strong>Inflammatory Conditions:<\/strong> Ocimum Sanctum exhibits anti-inflammatory properties that can alleviate pain and discomfort associated with arthritis, gout, and other inflammatory conditions. It helps reduce swelling, improve joint mobility, and relieve inflammation-related pain.<\/li>\n\n\n\n<li><strong>Other Conditions:<\/strong> Ocimum Sanctum has also been found beneficial in treating headaches, migraines, menstrual cramps, and immune system disorders. It supports overall health and well-being by boosting immunity and protecting against infections.<\/li>\n\n\n\n<li><strong>Menstrual Irregularities:<\/strong> Ocimum Sanctum has been used to regulate menstrual cycles and alleviate menstrual cramps. It helps balance hormones and reduce inflammation in the reproductive organs.<\/li>\n\n\n\n<li><strong>Mental Health:<\/strong> Ocimum Sanctum has been found to improve mood and alleviate depression-like symptoms in some studies. It may help regulate neurotransmitters, such as serotonin and dopamine, which play a role in mood regulation.<\/li>\n\n\n\n<li><strong>Liver Support: <\/strong>Ocimum Sanctum has been used to support liver function and detoxify the liver. Its antioxidant properties can protect liver cells from damage caused by free radicals.<\/li>\n\n\n\n<li><strong>Neurological Disorders:<\/strong> Ocimum Sanctum has been used to treat neurological disorders, such as Parkinson&#8217;s disease and multiple sclerosis. Its antioxidant and anti-inflammatory properties can help protect brain cells from damage and promote nerve regeneration.<\/li>\n<\/ul>\n\n\n\n<p>Overall, Ocimum Sanctum&#8217;s diverse range of therapeutic properties make it a valuable addition to any holistic health regimen. However, it is essential to consult a healthcare professional before using Ocimum Sanctum or any other herbal remedy, especially if you have pre-existing health conditions or are taking medications.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Ocimum Sanctum Homeopathic Uses<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Herbal tea:<\/strong> Ocimum Sanctum leaves can be brewed into tea to promote relaxation, reduce stress, and improve digestion.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> The mother tincture is diluted in water or alcohol and taken orally to treat various ailments.<\/li>\n\n\n\n<li><strong>Essential oil: <\/strong>The essential oil of Ocimum Sanctum can be used in aromatherapy to promote relaxation, clear congestion, and boost immunity.<\/li>\n\n\n\n<li><strong>Culinary:<\/strong> Ocimum Sanctum leaves are commonly used as a culinary herb in various dishes, adding flavor and therapeutic benefits.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Ocimum Sanctum Dosage<\/h2>\n\n\n\n<p>Ocimum Sanctum dosage is an essential aspect of using this potent herb effectively for treating various health conditions. The dosage can vary depending on the condition being treated, the individual&#8217;s needs, and the form of administration. Therefore, it is crucial to consult with a qualified healthcare practitioner for personalized guidance.<\/p>\n\n\n\n<p>Here are some general dosage guidelines for Ocimum Sanctum:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Infusion\/Tea:<\/strong> To prepare an Ocimum Sanctum infusion, steep 1-2 teaspoons of dried leaves or one tablespoon of fresh leaves in boiling water for 10-15 minutes. Drink the tea daily, 2-3 times, for relief from stress, anxiety, digestive disorders, and respiratory infections.<\/li>\n\n\n\n<li><strong>Tincture: <\/strong>Ocimum Sanctum mother tincture can be taken as needed. For general use, take 5-10 drops of the tincture daily, 2-3 times, for relief from stress, anxiety, digestive disorders, and respiratory infections.<\/li>\n\n\n\n<li><strong>Capsules\/Tablets:<\/strong> Ocimum Sanctum capsules or tablets can be taken as needed. For general use, take 300-500 mg of Ocimum Sanctum daily, 2-3 times, for relief from stress, anxiety, digestive disorders, and respiratory infections.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Ocimum Sanctum Dosage for Adults<\/h3>\n\n\n\n<p>For adults, the typical dosage of Ocimum Sanctum mother tincture is 5-10 drops, taken 2-3 times daily. The dosage may be adjusted based on the severity of the condition and the patient&#8217;s response to the medication.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Ocimum Sanctum Dosage for Children<\/h3>\n\n\n\n<p>A qualified healthcare practitioner should determine children&#8217;s dosage. It is generally recommended that children use a lower dosage than adults and dilute the mother tincture in water before administering it.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Ocimum Sanctum?<\/h2>\n\n\n\n<p>Ocimum Sanctum has a wide range of potential benefits, but it is not suitable for everyone. Individuals with certain medical conditions, allergies, or taking specific medications may need to avoid or exercise caution when using Ocimum Sanctum.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant and Breastfeeding Women:<\/strong> Pregnant and breastfeeding women should avoid using Ocimum Sanctum or consult with their healthcare practitioner before using it due to potential risks to the developing fetus or infant.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"Diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"51\">Diabetes<\/a> Patients:<\/strong> Diabetes patients should exercise caution when using Ocimum Sanctum, as it may have blood sugar-lowering effects. Please consult with a healthcare practitioner before using it to ensure it is safe for your individual needs.<\/li>\n\n\n\n<li><strong>Blood-Thinning Medications:<\/strong> Ocimum Sanctum may interact with blood-thinning medications, such as warfarin (Coumadin). Consult with a healthcare practitioner before using Ocimum Sanctum if you are taking any blood-thinning medications.<\/li>\n\n\n\n<li><strong>Allergies and Sensitivity: <\/strong>Some individuals may be allergic to Ocimum Sanctum or sensitive to its compounds. Symptoms of an allergic reaction can include <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-skin-rashes-with-homeopathy\"   title=\"skin rash\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"361\">skin rash<\/a>, itching, hives, and difficulty breathing. If you experience any adverse reactions, stop using Ocimum Sanctum immediately and consult with a <a href=\"https:\/\/weclinic.in\/\">healthcare practitioner<\/a>.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects and Risks of Using Ocimum Sanctum<\/h2>\n\n\n\n<p>While Ocimum Sanctum is generally safe for most people, some individuals may experience side effects or risks when using it. These can include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stomach upset: <\/strong>Ocimum Sanctum can cause stomach upset, including nausea, vomiting, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1366\">diarrhea<\/a>, in some individuals.<\/li>\n\n\n\n<li><strong>Headache:<\/strong> Some individuals may experience a headache or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-migraine-with-homeopathy\"   title=\"migraine\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"9\">migraine<\/a> after using Ocimum Sanctum.<\/li>\n\n\n\n<li><strong>Interaction with Medications:<\/strong> Ocimum Sanctum may interact with certain medications, such as blood-thinning medications, antidepressants, and diabetes medications.<\/li>\n\n\n\n<li><strong>Habit-forming:<\/strong> Ocimum Sanctum is not habit-forming and does not cause addiction or dependency.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The Ayurvedic Pharmacopoeia of India<\/li>\n\n\n\n<li>Indian Medicinal Plants<\/li>\n\n\n\n<li>The Encyclopedia of Herbs and Spices<\/li>\n\n\n\n<li>https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC4296439\/#:~:text=These%20studies%20reveal%20that%20tulsi,%2C%20chemopreventive%2C%20radioprotective%2C%20hepato%2D<\/li>\n\n\n\n<li>https:\/\/pubmed.ncbi.nlm.nih.gov\/16170979\/<\/li>\n\n\n\n<li>https:\/\/www.sciencedirect.com\/science\/article\/pii\/S0975947622001103<\/li>\n\n\n\n<li>https:\/\/ijarsct.co.in\/Paper8313.pdf<\/li>\n\n\n\n<li>https:\/\/www.cureus.com\/articles\/93844-anti-candidal-effect-of-ocimum-sanctum-a-systematic-review-on-microbial-studies#!\/<\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is homeopathic Ocimum Sanctum safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Ocimum Sanctum is generally safe for most people when used as directed. However, it is always advisable to consult with a qualified healthcare practitioner before using any herbal remedy.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Ocimum Sanctum used for?<\/h4><p class=\"saswp-faq-answer-text\">Ocimum Sanctum is used to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to give Ocimum Sanctum to babies?<\/h4><p class=\"saswp-faq-answer-text\">Ocimum Sanctum should only be given to babies by consulting a qualified healthcare practitioner.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How does Ocimum Sanctum work?<\/h4><p class=\"saswp-faq-answer-text\">Ocimum Sanctum works by reducing inflammation, promoting relaxation, and supporting the body&#8217;s natural healing processes.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How long does Ocimum Sanctum take to work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for Ocimum Sanctum to work varies depending on the condition being treated and the individual&#8217;s response to the medication.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Ocimum Sanctum be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Ocimum Sanctum can be taken daily for long-term benefits.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Ocimum Sanctum used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Ocimum Sanctum is used to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Ocimum Sanctum good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Ocimum Sanctum can help reduce acid reflux by soothing the digestive tract and reducing inflammation.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Ocimum Sanctum safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Ocimum Sanctum should be used with caution during pregnancy. Before using it, it is advisable to consult with a qualified healthcare practitioner. For proper consultation and personalized guidance on using Ocimum Sanctum, you can contact Weclinic.<\/p><\/ul><\/div>\n\n\n<p><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Ocimum Sanctum? Ocimum Sanctum, commonly known as Holy Basil, is an aromatic herb native to India. It holds a sacred place in Homoeopathic medicine and is widely used for its therapeutic properties. This versatile plant has been traditionally employed to treat various ailments, including stress, anxiety, inflammation, and digestive issues. Ocimum Sanctum is characterized by its distinct clove-like scent and purple-tinged leaves. It is a rich source of essential oils, flavonoids, and other bioactive compounds that contribute to its medicinal value. Holy Basil is a versatile and powerful herb that has been used in traditional medicine for centuries. <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-588","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Ocimum Sanctum - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Ocimum Sanctum Homeopathic Uses to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Ocimum Sanctum - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Ocimum Sanctum Homeopathic Uses to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-06T11:35:22+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Ocimum Sanctum - Uses, Dosage, Side Effects, Composition, And More","description":"Ocimum Sanctum Homeopathic Uses to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses","og_locale":"en_US","og_type":"article","og_title":"Ocimum Sanctum - Uses, Dosage, Side Effects, Composition, And More","og_description":"Ocimum Sanctum Homeopathic Uses to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.","og_url":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-04-06T11:35:22+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Ocimum Sanctum &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-04-06T11:35:22+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses"},"wordCount":1888,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses","url":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses","name":"Ocimum Sanctum - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-04-06T11:35:22+00:00","description":"Ocimum Sanctum Homeopathic Uses to treat a variety of conditions, including stress, anxiety, digestive issues, respiratory problems, and skin conditions.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/ocimum-sanctum-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Ocimum Sanctum &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/588","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=588"}],"version-history":[{"count":11,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/588\/revisions"}],"predecessor-version":[{"id":3199,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/588\/revisions\/3199"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=588"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=588"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=588"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}