{"id":629,"date":"2024-04-08T05:28:21","date_gmt":"2024-04-08T05:28:21","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=629"},"modified":"2024-05-12T17:40:03","modified_gmt":"2024-05-12T17:40:03","slug":"thuja-occidentalis-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses","title":{"rendered":"Thuja Occidentalis &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Thuja Occidentalis?<\/h2>\n\n\n\n<p>Thuja Occidentalis, commonly known as White Cedar or Arborvitae, is an evergreen tree native to North America. It is a member of the Cupressaceae family and is known for its aromatic foliage and scale-like leaves. Thuja Occidentalis has been used for centuries in traditional medicine by Native Americans and other indigenous cultures. <\/p>\n\n\n\n<p>In Homeopathy, Thuja Occidentalis is a widely used remedy prepared from the bark, leaves, and cones of the tree. It has been traditionally used to treat a wide range of conditions, including eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"167\">psoriasis<\/a>, rheumatism, arthritis, headaches, migraines, digestive problems, respiratory problems, and even skin cancer, infections, and heart problems.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Thuja Occidentalis Chemical Constituents<\/h2>\n\n\n\n<p>Thuja Occidentalis contains a number of active compounds, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Thujone:<\/strong> Thujone, a terpene found in Thuja Occidentalis, exerts stimulant and antispasmodic effects. It is also believed to possess anti-inflammatory and antibacterial properties, making it potentially helpful in treating conditions such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-muscle-spasms-with-homeopathy\"   title=\"muscle spasms\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2488\">muscle spasms<\/a>, inflammation, and bacterial infections.<\/li>\n\n\n\n<li><strong>Camphor:<\/strong> Camphor, another terpene present in Thuja Occidentalis, exhibits stimulant and antiseptic effects. It is commonly used as a topical analgesic to relieve pain and as a decongestant to clear nasal congestion. Camphor&#8217;s antiseptic properties make it effective in treating minor skin infections and wounds.<\/li>\n\n\n\n<li><strong>Borneol: <\/strong>Borneol, a terpene compound found in Thuja Occidentalis, has anti-inflammatory and analgesic effects. It is often used as a sedative to promote relaxation and sleep and as an expectorant to help expel mucus from the respiratory tract. Borneol&#8217;s anti-inflammatory properties may also reduce pain and swelling associated with conditions like arthritis and rheumatism.<\/li>\n\n\n\n<li><strong>Sabinene:<\/strong> Sabinene, a terpene present in Thuja Occidentalis, possesses expectorant and diuretic effects. It is commonly used as an expectorant to help thin and expel mucus from the airways, providing relief from coughs and congestion. Sabinene&#8217;s diuretic properties may also be beneficial in increasing urine output and flushing out toxins from the body.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Thuja Occidentalis Preparation<\/h2>\n\n\n\n<p>In homeopathy, Thuja Occidentalis is primarily used as a mother tincture, which is prepared by macerating the tree&#8217;s fresh or dried leaves in a mixture of alcohol and water. This concentrated extract captures the therapeutic properties of the whole plant. Other forms of Thuja Occidentalis preparations include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Decoction:<\/strong> A decoction is made by boiling the leaves of the tree in water. This method is commonly used in traditional medicine to prepare a tea or medicinal drink.<\/li>\n\n\n\n<li><strong>Powder: <\/strong>Thuja Occidentalis powder can be made by grinding the dried leaves of the tree into a fine powder. This powder can be added to food or drinks or encapsulated for convenience.<\/li>\n\n\n\n<li><strong>Capsules and Tablets:<\/strong> Standardised extracts of Thuja Occidentalis are available in capsule or tablet form. These supplements are typically made from concentrated plant extracts and provide a convenient and consistent dosage.<\/li>\n\n\n\n<li><strong>Creams and Ointments:<\/strong> Thuja Occidentalis is also available in creams and ointments for topical application. These products treat skin conditions such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-warts-with-homeopathy\"   title=\"warts\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"66\">warts<\/a> and eczema.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Thuja Occidentalis Mother Tincture<\/h2>\n\n\n\n<p>The mother tincture of Thuja Occidentalis is diluted in water or alcohol and taken orally to treat various ailments. It is important to note that Thuja Occidentalis should never be taken in its raw form, as it can be toxic.<\/p>\n\n\n\n<p>Steps of preparation of Mother tincture:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Begin by gathering fresh Thuja Occidentalis bark, leaves, and cones. Make sure the bark, leaves, and cones are fresh and free of mold or rot.<\/li>\n\n\n\n<li>Rinse the bark, leaves, and cones thoroughly in <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-cold-with-homeopathy\"   title=\"cold\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2376\">cold<\/a> water.<\/li>\n\n\n\n<li>Remove the bark, leaves, and cones from the water and spread them out to dry completely.<\/li>\n\n\n\n<li>Chop the bark, leaves, and cones into small pieces about the size of a quarter.<\/li>\n\n\n\n<li>Combine the chopped bark, leaves, and cones with 3 gallons of 95% alcohol in a large pot.<\/li>\n\n\n\n<li>Heat the pot over medium-high heat, stirring occasionally.<\/li>\n\n\n\n<li>Bring the mixture to a boil, then reduce the heat to low and let it simmer for 2 hours.<\/li>\n\n\n\n<li>After 2 hours, remove the pot from the heat and let it cool to room temperature.<\/li>\n\n\n\n<li>Strain the mixture through a cheesecloth-lined fine-mesh sieve into a large plastic jar.<\/li>\n\n\n\n<li>Rinse the pot and the sieve with the remaining alcohol and pour it into the jar.<\/li>\n\n\n\n<li>Add the dried bark leaves, and come back to the jar and shake well.<\/li>\n\n\n\n<li>Place the jar in a cool, dark place and let it sit for 2-4 weeks.<\/li>\n\n\n\n<li>Shake the jar daily to ensure that all the ingredients are fully infused with the alcohol.<\/li>\n\n\n\n<li>After 2-4 weeks, remove the bark, leaves, and cones from the jar with a long spatula.<\/li>\n\n\n\n<li>Pour the remaining liquid into a clean, sterilized bottle.<\/li>\n\n\n\n<li>Label the bottle with the name of the herb, the date of preparation, and a description of the preparation method.<\/li>\n\n\n\n<li>Store the bottle in a cool, dark place, away from direct sunlight.<\/li>\n\n\n\n<li>The tincture is ready to use. It should be taken daily in 30-60 ml, depending on the individual&#8217;s age and size.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Thuja Occidentalis<\/h2>\n\n\n\n<p>Thuja Occidentalis has a wide range of therapeutic benefits, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Skin health:<\/strong> Thuja Occidentalis helps treat skin conditions such as warts, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1680\">eczema<\/a>, and psoriasis. It is believed to have antiviral and antibacterial properties that help clear skin infections and promote healing.<\/li>\n\n\n\n<li><strong>Urinary tract health: <\/strong>Thuja Occidentalis helps treat <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-urine-infection-with-homeopathy\"   title=\"urinary tract infections\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"277\">urinary tract infections<\/a> and other urinary problems. It is believed to have diuretic and antiseptic properties that help flush out bacteria from the urinary tract and reduce inflammation.<\/li>\n\n\n\n<li><strong>Genital health: <\/strong>Thuja Occidentalis helps treat genital warts and other genital infections. It is believed to have antiviral and antibacterial properties that help clear infections and promote healing.<\/li>\n\n\n\n<li><strong>Immune support:<\/strong> Thuja Occidentalis stimulates the immune system and helps prevent infections. It is believed to have immunomodulatory properties that help regulate the immune response and protect the body from pathogens.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Thuja Occidentalis Treat?<\/h2>\n\n\n\n<p>Thuja Occidentalis is used to treat a variety of conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Skin warts:<\/strong> Thuja Occidentalis is effective in treating both common and plantar skin warts. It is believed to have antiviral and immunomodulatory properties that help clear the wart virus and stimulate the immune system to prevent recurrence.<\/li>\n\n\n\n<li><strong>Genital warts:<\/strong> Thuja Occidentalis helps treat genital warts caused by the human papillomavirus (HPV). It is believed to have antiviral and anti-inflammatory properties that help clear the infection and reduce inflammation.<\/li>\n\n\n\n<li><strong>Urinary tract infections: <\/strong>Thuja Occidentalis helps treat urinary tract infections, such as cystitis and urethritis. It is believed to have diuretic, antiseptic, and anti-inflammatory properties that help flush out bacteria from the urinary tract, reduce inflammation, and promote healing.<\/li>\n\n\n\n<li><strong>Immune system disorders: <\/strong>Thuja Occidentalis stimulates the immune system and helps prevent infections. It is believed to have immunomodulatory properties that help regulate the immune response and protect the body from pathogens. Thuja Occidentalis may be beneficial for people with weakened immune systems or those who are prone to recurrent infections.<\/li>\n\n\n\n<li><strong>Other conditions:<\/strong> Thuja Occidentalis has also been used to treat a variety of other conditions, including:\n<ul class=\"wp-block-list\">\n<li><strong>Eczema and Psoriasis<\/strong>\n<ul class=\"wp-block-list\">\n<li>Thuja Occidentalis is believed to have anti-inflammatory and antibacterial properties, which may help relieve symptoms of eczema and psoriasis.<\/li>\n\n\n\n<li>It may also help soothe the skin and reduce itching and inflammation.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Rheumatism and Arthritis<\/strong>\n<ul class=\"wp-block-list\">\n<li>Thuja Occidentalis is believed to have anti-inflammatory and analgesic properties, which may help relieve symptoms of rheumatism and arthritis.<\/li>\n\n\n\n<li>It may also help reduce joint pain and stiffness.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Headaches and Migraines<\/strong>\n<ul class=\"wp-block-list\">\n<li>Thuja Occidentalis is believed to have analgesic and anti-inflammatory properties, which may help relieve symptoms of headaches and migraines.<\/li>\n\n\n\n<li>It also helps reduce the severity and frequency of these conditions.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Digestive Problems<\/strong>\n<ul class=\"wp-block-list\">\n<li>Thuja Occidentalis is believed to have anti-inflammatory and analgesic properties, which may help relieve symptoms of digestive problems, such as bloating, gas, and <a href=\"https:\/\/weclinic.in\/blog\/how-to-treat-constipation-with-homeopathy\">constipation<\/a>.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Respiratory Problems<\/strong>\n<ul class=\"wp-block-list\">\n<li>Thuja Occidentalis is believed to have anti-inflammatory and antibacterial properties, which may help relieve symptoms of respiratory problems, such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-homeopathy-can-help-in-treating-cough\"   title=\"cough\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"93\">cough<\/a>, sore throat, and congestion.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Thuja Occidentalis Homeopathic Uses<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pharmacological Activities:<\/strong> Research has shown that Thuja Occidentalis and its constituents possess a wide range of pharmacological activities, including:\n<ul class=\"wp-block-list\">\n<li><strong>Antimicrobial: <\/strong>Thuja Occidentalis has been shown to have antibacterial, antiviral, and antifungal properties. It is effective against a variety of pathogens, including Staphylococcus aureus, Escherichia coli, Candida albicans, and herpes simplex virus.<\/li>\n\n\n\n<li><strong>Anti-inflammatory:<\/strong> Thuja Occidentalis has anti-inflammatory properties that help reduce swelling and pain. It is effective in treating inflammatory conditions such as arthritis and rheumatism.<\/li>\n\n\n\n<li><strong>Immunomodulatory:<\/strong> Thuja Occidentalis helps regulate the immune system and adaptive immunity. It is effective in treating immune system disorders such as recurrent infections and allergies.<\/li>\n\n\n\n<li><strong>Diuretic:<\/strong> Thuja Occidentalis has diuretic properties that help increase urine output and flush out toxins from the body. It is effective in treating urinary tract infections and other conditions that benefit from increased urination.<\/li>\n\n\n\n<li><strong>Other Activities:<\/strong> Thuja Occidentalis has also shown antioxidant, antispasmodic, and expectorant activities.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> The mother tincture is diluted in water or alcohol and taken orally to treat various ailments.<\/li>\n\n\n\n<li><strong>Homeopathic remedies:<\/strong> Thuja Occidentalis is used in homeopathic combination remedies to treat a range of health issues.<\/li>\n\n\n\n<li><strong>Topical ointment: <\/strong>Thuja Occidentalis extract can be applied to the skin to treat skin conditions such as warts and eczema.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Thuja Occidentalis Dosage<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Dosage Variability:<\/strong> The dosage of Thuja Occidentalis varies depending on the specific condition being treated, the individual&#8217;s age and weight, and their overall health.<\/li>\n\n\n\n<li><strong>Personalized Guidance: <\/strong>It is essential to consult with a qualified <a href=\"https:\/\/weclinic.in\/\">healthcare practitioner<\/a> for personalized guidance on the appropriate dosage for your specific needs.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Thuja Occidentalis Dosage for Adults<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Standard Dosage: <\/strong>For adults, the typical dosage of Thuja Occidentalis mother tincture ranges from 5 to 10 drops, taken 2 to 3 times daily.<\/li>\n\n\n\n<li><strong>Dosage Adjustment:<\/strong> The dosage may be adjusted based on the severity of the condition and the individual&#8217;s response to the medication.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Thuja Occidentalis Dosage for Children<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Lower Dosage: <\/strong>Children&#8217;s dosage should be determined by a qualified healthcare practitioner, as it is generally lower than the adult dosage.<\/li>\n\n\n\n<li><strong>Dilution:<\/strong> Before administering the mother tincture to children, it is recommended that the mother dilute it in water.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who should avoid Thuja Occidentalis?<\/h2>\n\n\n\n<p>Individuals who should avoid Thuja Occidentalis include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant or breastfeeding women:<\/strong> Thuja Occidentalis can cross the placenta and enter breast milk, potentially harming the baby. Pregnant and breastfeeding women need to avoid using Thuja Occidentalis unless specifically directed by a qualified healthcare practitioner.<\/li>\n\n\n\n<li><strong>Individuals with kidney or liver disease:<\/strong> Thuja Occidentalis can be toxic to the kidneys and liver. Individuals with pre-existing kidney or liver conditions should avoid using Thuja Occidentalis, as it may worsen their condition.<\/li>\n\n\n\n<li><strong>People with a history of seizures: <\/strong>Thuja Occidentalis can trigger seizures in some individuals, especially those with a history of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-epilepsy-with-homeopathy\"   title=\"epilepsy\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"490\">epilepsy<\/a> or other seizure disorders. People with a history of seizures need to avoid using Thuja Occidentalis, as it may increase their risk of experiencing a seizure.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects and Risks of Using Thuja Occidentalis<\/h2>\n\n\n\n<p>In general, Thuja Occidentalis is considered safe when used in recommended dosages and under the guidance of a qualified healthcare practitioner. However, some potential side effects and risks associated with Thuja Occidentalis include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Skin irritation: <\/strong>Thuja Occidentalis may cause skin irritation or allergic reactions in some individuals. This is more likely to occur when it is applied topically, such as with a cream or ointment.<\/li>\n\n\n\n<li><strong>Digestive upset:<\/strong> Thuja Occidentalis may cause digestive upset, such as nausea, vomiting, or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1375\">diarrhea<\/a>, in some individuals. This is more likely to occur when Thuja Occidentalis is taken orally.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"Headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1993\">Headache<\/a>: <\/strong>Thuja Occidentalis may cause headaches in some individuals. This is typically a temporary side effect that goes away within a few hours.<\/li>\n\n\n\n<li><strong>Interactions with other medications:<\/strong> Thuja Occidentalis may interact with certain medications, such as blood thinners and anticonvulsants. Before using Thuja Occidentalis, it is important to inform your healthcare provider about all medications you are taking.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/www.hpus.com\/pharmacopoeia\/\">The Homoeopathic Pharmacopoeia of the United States<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.homeopathic.com\/materia-medica\/\">Materia Medica of Homoeopathic Medicines<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.encyclopediahomeopathy.com\/\">The Encyclopedia of Homeopathy<\/a><\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is Homoeopathy Thuja Occidentalis Safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Thuja Occidentalis is safe for most people when used as directed. It has been used in traditional medicine for centuries without any reported serious adverse effects. However, it is important to note that Thuja Occidentalis should never be taken in its raw form, as it can be toxic. The homeopathic preparation process removes the toxic compounds and makes the remedy safe for use.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Thuja Occidentalis Used For?<\/h4><p class=\"saswp-faq-answer-text\">Thuja Occidentalis is used to treat a variety of conditions, including:<br>Skin warts<br>Genital warts<br>Urinary tract infections<br>Immune system disorders<br>Eczema and psoriasis<br>Rheumatism and arthritis<br>Headaches and migraines<br>Digestive problems<br>Respiratory problems<br>However, it is important to note that more research is needed to confirm the efficacy of Thuja Occidentalis for some of these conditions.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to Give Thuja Occidentalis to Babies?<\/h4><p class=\"saswp-faq-answer-text\">a Occidentalis should not be given to babies without consulting a qualified healthcare practitioner. The safety and appropriate dosage for children have not been well established.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How Does Thuja Occidentalis Work?<\/h4><p class=\"saswp-faq-answer-text\">Thuja Occidentalis is believed to work by:<br>Stimulating the body&#8217;s natural healing processes<br>Fighting infections<br>Regulating the immune system<br>Reducing inflammation<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How Long Does Thuja Occidentalis Take to Work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for Thuja Occidentalis to show effects can vary widely depending on the individual and the condition being treated. Some people may experience benefits within a few days, while others may need to take it for several weeks or months before noticing significant results.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Thuja Occidentalis Be Taken Daily?<br><\/h4><p class=\"saswp-faq-answer-text\">Yes, Thuja Occidentalis can be taken daily for long-term benefits, such as boosting the immune system and preventing infections. However, it is important to follow the recommended dosage and consult with a healthcare professional if you are taking it for an extended period.<br><\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Thuja Occidentalis Used to Treat?<\/h4><p class=\"saswp-faq-answer-text\">Thuja Occidentalis is primarily used to treat:<br>Skin warts<br>Genital warts<br>Urinary tract infections<br>Immune system disorders<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Thuja Occidentalis Good for Acid Reflux?<\/h4><p class=\"saswp-faq-answer-text\">Thuja Occidentalis is not typically used to treat acid reflux. It may have some anti-inflammatory properties, but it is not considered an effective treatment for this condition.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Thuja Occidentalis Safe for Pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Thuja Occidentalis should not be used during pregnancy. Its safety during pregnancy has not been established, and some studies suggest that it may have potential adverse effects on fetal development.<\/p><\/ul><\/div>\n\n\n<p><br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Thuja Occidentalis? Thuja Occidentalis, commonly known as White Cedar or Arborvitae, is an evergreen tree native to North America. It is a member of the Cupressaceae family and is known for its aromatic foliage and scale-like leaves. Thuja Occidentalis has been used for centuries in traditional medicine by Native Americans and other indigenous cultures. In Homeopathy, Thuja Occidentalis is a widely used remedy prepared from the bark, leaves, and cones of the tree. It has been traditionally used to treat a wide range of conditions, including eczema, psoriasis, rheumatism, arthritis, headaches, migraines, digestive problems, respiratory problems, and even <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-629","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Thuja Occidentalis - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Thuja Occidentalis Homeopathic Uses to treat Skin warts, Genital warts, Urinary tract infections, Immune system disorders.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Thuja Occidentalis - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Thuja Occidentalis Homeopathic Uses to treat Skin warts, Genital warts, Urinary tract infections, Immune system disorders.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-08T05:28:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-12T17:40:03+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Thuja Occidentalis - Uses, Dosage, Side Effects, Composition, And More","description":"Thuja Occidentalis Homeopathic Uses to treat Skin warts, Genital warts, Urinary tract infections, Immune system disorders.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses","og_locale":"en_US","og_type":"article","og_title":"Thuja Occidentalis - Uses, Dosage, Side Effects, Composition, And More","og_description":"Thuja Occidentalis Homeopathic Uses to treat Skin warts, Genital warts, Urinary tract infections, Immune system disorders.","og_url":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-04-08T05:28:21+00:00","article_modified_time":"2024-05-12T17:40:03+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Thuja Occidentalis &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-04-08T05:28:21+00:00","dateModified":"2024-05-12T17:40:03+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses"},"wordCount":1941,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses","url":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses","name":"Thuja Occidentalis - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-04-08T05:28:21+00:00","dateModified":"2024-05-12T17:40:03+00:00","description":"Thuja Occidentalis Homeopathic Uses to treat Skin warts, Genital warts, Urinary tract infections, Immune system disorders.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/thuja-occidentalis-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Thuja Occidentalis &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/629","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=629"}],"version-history":[{"count":14,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/629\/revisions"}],"predecessor-version":[{"id":3541,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/629\/revisions\/3541"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=629"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=629"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=629"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}