{"id":777,"date":"2024-04-28T18:45:21","date_gmt":"2024-04-28T18:45:21","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=777"},"modified":"2024-04-28T18:45:38","modified_gmt":"2024-04-28T18:45:38","slug":"aspidosperma-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/aspidosperma-uses","title":{"rendered":"Aspidosperma &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Aspidosperma?<\/h2>\n\n\n\n<p>Aspidosperma, a popular homeopathic remedy, has been widely used to treat various respiratory issues. It has proven to be highly effective in providing relief from symptoms such as asthma, which can be quite debilitating for those who suffer from it. The remedy is particularly useful in stimulating the respiratory tract, which in turn aids in promoting better breathing and improved overall lung function. <\/p>\n\n\n\n<p>In addition, Aspidosperma has been known to be effective in relieving congestion in the chest, which can lead to a range of other respiratory issues if left untreated. Whether you&#8217;re struggling with asthma or simply experiencing difficulty breathing due to congestion, Aspidosperma can be a helpful addition to your treatment plan. <\/p>\n\n\n\n<p>Aspidosperma is a versatile and effective homeopathic remedy for various respiratory issues. Whether you&#8217;re seeking relief from asthma symptoms or looking to improve your overall lung function, It is a potential treatment option.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Aspidosperma Chemical Constituents<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Indole alkaloids:<\/strong> These are the most abundant and significant group of compounds present in Aspidosperma. They include aspidospermine, quebrachamine, rhazinilam, and various derivatives. These alkaloids have been studied for their potential anticancer, antimalarial, and anti-inflammatory properties.<\/li>\n\n\n\n<li><strong>Terpenoids: <\/strong>Several terpenoid compounds, such as limonoids and triterpenes, have been isolated from various Aspidosperma species. These compounds are known for their cytotoxic, antimicrobial, and antioxidant activities.<\/li>\n\n\n\n<li><strong>Flavonoids:<\/strong> Flavonoids, including flavones, flavonols, and glycosides, are present in Aspidosperma species. These compounds possess antioxidant, anti-inflammatory, and potential anticancer properties.<\/li>\n\n\n\n<li><strong>Lignans:<\/strong> Lignans, such as Aspido lignans and neolignans, have been identified in some Aspidosperma species. These compounds have demonstrated cytotoxic, antimicrobial, and antioxidant activities.<\/li>\n\n\n\n<li><strong>Other compounds:<\/strong> Aspidosperma species also contain various other chemical constituents, including coumarins, phenolic acids, and steroids, which contribute to the overall biological activities of the plants.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aspidosperma Preparation<\/h2>\n\n\n\n<p>Different types of homeopathic medicines can be made from Aspidosperma, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother tincture:<\/strong> This is the original extract of the Aspidosperma bark. It is made by soaking the bark in alcohol for several weeks.<\/li>\n\n\n\n<li><strong>Dilutions:<\/strong> Mother tinctures are often diluted with water or alcohol to create different potencies. The most common potencies are 6X, 12X, and 30X.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aspidosperma Mother Tincture<\/h2>\n\n\n\n<p>The mother tincture is the first step in preparing homeopathic medicines. It is made by macerating the fresh plant material in alcohol. The mother tincture is then used to make dilutions.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Process of making a mother tincture:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Fresh Aspidosperma bark is collected and cleaned.<\/li>\n\n\n\n<li>The bark is cut into small pieces and placed in a glass jar.<\/li>\n\n\n\n<li>Alcohol is added to the jar until the bark is completely covered.<\/li>\n\n\n\n<li>The jar is sealed and placed in a dark, cool place for several weeks.<\/li>\n\n\n\n<li>The mixture is shaken daily.<\/li>\n\n\n\n<li>After several weeks, the mixture is filtered to remove the plant material.<\/li>\n\n\n\n<li>The resulting liquid is the mother tincture.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Uses of the mother tincture:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The mother tincture can be used to make dilutions.<\/li>\n\n\n\n<li>It can also be used topically to treat skin conditions.<\/li>\n\n\n\n<li>The mother tincture is not typically taken orally, as it is very concentrated.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Dilutions:<\/strong><\/li>\n\n\n\n<li>Dilutions are made by mixing the mother tincture with water or alcohol. The most common potencies are 6X, 12X, and 30X.\n<ul class=\"wp-block-list\">\n<li>6X: This dilution is made by mixing one part mother tincture with five parts water or alcohol.<\/li>\n\n\n\n<li>12X: This dilution is made by mixing one part of the 6X dilution with five parts water or alcohol.<\/li>\n\n\n\n<li>30X: This dilution is made by mixing one part of the 12X dilution with five parts water or alcohol.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li>Dilutions are believed to be more effective than the mother tincture, as they are less concentrated.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Aspidosperma<\/h2>\n\n\n\n<p>Aspidosperma has several benefits, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Treating disorders associated with the respiratory system:<\/strong> Aspidosperma effectively treats various respiratory issues, including asthma, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-bronchitis-with-homeopathy\"   title=\"bronchitis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2054\">bronchitis<\/a>, emphysema, chronic obstructive pulmonary disease (COPD), and respiratory tract infections.<\/li>\n\n\n\n<li><strong>Relieving symptoms of asthma and influenza:<\/strong> Aspidosperma is effective in relieving asthma symptoms, such as shortness of breath, wheezing, and coughing. It has also effectively relieved flu symptoms, such as fever, chills, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-sore-throat-with-homeopathy\"   title=\"sore throat\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2311\">sore throat<\/a>.<\/li>\n\n\n\n<li><strong>Relieving congestion in the chest: <\/strong>Aspidosperma effectively relieves congestion in the chest, which can lead to respiratory issues if left untreated.<\/li>\n\n\n\n<li><strong>Promoting breathing: <\/strong>Aspidosperma has been found to stimulate the respiratory system and promote better breathing.<\/li>\n\n\n\n<li><strong>Regulating and reducing high <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"blood pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"127\">blood pressure<\/a>: <\/strong>Aspidosperma effectively regulates and reduces high blood pressure.<\/li>\n\n\n\n<li><strong>Boosting libido and promoting a healthy sex drive: <\/strong>Aspidosperma has been found to boost libido and promote a healthy sex drive.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Aspidosperma treat?<\/h2>\n\n\n\n<p>Aspidosperma is used to treat a variety of conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Respiratory disorders: <\/strong>Aspidosperma effectively treats several respiratory issues, such as asthma, bronchitis, emphysema, chronic obstructive pulmonary disease (COPD), and respiratory tract infections.<\/li>\n\n\n\n<li><strong><a href=\"https:\/\/weclinic.in\/blog\/how-to-treat-asthma-with-homeopathy\">Asthma<\/a>: <\/strong>Aspidosperma relieves asthma symptoms, such as shortness of breath, wheezing, and coughing.<\/li>\n\n\n\n<li><strong>Influenza:<\/strong> Aspidosperma relieves flu symptoms such as fever, chills, and sore throat.<\/li>\n\n\n\n<li><strong>Chest congestion:<\/strong> Aspidosperma effectively relieves chest congestion, which can lead to respiratory issues if left untreated.<\/li>\n\n\n\n<li><strong>High blood pressure:<\/strong> Aspidosperma effectively regulates and reduces high blood pressure.<\/li>\n\n\n\n<li><strong>Low libido:<\/strong> Aspidosperma has been found to boost libido and promote a healthy sex drive.<\/li>\n<\/ul>\n\n\n\n<p>Aspidosperma can help to relieve symptoms such as:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Wheezing: <\/strong>Wheezing is a high-pitched noise that occurs during breathing. It is often a symptom of respiratory problems such as asthma. Aspidosperma effectively relieves wheezing and may also help reduce the severity of asthma attacks.<\/li>\n\n\n\n<li><strong>Shortness of breath:<\/strong> Shortness of breath, also known as dyspnea, can be caused by several respiratory problems. Aspidosperma effectively relieves shortness of breath and may also help reduce the severity of respiratory issues.<\/li>\n\n\n\n<li><strong>Chest congestion:<\/strong> Chest congestion, also known as pleural effusion, is a fluid buildup in the chest cavity. It can cause discomfort and make it difficult to breathe. Aspidosperma effectively relieves chest congestion and may also help reduce the severity of pleural effusion.<\/li>\n\n\n\n<li><strong>Coughing:<\/strong> Coughing is a common symptom of respiratory problems, such as asthma and influenza. Aspidosperma is effective in relieving coughing and also helping reduce the severity of respiratory issues.<\/li>\n\n\n\n<li><strong>Difficulty breathing:<\/strong> Difficulty breathing, also known as dyspnea, can be caused by several respiratory problems. Aspidosperma effectively relieves difficulty breathing and may also help reduce the severity of respiratory issues.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aspidosperma Homeopathic Uses<\/h2>\n\n\n\n<p>Aspidosperma can be used in a variety of ways, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Oral:<\/strong> Aspidosperma can be taken orally through tablets, capsules, or liquid drops. It can also be added to food and beverages.<\/li>\n\n\n\n<li><strong>Topical:<\/strong> Aspidosperma can be applied topically to the chest or back. It can also be added to a bath or steam inhalation.<\/li>\n\n\n\n<li><strong>Inhalation:<\/strong> Aspidosperma can be inhaled by using a nebulizer or an inhaler.<\/li>\n\n\n\n<li><strong>Spray: <\/strong>Aspidosperma can be sprayed directly into the mouth or nose.<\/li>\n\n\n\n<li><strong>Tincture:<\/strong> Aspidosperma can be taken as a tincture made by soaking the plant material in alcohol.<\/li>\n\n\n\n<li><strong>Cream:<\/strong> Aspidosperma can be applied to the chest or back as a cream.<\/li>\n\n\n\n<li><strong>Tea:<\/strong> Aspidosperma can be steeped in hot water to make tea.<\/li>\n\n\n\n<li><strong>Oil: <\/strong>Aspidosperma can be extracted and used as an oil.<\/li>\n<\/ul>\n\n\n\n<p>It is important to note that the above uses are not exhaustive, and there may be other ways to use Aspidosperma based on individual preferences and circumstances. It is also important to follow the instructions on the product label or as directed by a healthcare professional.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Aspidosperma Dosage<\/h2>\n\n\n\n<p>The dosage of Aspidosperma will vary depending on the individual and the condition being treated. Following the dosage instructions on the product label or as your doctor directs is important.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Aspidosperma Dosage for Adults<\/h3>\n\n\n\n<p>The usual dosage for adults is 10 drops of tincture diluted in water thrice a day. This dosage may be increased or decreased based on the individual&#8217;s needs and the condition being treated. It is important not to exceed the maximum dosage recommendation on the product label or as directed by your doctor.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Aspidosperma Dosage for Children<\/h3>\n\n\n\n<p>The usual dosage for children is 5 drops of tincture diluted in water thrice daily. This dosage may be increased or decreased based on the individual&#8217;s needs and the condition being treated. It is important not to exceed the maximum dosage recommendation on the product label or as directed by your doctor. Children under 12 should consult with their doctor before taking Aspidosperma.<br>It is important to note that this dosage is not exhaustive, and other dosages may be recommended depending on the individual&#8217;s needs and the condition being treated. It is also important to follow the instructions on the product label or as directed by a healthcare professional.<br>It is also important to note that Aspidosperma may interact with some medications, so it is important to consult with a healthcare professional before taking Aspidosperma if you take any medications. Additionally, Aspidosperma may cause side effects in some people, such as nausea, vomiting, diarrhea, headache, dizziness, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-skin-rashes-with-homeopathy\"   title=\"skin rash\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"366\">skin rash<\/a>. If you experience any side effects from Aspidosperma, stop taking it and talk to your doctor.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who should avoid Aspidosperma?<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant women:<\/strong> There is limited information about the safety of Aspidosperma during pregnancy, so it is best to avoid it if you are pregnant.<\/li>\n\n\n\n<li><strong>Breastfeeding women: <\/strong>There is limited information about the safety of Aspidosperma while breastfeeding, so it is best to avoid it if you are breastfeeding.<\/li>\n\n\n\n<li><strong>Children under the age of 12: <\/strong>Aspidosperma should only be given to children under 12 with the guidance of a healthcare professional.<\/li>\n\n\n\n<li><strong>Individuals with allergies:<\/strong> Some people may be allergic to Aspidosperma and may experience an allergic reaction if they take it. If you know you are allergic to Aspidosperma, you should avoid it.<\/li>\n\n\n\n<li><strong>Individuals with certain medical conditions:<\/strong> Aspidosperma may interact with certain medications and may cause side effects in people with certain medical conditions. If you have a medical condition, it is important to consult with a healthcare professional before taking Aspidosperma.<\/li>\n\n\n\n<li><strong>Individuals with a weakened immune system:<\/strong> Aspidosperma may suppress the immune system and cause illness in individuals with a weakened immune system. If you have a weakened immune system, it is important to avoid Aspidosperma.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side effects and Risks of using Aspidosperma<\/h2>\n\n\n\n<p>Aspidosperma is generally safe for most people, but like any medication, it can cause side effects and risks. Some of the most common side effects of Aspidosperma include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"Nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1794\">Nausea<\/a> and vomiting:<\/strong> Nausea and vomiting are the most common side effects of Aspidosperma. They can occur within the first few days of Aspidosperma and may be more severe in some people.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"Diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1387\">Diarrhea<\/a>: <\/strong>Diarrhoea can occur as a side effect of Aspidosperma and can be caused by an digestive system irritation<strong>.<\/strong><\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"Headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2000\">Headache<\/a>: <\/strong>Headaches can occur as a side effect of Aspidosperma and can be caused by a nervous system irritation.<\/li>\n\n\n\n<li><strong>Dizziness:<\/strong> Dizziness can occur as a side effect of Aspidosperma and can be caused by a nervous system irritation.<\/li>\n\n\n\n<li><strong>Skin rash:<\/strong> Skin rashes can occur as a side effect of Aspidosperma and can be caused by an allergic reaction.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/www.homeopathyplus.com\/aspidosperma-mother-tincture-q.html\">Aspidosperma<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.homeopathicmateria-medica.org\/remedies\/aspidosperma\">Homoeopathic Materia Medica<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.researchgate.net\/publication\/341342812_Bronchial_Asthma_And_Aspidosperma-_A_Study_In_50_Patients#:~:text=Methods%3A%2050%20patients%20were%20taken,asthma%2C%20Aspidosperma%20were%20prescribed%20in\">(PDF) Bronchial Asthma And Aspidosperma- A Study In 50 Patients<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC6257952\/\">Aspidosperma pyriform, a medicinal plant from the Brazilian caatinga, displays a high antiplasmodial activity and low cytotoxicity &#8211; PMC<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC9845097\/\">Role of herbal medicines in the treatment of infectious diseases &#8211; PMC<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.burnettresearchlab.com\/product-details\/aspidosperma-mt\">Burnett Research Laboratory<\/a><\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is Aspidosperma Mother Tincture safe?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture is generally safe when taken as directed by a healthcare professional. However, if you have any allergies or medical conditions, it&#8217;s always best to consult with your doctor before taking any new supplements.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Aspidosperma Mother Tincture used for?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture is a homeopathic remedy that is used to treat respiratory issues such as asthma, influenza, and congestion in the chest. It also promotes better breathing and can be used to regulate blood pressure, boost libido, and improve sex drive.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Aspidosperma Mother Tincture to babies?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture is not recommended for children under the age of 12. It&#8217;s always best to consult with a healthcare professional before giving any supplement to a child.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Aspidosperma Mother Tincture work?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture works by stimulating the respiratory tract and relieving congestion in the chest. It also promotes better breathing can regulate blood pressure and improves sex drive.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Aspidosperma Mother Tincture take to work?<\/h4><p class=\"saswp-faq-answer-text\">The effects of Aspidosperma Mother Tincture may vary from person to person and can take anywhere from a few days to a few weeks to start working.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Aspidosperma Mother Tincture be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture can be taken daily as directed by a healthcare professional.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Aspidosperma Mother Tincture used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture is used to treat respiratory issues such as asthma and influenza, and congestion in the chest, and can also be used to regulate blood pressure, boost libido, and improve sex drive.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Aspidosperma Mother Tincture good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture may help to alleviate symptoms of acid reflux, but it&#8217;s always best to consult with a healthcare professional before taking any supplement.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Aspidosperma Mother Tincture safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Aspidosperma Mother Tincture is generally considered safe for pregnant women, but it&#8217;s always best to consult with a healthcare professional before taking any supplement<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Aspidosperma? Aspidosperma, a popular homeopathic remedy, has been widely used to treat various respiratory issues. It has proven to be highly effective in providing relief from symptoms such as asthma, which can be quite debilitating for those who suffer from it. The remedy is particularly useful in stimulating the respiratory tract, which in turn aids in promoting better breathing and improved overall lung function. In addition, Aspidosperma has been known to be effective in relieving congestion in the chest, which can lead to a range of other respiratory issues if left untreated. Whether you&#8217;re struggling with asthma or <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-777","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Aspidosperma - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Aspidosperma Homeopathic Uses to treat respiratory issues such as asthma and influenza, and congestion in the chest,\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/aspidosperma-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Aspidosperma - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Aspidosperma Homeopathic Uses to treat respiratory issues such as asthma and influenza, and congestion in the chest,\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/aspidosperma-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-28T18:45:21+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-28T18:45:38+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Aspidosperma - Uses, Dosage, Side Effects, Composition, And More","description":"Aspidosperma Homeopathic Uses to treat respiratory issues such as asthma and influenza, and congestion in the chest,","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/aspidosperma-uses","og_locale":"en_US","og_type":"article","og_title":"Aspidosperma - Uses, Dosage, Side Effects, Composition, And More","og_description":"Aspidosperma Homeopathic Uses to treat respiratory issues such as asthma and influenza, and congestion in the chest,","og_url":"https:\/\/weclinic.in\/blog\/aspidosperma-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-04-28T18:45:21+00:00","article_modified_time":"2024-04-28T18:45:38+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Aspidosperma &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-04-28T18:45:21+00:00","dateModified":"2024-04-28T18:45:38+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses"},"wordCount":1827,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses","url":"https:\/\/weclinic.in\/blog\/aspidosperma-uses","name":"Aspidosperma - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-04-28T18:45:21+00:00","dateModified":"2024-04-28T18:45:38+00:00","description":"Aspidosperma Homeopathic Uses to treat respiratory issues such as asthma and influenza, and congestion in the chest,","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/aspidosperma-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/aspidosperma-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Aspidosperma &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/777","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=777"}],"version-history":[{"count":9,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/777\/revisions"}],"predecessor-version":[{"id":3399,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/777\/revisions\/3399"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=777"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=777"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=777"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}