{"id":975,"date":"2024-05-26T09:18:37","date_gmt":"2024-05-26T09:18:37","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=975"},"modified":"2024-05-26T09:19:14","modified_gmt":"2024-05-26T09:19:14","slug":"cephalandra-indica-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses","title":{"rendered":"Cephalandra Indica &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Cephalandra Indica?<\/h2>\n\n\n\n<p>Cephalandra Indica is a homoeopathic remedy derived from the plant species Cephalandra indica, which is native to India. It is commonly used for treating various conditions related to the female reproductive system, digestive disorders, and certain skin conditions. <\/p>\n\n\n\n<p>Cephalandra Indica is a beneficial homoeopathic remedy mainly used to treat diabetes. It effectively treats blood urea and helps maintain blood sugar levels. Patients suffering from adverse effects of diabetic symptoms can use this dilution to gain relief. It can also be used as a painkiller to treat pains all over the body. <\/p>\n\n\n\n<p>Cephalandra Indica is typically prepared as a homoeopathic dilution, where the original substance is diluted in a mixture of water and alcohol. This process is believed to enhance the remedy&#8217;s therapeutic properties while reducing any potential side effects.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Cephalandra Indica Chemical Constituents<\/h2>\n\n\n\n<p>Cephalandra Indica, widely recognized for its therapeutic potential, contains a variety of chemical constituents that contribute to its health benefits. While specific details about the individual chemical components of Cephalandra Indica may not be well-documented, it&#8217;s typical for plants with medicinal properties to possess a range of bioactive compounds. These can include: <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Alkaloids:<\/strong> Alkaloids are nitrogenous organic compounds known for their pronounced physiological effects on humans and animals. They often serve as a plant&#8217;s defence mechanism against herbivores and pests. In medicinal plants, alkaloids can have a range of pharmacological activities, including analgesic (pain-relieving) and anti-inflammatory properties.<\/li>\n\n\n\n<li><strong>Flavonoids:<\/strong> Flavonoids are a diverse group of phytonutrients found in many fruits and vegetables. They contribute to the vibrant colours of many plants. In addition to their antioxidant properties, flavonoids in medicinal plants like Cephalandra Indica may help reduce inflammation and enhance the immune response.<\/li>\n\n\n\n<li><strong>Terpenoids (or Terpenes):<\/strong> These are a large and varied class of organic compounds produced by various plants, especially conifers. Terpenoids are known for their aromatic qualities and are used in many traditional medicines for their therapeutic properties, including antiseptic, antimicrobial, and antiviral effects.<\/li>\n\n\n\n<li><strong>Saponins: <\/strong>Saponins are compounds found in many plants that typically form a soapy lather when mixed with water. They are known for supporting the immune system, reducing inflammation, and lowering <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-reduce-cholesterol-with-homeopathy\"   title=\"cholesterol\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"250\">cholesterol<\/a> levels.<\/li>\n\n\n\n<li><strong>Phenolic Acids:<\/strong> These are a class of antioxidant compounds that have been shown to provide numerous health benefits, including anti-inflammatory, antiviral, and anti-cancer activities. They also protect the plant from UV radiation and pathogens.<\/li>\n<\/ul>\n\n\n\n<p>Given the array of potential bioactive compounds, Cephalandra Indica&#8217;s ability to treat conditions like <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"59\">diabetes<\/a>, skin disorders, mouth ulcers, and more could be attributed to these chemical constituents working individually or synergistically. However, further research and analysis are necessary to fully understand the roles of specific compounds in Cephalandra Indica and how they contribute to its medicinal properties.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Cephalandra Indica Preparation<\/h2>\n\n\n\n<p>Different types of homoeopathic medicines can be made from Cephalandra Indica, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother tincture:<\/strong> The mother tincture is the first step in preparing homoeopathic medicines. It is made by macerating the fresh plant material in alcohol. The mother tincture is then used to make dilutions.<\/li>\n\n\n\n<li><strong>Dilutions:<\/strong> Dilutions are made by diluting the mother tincture with a mixture of alcohol and water. The dilution process is repeated several times, creating a more dilute solution each time. Dilutions are typically taken orally.<\/li>\n<\/ul>\n\n\n\n<p>The specific preparation method may vary depending on the desired form of the medicine and the homoeopathic pharmacopoeia being followed.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Cephalandra Indica Mother Tincture<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The mother tincture is made by macerating the fresh plant material in alcohol.<\/li>\n\n\n\n<li>The plant material is typically chopped or crushed before being added to the alcohol.<\/li>\n\n\n\n<li>The mixture is then left to macerate for some time, typically several weeks.<\/li>\n\n\n\n<li>During this time, the alcohol extracts the active ingredients from the plant material.<\/li>\n\n\n\n<li>Once the maceration process is complete, the mixture is filtered to remove the plant material. The resulting liquid is the mother tincture.<\/li>\n\n\n\n<li>Mother tinctures are typically stored in amber-coloured bottles to protect them from light.<\/li>\n\n\n\n<li>Mother tinctures are very concentrated and should not be taken undiluted.<\/li>\n\n\n\n<li>They are typically diluted with water or alcohol before being taken orally.<\/li>\n\n\n\n<li>The dilution process helps reduce the medicine&#8217;s strength and makes it safer.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Cephalandra Indica<\/h2>\n\n\n\n<p>Cephalandra Indica has several therapeutic benefits, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Treating mouth ulcers:<\/strong> Cephalandra Indica can help alleviate pain and promote healing of mouth ulcers.<\/li>\n\n\n\n<li><strong>Treating skin disorders:<\/strong> It can be beneficial in treating various skin conditions, such as boils, eruptions, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1693\">eczema<\/a>.<\/li>\n\n\n\n<li><strong>Treating gout and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-homeopathy-can-help-in-treating-cough\"   title=\"cough\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"101\">cough<\/a> problems:<\/strong> Cephalandra Indica may help reduce inflammation and alleviate symptoms of gout and cough.<\/li>\n\n\n\n<li><strong>Acting as a detoxifier and relieving kidney ailments:<\/strong> It can aid in detoxification and support kidney function, helping to alleviate symptoms of kidney ailments.<\/li>\n\n\n\n<li><strong>Treating symptoms of diabetes:<\/strong> Cephalandra Indica can help manage symptoms of diabetes, such as skin eruptions and elevated blood sugar levels.<\/li>\n\n\n\n<li><strong>Helping regulate and control glucose in urine:<\/strong> It can assist in regulating glucose levels in the urine, reducing excessive glucose excretion.<\/li>\n\n\n\n<li><strong>Controlling pulsating nerves:<\/strong> Cephalandra Indica may help calm and control pulsating nerves, relieving nerve pain.<\/li>\n\n\n\n<li><strong>Providing relief from itchiness in the eyes and dryness in the mouth:<\/strong> It can soothe itchy eyes and alleviate dryness in the mouth.<\/li>\n\n\n\n<li><strong>Treating <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-loss-of-appetite-with-homeopathy\"   title=\"loss of appetite\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2468\">loss of appetite<\/a>: <\/strong>Cephalandra Indica may help stimulate appetite and improve digestion.<\/li>\n\n\n\n<li><strong>Reducing blood sugar levels: <\/strong>It can help lower elevated blood sugar levels, which is beneficial for managing diabetes.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Cephalandra Indica Treat?<\/h2>\n\n\n\n<p>Cephalandra Indica is a versatile homoeopathic remedy used to treat a wide range of conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Diabetes:<\/strong> Cephalandra Indica can help control blood sugar levels and reduce skin problems caused by diabetes, such as rashes and itching.<\/li>\n\n\n\n<li><strong>Mouth sores:<\/strong> It can ease the pain and help <a href=\"https:\/\/weclinic.in\/blog\/how-to-treat-mouth-ulcers-with-homeopathy\">mouth sores<\/a> heal faster. It is thought to have anti-inflammatory and antibacterial properties that help reduce inflammation and speed up healing.<\/li>\n\n\n\n<li><strong>Skin problems:<\/strong> Cephalandra Indica can help treat skin conditions like boils, rashes, and eczema. It soothes the skin and reduces itching and discomfort. It is believed to have antiseptic and soothing properties that help reduce inflammation and promote healing.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-gout-with-homeopathy\"   title=\"Gout\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"423\">Gout<\/a>: <\/strong>It can help reduce inflammation and pain caused by gout. It is thought to have uric acid-reducing properties that help lower uric acid levels in the blood and reduce joint pain and swelling.<\/li>\n\n\n\n<li><strong>Cough:<\/strong> Cephalandra Indica can help soothe coughs and reduce inflammation in the respiratory tract. It is believed to have expectorant and anti-inflammatory properties that help loosen mucus and ease coughing.<\/li>\n\n\n\n<li><strong>Kidney problems:<\/strong> It can support kidney function and help relieve symptoms of kidney ailments. It is thought to have diuretic and detoxifying properties that help flush out toxins from the kidneys and improve overall kidney function.<\/li>\n\n\n\n<li><strong>Itchy eyes:<\/strong> Cephalandra Indica can help soothe and reduce itchiness in the eyes. It is believed to have anti-allergic and anti-inflammatory properties that help reduce eye inflammation and irritation.<\/li>\n\n\n\n<li><strong>Dry mouth:<\/strong> It can help relieve dryness and discomfort in the mouth. It is thought to have saliva-stimulating properties that help increase saliva production and reduce dryness.<\/li>\n\n\n\n<li><strong>Loss of appetite:<\/strong> Cephalandra Indica may help stimulate appetite and improve digestion. It is believed to have digestive and tonic properties that help improve digestion and increase appetite.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Cephalandra Indica Homeopathic Uses<\/h2>\n\n\n\n<p>Cephalandra Indica can be used in a variety of ways to address different health concerns:<\/p>\n\n\n\n<p><strong>Oral administration:<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Drops:<\/strong> Cephalandra Indica drops can be taken directly under the tongue or mixed with water. They are typically taken several times daily, as directed by a healthcare practitioner.<\/li>\n\n\n\n<li><strong>Tablets:<\/strong> Cephalandra Indica tablets are typically taken with a glass of water. The dosage and frequency of administration will vary depending on the condition being treated.<\/li>\n\n\n\n<li><strong>Capsules:<\/strong> Cephalandra Indica capsules are swallowed whole with water. The dosage and frequency of administration will vary depending on the condition being treated.<\/li>\n<\/ul>\n\n\n\n<p><strong>Topical application: <\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Creams and ointments:<\/strong> Cephalandra Indica creams and ointments can be applied directly to the affected area of the skin. They are typically used several times daily, as directed by a healthcare practitioner.<\/li>\n\n\n\n<li><strong>Lotions:<\/strong> Cephalandra Indica lotions can be applied to larger areas of the skin or used as a body wash. They are typically used once or twice daily, as directed by a healthcare practitioner.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Cephalandra Indica Dosage<\/h2>\n\n\n\n<p>The dosage of Cephalandra Indica will vary depending on the condition being treated and the individual patient. It is important to follow the instructions of a qualified healthcare practitioner. <\/p>\n\n\n\n<p>The dosage of Cephalandra Indica will vary depending on the condition being treated, the individual patient&#8217;s needs, and the form of the medicine being used. It is important to follow the instructions of a qualified healthcare practitioner when using Cephalandra Indica.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Cephalandra Indica Dosage for Adults<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Tincture:<\/strong> The usual dosage for adults is 10 drops of tincture diluted in water thrice a day.<\/li>\n\n\n\n<li><strong>Tablets:<\/strong> The usual dosage for adults is 2-4, taken thrice daily.<\/li>\n\n\n\n<li><strong>Capsules:<\/strong> The usual dosage for adults is 1-2, taken thrice daily.<\/li>\n\n\n\n<li><strong>Creams and ointments:<\/strong> Cephalandra Indica creams and ointments are typically applied to the affected area of the skin 2-3 times per day.<\/li>\n\n\n\n<li><strong>Lotions:<\/strong> Cephalandra Indica lotions can be applied to larger areas of the skin or used as a body wash once or twice a day.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Cephalandra Indica Dosage for Children<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Tincture:<\/strong> The usual dosage for children is 5 drops of tincture diluted in water thrice a day.<\/li>\n\n\n\n<li><strong>Tablets:<\/strong> The usual dosage for children is 1-2, taken thrice daily.<\/li>\n\n\n\n<li><strong>Capsules:<\/strong> The usual dosage for children is 1 capsule, taken thrice daily.<\/li>\n\n\n\n<li><strong>Creams and ointments:<\/strong> Cephalandra Indica creams and ointments are typically applied to the affected area of the skin 1-2 times per day.<\/li>\n\n\n\n<li><strong>Lotions:<\/strong> Cephalandra Indica lotions can be applied to larger areas of the skin or used as a body wash once a day.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who should avoid Cephalandra Indica?<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>People with known allergies to Cephalandra Indica:<\/strong> Cephalandra Indica is a natural substance, and some people may be allergic to it. If you have any known allergies to Cephalandra Indica or other similar substances, it is important to avoid using it.<\/li>\n\n\n\n<li><strong>People taking certain medications:<\/strong> Cephalandra Indica may interact with certain medications, such as blood thinners and diuretics. If you are taking any medications, it is important to talk to your doctor before using Cephalandra Indica.<\/li>\n\n\n\n<li><strong>People with certain medical conditions:<\/strong> Cephalandra Indica may not be suitable for people with certain medical conditions, such as kidney or heart disease. If you have any underlying health conditions, it is important to talk to your doctor before using Cephalandra Indica.<\/li>\n\n\n\n<li><strong>Pregnant and breastfeeding women:<\/strong> The safety of Cephalandra Indica during pregnancy and breastfeeding has not been fully established. It is generally recommended to avoid using Cephalandra Indica during these times unless specifically directed by a qualified healthcare practitioner.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side effects and risks of using Cephalandra Indica<\/h2>\n\n\n\n<p>It can also cause side effects such as:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"Nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1804\">Nausea<\/a>: <\/strong>Cephalandra Indica can cause nausea in some people. This is usually a mild side effect that goes away on its own. However, if you experience severe nausea or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vomiting-with-homeopathy\"   title=\"vomiting\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2161\">vomiting<\/a>, you should stop using Cephalandra Indica and consult with a healthcare professional.<\/li>\n\n\n\n<li><strong>Vomiting:<\/strong> Vomiting is a less common side effect of Cephalandra Indica. If you experience vomiting, stop using It and consult with a healthcare professional.<\/li>\n\n\n\n<li><strong>Diarrhoea:<\/strong> Diarrhoea is another less common side effect of Cephalandra Indica. If you experience diarrhoea, stop using Cephalandra Indica and consult a healthcare professional.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-skin-rashes-with-homeopathy\"   title=\"Skin rash\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"371\">Skin rash<\/a>:<\/strong> Cephalandra Indica can cause skin rash in some people. This is usually a mild rash that goes away on its own. However, suppose you experience a severe rash or other skin irritation. In that case, you should stop using Cephalandra Indica and consult with a healthcare professional.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/www.homeopathyplus.com\/cephalandra-indica-mother-tincture-q.html\">Cephalandra Indica<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.homeopathicmateria-medica.org\/remedies\/cephalandra\">Homoeopathic Materia Medica<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC6938920\/\">Ameliorative effect of Cephalandra indicia homoeopathic preparation in STZ induced diabetic nephropathy rats &#8211; PMC<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/pubmed.ncbi.nlm.nih.gov\/26143453\/\">Syzygium jambolana and Cephalandra indicia homoeopathic preparations inhibit albumin glycation and protect erythrocytes: an in vitro study &#8211; PubMed<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/homeotrade.com\/product\/cephalandra-indica\/\">CEPHALANDRA INDICA &#8211; Homeopathy-Homeopathy near me | Homeotrade<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.sciencedirect.com\/science\/article\/pii\/S1110093117300327\">Effects of different homoeopathic potencies of Cephalandra indicated in treatment of neuropathic pain in streptozotocin-induced diabetes &#8211; ScienceDirect<\/a><\/li>\n<\/ul>\n\n\n\n<p><strong>FAQS<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is Cephalandra Indica safe?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica is generally considered safe to use as it is a homoeopathic remedy. However, it&#8217;s always best to consult a healthcare professional before taking any new medication or herbal remedy.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Cephalandra Indica used for?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica manages various ailments, including mouth ulcers, skin-related concerns, gout, and cough. It also addresses concerns associated with the kidneys and helps regulate glucose levels in urine.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Cephalandra Indica to babies?<\/h4><p class=\"saswp-faq-answer-text\">The recommended dose of Cephalandra Indica is 3-5 drops in half a cup of water thrice a day or as directed by the physician. Keep out of reach of children and store in a cool and dry place away from direct sunlight.<br><\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Cephalandra Indica work?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica is a detoxifier that relieves kidney ailments and removes toxins through urine. It also helps regulate and control glucose in urine, treats symptoms of diabetes such as skin eruptions, treats gout and cough problems, and acts as a painkiller to treat pains all over the body.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Cephalandra Indica take to work?<\/h4><p class=\"saswp-faq-answer-text\">The effectiveness of Cephalandra Indica may vary from person to person, and it may take several weeks or months to see results. Consult with a healthcare professional for proper guidance.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Cephalandra Indica be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica can be taken daily as directed by a healthcare professional.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Cephalandra Indica used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica is used to manage various ailments, including mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems. It also regulates glucose in the urine, treats symptoms of diabetes, such as skin eruptions, relieves kidney ailments, and removes toxins through urine.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Cephalandra Indica good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">No scientific evidence suggests Cephalandra Indica is effective in treating acid reflux. Consult with a healthcare professional if you are experiencing acid reflux symptoms.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Cephalandra Indica safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Cephalandra Indica is generally considered safe to use during pregnancy. However, consult with a healthcare professional before taking any new medication or herbal remedy during pregnancy.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Cephalandra Indica? Cephalandra Indica is a homoeopathic remedy derived from the plant species Cephalandra indica, which is native to India. It is commonly used for treating various conditions related to the female reproductive system, digestive disorders, and certain skin conditions. Cephalandra Indica is a beneficial homoeopathic remedy mainly used to treat diabetes. It effectively treats blood urea and helps maintain blood sugar levels. Patients suffering from adverse effects of diabetic symptoms can use this dilution to gain relief. It can also be used as a painkiller to treat pains all over the body. Cephalandra Indica is typically prepared <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-975","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Cephalandra Indica - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Cephalandra Indica Homeopathic Uses to treat mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Cephalandra Indica - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Cephalandra Indica Homeopathic Uses to treat mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-05-26T09:18:37+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-26T09:19:14+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Cephalandra Indica - Uses, Dosage, Side Effects, Composition, And More","description":"Cephalandra Indica Homeopathic Uses to treat mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses","og_locale":"en_US","og_type":"article","og_title":"Cephalandra Indica - Uses, Dosage, Side Effects, Composition, And More","og_description":"Cephalandra Indica Homeopathic Uses to treat mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems.","og_url":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-05-26T09:18:37+00:00","article_modified_time":"2024-05-26T09:19:14+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Cephalandra Indica &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-05-26T09:18:37+00:00","dateModified":"2024-05-26T09:19:14+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses"},"wordCount":1974,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses","url":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses","name":"Cephalandra Indica - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-05-26T09:18:37+00:00","dateModified":"2024-05-26T09:19:14+00:00","description":"Cephalandra Indica Homeopathic Uses to treat mouth ulcers, skin disorders such as boils and eruptions, gout, and cough problems.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/cephalandra-indica-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/cephalandra-indica-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Cephalandra Indica &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/975","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=975"}],"version-history":[{"count":12,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/975\/revisions"}],"predecessor-version":[{"id":3524,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/975\/revisions\/3524"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=975"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=975"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=975"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}