{"id":1917,"date":"2024-08-26T10:53:29","date_gmt":"2024-08-26T10:53:29","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=1917"},"modified":"2024-08-26T10:53:31","modified_gmt":"2024-08-26T10:53:31","slug":"eupatorium-perfoliatum-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses","title":{"rendered":"Eupatorium Perfoliatum &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What Is Eupatorium Perfoliatum?<\/h2>\n\n\n\n<p>Eupatorium Perfoliatum is also known as a common boneset or just simply a boneset. It is a perennial plant in the family Asteraceae found in North America. It is widely used as a herbal medicine; it acts as a diaphoretic or an agent to cause sweating. <\/p>\n\n\n\n<p>It was introduced to natives who used the plant for breaking fevers by means of heavy sweating and mainly was used to treat fever. Eupatorium perfoliatum grows up to a height of 100 cm (39 inches) tall. It also contains serrate leaves that clasp the stems (perfoliate). The stems are found to be hairy. The plant creates dense clusters of tiny white flower heads held above the foliage.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Eupatorium Perfoliatum Chemical Constituents<\/h2>\n\n\n\n<p>The leaves and roots of eupatorium perfoliatum contain a mixture of phytochemicals, including polysaccharides, which have xylose and glucuronic acid; tannins which is a phytochemical component, volatile oil. Sesquiterpene lactones, which is a phytochemical component that may contribute to anti-inflammatory effects, sterols, triterpenes, alkaloids, flavonoids, which have quercetin, kaempferol, and caffeic acid derivatives.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Eupatorium Perfoliatum Preparation<\/h2>\n\n\n\n<p>Eupatorium perfoliatum has been used to treat fever, malaria, and inflammation-related conditions. It is also known for its anti-inflammatory, antispasmodic, and diaphoretic properties.<\/p>\n\n\n\n<p>Eupatorium perfoliatum can be prepared in various forms, including extracts, infusions, and pellets.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Extracts:<\/strong> Eupatorium perfoliatum is first dried and then powdered. The use of solvents like methanol and water is done to produce extracts with different polarities. These extracts of eupatorium perfoliatum can then be separated into distinct phases, such as ethyl acetate and acidic aqueous solutions.<\/li>\n\n\n\n<li><strong>Infusions:<\/strong> By steeping 1–2 teaspoons of the herb in a cup of water, the whole herb of eupatorium perfoliatum can be used to produce infusions. When people suffer from flu-related fevers, eupatorium perfoliatum is recommended to drink one cup every half hour as hot as possible.<\/li>\n\n\n\n<li><strong>Dilutions:<\/strong> Eupatorium perfoliatum is also made in liquid form and is used in treating muscle and limb pain, as well as fevers associated with malaria and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-dengue-fever-with-homeopathy\"   title=\"dengue\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1957\">dengue<\/a>. These eupatorium perfoliatum dilutions should be stored in a cool, dry place, away from direct sunlight, to avoid any contamination.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Eupatorium Perfoliatum Mother Tincture<\/h2>\n\n\n\n<p>Eupatorium perfoliatum mother tincture is a homeopathic medicine that helps in curing and reducing pain in the limbs and muscles. It is particularly effective for treating fevers associated with malaria and dengue, and it also helps reduce chest soreness and hoarseness. The main ingredient of eupatorium perfoliatum mother tincture is the extract of common boneset plant and<br>ethanol.<\/p>\n\n\n\n<p>There are multiple benefits of eupatorium perfoliatum mother tincture:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Relieves throbbing headaches<\/li>\n\n\n\n<li>Helps in the treatment of influenza and malaria<\/li>\n\n\n\n<li>Eases severe bone pain<\/li>\n\n\n\n<li>Beneficial for treating cachexia<\/li>\n\n\n\n<li>Helps with <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vertigo-with-homeopathy\"   title=\"vertigo\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"675\">vertigo<\/a>, headaches, and vomiting<\/li>\n\n\n\n<li>Reduces soreness<\/li>\n\n\n\n<li>Assists in treating <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-constipation-with-homeopathy\"   title=\"constipation\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"965\">constipation<\/a> and liver soreness<\/li>\n\n\n\n<li>Alleviates coryza, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-homeopathy-can-help-in-treating-cough\"   title=\"cough\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"674\">cough<\/a>, and chest soreness<\/li>\n\n\n\n<li>Aids in the treatment of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-gout-with-homeopathy\"   title=\"gout\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"676\">gout<\/a><\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits Of Eupatorium Perfoliatum<\/h2>\n\n\n\n<p>Eupatorium perfoliatum is a perennial herb that is native to eastern and central North America. It has been used for centuries in traditional medicine, and research has uncovered several potential benefits of this plant. It is always advised to consult with a healthcare practitioner before use.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Anti-inflammatory Properties:<\/strong> Eupatorium perfoliatum consists of certain phytochemicals, such as flavonoids and sesquiterpene lactones, that show anti-inflammatory effects. The extracts from the plant can reduce the production of pro-inflammatory cytokines and enzymes, which can help reduce inflammation in the body.<\/li>\n\n\n\n<li><strong>Antimicrobial Activity:<\/strong> Eupatorium perfoliatum possesses antimicrobial properties that work against a range of bacteria, fungi, and viruses. It also has active compounds, such as eupafolin and eupatoriopicrin; they have shown the ability to inhibit the growth of various pathogens, making it useful as a natural antimicrobial agent.<\/li>\n\n\n\n<li><strong>Immune System Support:<\/strong> It has been found that eupatorium perfoliatum contains immunomodulatory effects, which help regulate and support the immune system. It also enhances the activity of immune cells, such as T-cells and natural killer cells, which have an essential role in defending the body against infections and diseases.<\/li>\n\n\n\n<li><strong>Fever-Reducing (Antipyretic) Properties:<\/strong> Eupatorium perfoliatum has traditionally been used for the treatment of Pyrexia, and emerging data support antipyretic action. This is due to the effect of its active compounds on prostaglandins, molecules that regulate fever.<\/li>\n\n\n\n<li><strong>Hepatoprotective (protecting the liver) properties:<\/strong> This herb is backed to have hepatoprotective properties. Furthermore, a few studies in rats have indicated that the active compounds may fight oxidative stress and inflammation (two factors linked to liver damage) — although how direct these effects would be on human liver disease remains unclear.<\/li>\n\n\n\n<li><strong>Anti-Cancer effects:<\/strong> In preliminary research, eupatorium perfoliatum appears to have some anti-cancer properties and has been found in other studies to inhibit the growth of specific cancer cell lines. It is responsible for these potential anti-cancer effects due to its active compounds like eupafolin and eupatoriopicrin.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Eupatorium Perfoliatum Treat?<\/h2>\n\n\n\n<p>Eupatorium perfoliatum, also known as boneset, has been used for a long time in history and has detailed therapeutic applications. Here are some primary medical conditions that eupatorium perfoliatum treats:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Fever and Flu-Like Symptoms:<\/strong> Boneset is known for its use in fevers, specifically as an effective adjuvant\/treatment (potentially) against various infections like influenza and malaria. The plant is antipyretic (reduces fever) and anti-inflammatory, advocated for mitigation of symptoms associated with the flu or other viral infections.<\/li>\n\n\n\n<li><strong>Aches and Pains:<\/strong> Eupatorium perfoliatum, for muscle and joint pain like when all over the body just achy, use large doses of 200c. One potential mechanism by which the herb may reduce pain is through abilities to modulate pro-inflammatory mediator production.<\/li>\n\n\n\n<li><strong>Respiratory Conditions: <\/strong>Boneset has a traditional use as an herbal remedy for respiratory diseases, including <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-bronchitis-with-homeopathy\"   title=\"bronchitis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2064\">bronchitis<\/a>, sinusitis, and upper airway congestion infections. Its possible antimicrobial and anti-inflammatory properties might relieve symptoms, aiding in respiratory health.<\/li>\n\n\n\n<li><strong>Digestive Issues:<\/strong> Traditionally, the herb eupatorium perfoliatum has been used to treat a variety of digestive problems, including <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1829\">nausea<\/a>, vomiting, and lack of appetite. The plant might help the liver and may have antispasmodic properties, which means that it relaxes muscles; all of these effects can be why people use it for digestive health.<\/li>\n\n\n\n<li><strong>Immune System Support:<\/strong> According to some research and traditional methods, the boneset is immuno-modulatory, which means that it can help in supporting &amp; balancing the immune system. This can be especially great for those with immune deficiency or who are prone to frequent infections.<\/li>\n\n\n\n<li><strong>Liver and Kidney Health:<\/strong> Eupatorium perfoliatum has potential hepatoprotective activities, and as such, it could be helpful in the maintenance of liver function. In addition, the diuretic activity of the plant can help to maintain healthy kidney function and rid the body of toxins.<\/li>\n\n\n\n<li><strong>Anti-Cancer Effects:<\/strong> Eupatorium perfoliatum might have anti-cancer effects, with specific studies indicating that it can block cancer cell line growth and proliferation.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Eupatorium Perfoliatum Homeopathic Uses<\/h2>\n\n\n\n<p>Boneset or eupatorium perfoliatum is historically used in homeopathic medicine. Homeopathic medicines used for eupatorium perfoliatum on the principle on which homeopathy is based suggests that like cures like, and this has been taken up by practitioners to explain how the herb may be used in a variety of conditions.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Influenza &amp; Flu-like symptoms:<\/strong> Homeopathic eupatorium perfoliatum cures the symptoms of influenza with fever, body aches, and pains in the bones (though it may be less severe), as well headaches, predominantly indicated when chills are experienced. Homeopathy is said to incite the body on its own healing thu,s relieving these flu-modalities.<\/li>\n\n\n\n<li><strong>Muscle and Joint Pain: <\/strong>Eupatorium perfoliatum perspective homeopathic is used to treat a set of muscle and joint pain, including that belonging to rheumatism or arthritis as well as from injuries. It is believed that the remedy tackles the root cause of inflammation and pain perception in these conditions.<\/li>\n\n\n\n<li><strong>Headaches and Migraines:<\/strong> Eupatorium perfoliatum is used to treat headaches that are in addition to a <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-cold-with-homeopathy\"   title=\"cold\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2400\">cold<\/a>, fever, and body-ache may be treated by it. The solution may not offer a preventer for many types of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-migraine-with-homeopathy\"   title=\"migraine\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"672\">migraine<\/a>, and the symptoms appear alike.<\/li>\n\n\n\n<li><strong>Kidney and Bladder Issues:<\/strong> Homeopathically, eupatorium perfoliatum is said to have a special relationship with the kidneys and urological system as well. It can also be taken as a remedy for kidney stones, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-urine-infection-with-homeopathy\"   title=\"urinary tract infections\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"673\">urinary tract infections<\/a>, and more urine-related problems.<\/li>\n\n\n\n<li><strong>Respiratory Conditions:<\/strong> Homeopathic eupatorium perfoliatum is used in short spells to treat respiratory conditions, mainly relating, e.g., to bronchitis, sinusitis, or other upper respiratory tract infections. The treatment is believed to stimulate the body back into its natural healing processes and, in doing so, eventually correct whatever original problem was causing those symptoms.<\/li>\n\n\n\n<li><strong>Digestive Issues:<\/strong> Homeopathic medicine, eupatorium perfoliatum, can be taken occasionally to relieve specific digestion problems, such as nausea or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vomiting-with-homeopathy\"   title=\"vomiting\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2177\">vomiting<\/a> and loss of appetite. Given the balancing effect of a remedy, we might expect it to help improve conditions dependent on being out-of-balance in some way, such as digestive complaints.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Eupatorium Perfoliatum Dosage<\/h2>\n\n\n\n<p>The dosage of eupatorium perfoliatum can vary depending on the form of the medical condition to be treated, the metabolic activity, and the severity of the condition. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Typically, 10-15 drops of mother tincture in a bit of water can be taken 2-3 times daily or as directed by a physician. <\/li>\n\n\n\n<li>Also, 4-6 pellets\/tablets under the tongue can be taken 3 times daily. <\/li>\n\n\n\n<li>While consuming infusion (tea), 1-2 teaspoons of the herb steeped in a cup of hot water can be taken up to 3 times a day, especially during flu fevers. <\/li>\n<\/ul>\n\n\n\n<p>It is essential to always consult with a healthcare professional or a homeopath before starting any treatment to determine the appropriate dosage and ensure it aligns with individual health needs.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Eupatorium Perfoliatum Dosage For Adults<\/h3>\n\n\n\n<p>For adults, the dosage of eupatorium perfoliatum can vary depending on the form in which it is administered. <\/p>\n\n\n\n<p>10-15 drops of the mother tincture of eupatorium perfoliatum in a small amount of water, 2-3 times daily, or as directed by a healthcare provider. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>2-3 drops of dilution in water, 3 times a day, <\/li>\n\n\n\n<li>4-6 pellets\/tablets taken under the tongue could be taken 3 times daily, <\/li>\n\n\n\n<li>1-2 teaspoons of the herbal tea steeped in a cup of hot water, consumed up to 3 times a day, especially during feverish conditions.<\/li>\n<\/ul>\n\n\n\n<p>It is essential to follow the dosage recommendations provided by a healthcare provider or homeopath, as individual needs and conditions may vary.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Eupatorium Perfoliatum Dosage For Children<\/h3>\n\n\n\n<p>The usage of eupatorium perfoliatum for children is not much appreciated by doctors. But when it is recommended in some rare cases, then only a highly diluted form is administered to the children under the strict supervision of healthcare professionals. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Mother tincture is taken as 5-10 drops in a small amount of water about 2-3 times daily.<\/li>\n\n\n\n<li> Dilutions are taken as 1-2 drops in water that too 3 times a day or as advised by a healthcare professional. <\/li>\n\n\n\n<li>Pellets or tablets are taken as 2-3 pellets or tablets can be taken and kept under the tongue that too 3 times daily. <\/li>\n\n\n\n<li>Whereas, infusion (herbal tea) is typically not recommended for young children. <\/li>\n\n\n\n<li>However, for older children, 1\/2 to 1 teaspoon of the herb steeped in a cup of hot water, taken up to 2-3 times a day, may be used under professional guidance.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Eupatorium Perfoliatum?<\/h2>\n\n\n\n<p>Eupatorium perfoliatum is a well-known medicine that is used to treat multiple medical conditions. In some rare cases it might also cause specific side effects to the individuals. Also, there are certain people who should avoid consuming it. Let us learn more about it in detail:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant and Breastfeeding Women:<\/strong> There has not been enough research on the safety of consumption of eupatorium perfoliatum for pregnant and breastfeeding women.<\/li>\n\n\n\n<li><strong>Children:<\/strong> The use of eupatorium perfoliatum in children is not well-studied and described, and it is generally advised to avoid giving it to young children.<\/li>\n\n\n\n<li><strong>Individuals with Autoimmune Disorders:<\/strong> Eupatorium perfoliatum may have immunomodulatory effects on the person consuming it, which could exacerbate symptoms in individuals already having autoimmune conditions, such as rheumatoid arthritis, lupus, or multiple sclerosis.<\/li>\n\n\n\n<li><strong>Individuals with Liver or Kidney Conditions:<\/strong> It is advised to consult with a doctor before consuming eupatorium perfoliatum as it may have effects on the liver and kidneys.<\/li>\n\n\n\n<li><strong>Individuals Taking Medications: <\/strong>Eupatorium perfoliatum may interact with certain medications taken by people, such as blood thinners, anti-inflammatory drugs, and immunosuppressants.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Potential Side Effects And Risks Of Eupatorium Perfoliatum:<\/h3>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Gastrointestinal Upset:<\/strong> Eupatorium perfoliatum may cause some gastrointestinal side effects, such as nausea, vomiting, or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1416\">diarrhea<\/a>, in some individuals.<\/li>\n\n\n\n<li><strong>Allergic Reactions:<\/strong> Although rare in some cases, some people may experience allergic reactions, such as skin rashes, itching, or difficulty breathing, when using eupatorium perfoliatum.<\/li>\n\n\n\n<li><strong>Liver and Kidney Toxicity:<\/strong> There is a slight risk of liver or kidney toxicity with the use of eupatorium perfoliatum, although the exact extent of this risk is not well-established through proper research.<\/li>\n\n\n\n<li><strong>Sedation and Drowsiness:<\/strong> In some cases, eupatorium perfoliatum may cause drowsiness or sedation, which could impair cognitive function or the ability to operate machinery or vehicles.<\/li>\n\n\n\n<li><strong>Interactions with Medications:<\/strong> Eupatorium perfoliatum may interact with certain medications, potentially affecting their efficacy or safety.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>https:\/\/karger.com\/cmr\/article-abstract\/30\/6\/471\/869761\/Effectiveness-of-Eupatorium-perfoliatum-30C-in?redirectedFrom=fulltext<\/li>\n\n\n\n<li>https:\/\/pubmed.ncbi.nlm.nih.gov\/21669270\/<\/li>\n\n\n\n<li>https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S0378874111004053<\/li>\n\n\n\n<li>https:\/\/www.missouribotanicalgarden.org\/PlantFinder\/PlantFinderDetails.aspx?taxonid=277187<\/li>\n\n\n\n<li>https:\/\/www.sciencedirect.com\/science\/article\/abs\/pii\/S037887411100729X<\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic eupatorium perfoliatum safe?<\/h4><p class=\"saswp-faq-answer-text\">Homeopathic eupatorium perfoliatum is generally considered safe when used as directed by a qualified healthcare professional or homeopath. Homeopathic remedies are typically prepared in highly diluted forms, which reduces the risk of side effects.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give eupatorium perfoliatum to babies?<\/h4><p class=\"saswp-faq-answer-text\">Administering eupatorium perfoliatum to babies requires extra care, as their bodies are more sensitive. For babies, the dosage is generally minimal. The healthcare provider might recommend a highly diluted form of eupatorium perfoliatum, such as a 6X or 12X potency. The standard approach is to dissolve 1-2 drops of the diluted remedy in a small amount of water or breast milk and then administer it using a dropper.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does eupatorium perfoliatum work?<\/h4><p class=\"saswp-faq-answer-text\">In herbal medicine, eupatorium perfoliatum acts as a diaphoretic, meaning it promotes sweating. It is used to induce heavy sweating as a way to break fevers. It has since become a standard treatment for fever.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does eupatorium perfoliatum take to work?<\/h4><p class=\"saswp-faq-answer-text\">The time it takes for eupatorium perfoliatum to work can vary depending on several factors, including the individual&#8217;s condition, the form of the remedy, and the dosage used. For acute symptoms such as fever, body aches, or flu-like symptoms, some people may begin to notice relief within a few hours to a day after taking Eupatorium perfoliatum.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can eupatorium perfoliatum be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Eupatorium perfoliatum can be taken daily, but it should be done under the guidance of a healthcare professional or homeopath. The decision to take it daily depends on the condition being treated, the form of the remedy, and the individual&#8217;s overall health.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is eupatorium perfoliatum used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Eupatorium perfoliatum has traditionally been used in various medical conditions, such as to treat fever, malaria, and inflammation-related conditions. Today, it is primarily used as an immune-boosting remedy.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is eupatorium perfoliatum used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, eupatorium perfoliatum is primarily used for treating conditions associated with fever, flu-like symptoms, and pain. Overall, eupatorium perfoliatum is widely used in homeopathy for its effectiveness in managing fevers and symptoms of viral infections.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of eupatorium perfoliatum tonic?<\/h4><p class=\"saswp-faq-answer-text\">The benefits of Eupatorium perfoliatum tonic are based on homeopathic principles, and its effectiveness can vary between individuals. The tonic helps reduce fever and alleviate flu-like symptoms such as chills, body aches, and fatigue. Eupatorium perfoliatum is sometimes used as an immune-boosting remedy, helping to strengthen the body&#8217;s natural defenses against infections.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of eupatorium perfoliatum homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Eupatorium perfoliatum homeopathic medicine is used for various conditions, particularly those associated with fever and severe body aches. In homeopathy, Eupatorium perfoliatum is selected based on a person&#8217;s specific symptoms and overall health condition.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you use eupatorium perfoliatum mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">10-15 drops of the mother tincture of eupatorium perfoliatum are diluted in a small amount of water (e.g., 1-2 tablespoons) and taken 2-3 times daily. Take the diluted tincture orally, ideally 30 minutes before or after eating, for better effectiveness.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What Is Eupatorium Perfoliatum? Eupatorium Perfoliatum is also known as a common boneset or just simply a boneset. It is a perennial plant in the family Asteraceae found in North America. It is widely used as a herbal medicine; it acts as a diaphoretic or an agent to cause sweating. It was introduced to natives who used the plant for breaking fevers by means of heavy sweating and mainly was used to treat fever. Eupatorium perfoliatum grows up to a height of 100 cm (39 inches) tall. It also contains serrate leaves that clasp the stems (perfoliate). The stems are <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-1917","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Eupatorium Perfoliatum - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Eupatorium Perfoliatum Homeopathic Uses for treating conditions associated with fever, flu-like symptoms, and pain.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Eupatorium Perfoliatum - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Eupatorium Perfoliatum Homeopathic Uses for treating conditions associated with fever, flu-like symptoms, and pain.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-08-26T10:53:29+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-08-26T10:53:31+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Eupatorium Perfoliatum - Uses, Dosage, Side Effects, Composition And More","description":"Eupatorium Perfoliatum Homeopathic Uses for treating conditions associated with fever, flu-like symptoms, and pain.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses","og_locale":"en_US","og_type":"article","og_title":"Eupatorium Perfoliatum - Uses, Dosage, Side Effects, Composition And More","og_description":"Eupatorium Perfoliatum Homeopathic Uses for treating conditions associated with fever, flu-like symptoms, and pain.","og_url":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-08-26T10:53:29+00:00","article_modified_time":"2024-08-26T10:53:31+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Eupatorium Perfoliatum &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-08-26T10:53:29+00:00","dateModified":"2024-08-26T10:53:31+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses"},"wordCount":2189,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses","url":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses","name":"Eupatorium Perfoliatum - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-08-26T10:53:29+00:00","dateModified":"2024-08-26T10:53:31+00:00","description":"Eupatorium Perfoliatum Homeopathic Uses for treating conditions associated with fever, flu-like symptoms, and pain.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/eupatorium-perfoliatum-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Eupatorium Perfoliatum &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1917","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=1917"}],"version-history":[{"count":11,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1917\/revisions"}],"predecessor-version":[{"id":3473,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1917\/revisions\/3473"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=1917"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=1917"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=1917"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}