{"id":1969,"date":"2024-08-31T18:19:51","date_gmt":"2024-08-31T18:19:51","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=1969"},"modified":"2024-08-31T18:19:52","modified_gmt":"2024-08-31T18:19:52","slug":"hypericum-perforatum-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses","title":{"rendered":"Hypericum Perforatum &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What Is Hypericum Perforatum?<\/h2>\n\n\n\n<p>Hypericum perforatum is commonly known as St John&#8217;s wort. It is a type of flowering plant in the family of Hypericaceae. Hypericum perforatum is a perennial plant that grows up to one meter tall, with multiple yellow flowers that have clearly visible black glands around their edges, long stamens (male reproductive organs), and three pistils (female reproductive organs). <\/p>\n\n\n\n<p>Hypericum perforatum plant is local to temperate regions across Eurasia and North Africa and has been introduced to East Asia, Australia, New Zealand, and parts of North and South America. The root of the hypericum perforatum plant is slender and woody, featuring numerous small, fibrous side roots as well as extensive, creeping rhizomes. The central root of the plant can extend to a depth of 0.6–1.5 meters into the soil, depending on the growing conditions and environment. Also, its root crown is woody.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Hypericum Perforatum Chemical Constituents<\/h2>\n\n\n\n<p>Hypericum perforatum contains multiple types of bioactive compounds, including naphthodianthrones like hypericin and pseudohypericin, flavonoids such as hyperoside, isoquercetin, and rutin, and phloroglucinols like adhyperforin and hyperforin. It is used in particularly treating effectively mild to moderate depression. <\/p>\n\n\n\n<p>The therapeutic effects of hypericum perforatum are attributed to a diverse range of compounds, including naphthodianthrones (hypericin), phloroglucinol derivatives (hyperforin), and various phenolics (e.g., gallic acid, protocatechuic acid, chlorogenic acid, rosmarinic acid), as well as flavonoids like hyperoside, isoquercetin, quercitrin, quercetin, and rutin.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Hypericum Perforatum Preparation<\/h2>\n\n\n\n<p>Hypericum perforatum is used for treating injuries and bruises of the nerves, like the tongue or fingers. It may also be helpful as a homeopathic treatment for trigeminal neuralgia (TN), a condition that causes severe facial pain. Hypericum perforatum is made into extracts and oils from its flowering parts. The way it is prepared and the solvent used will determine which plant chemicals are extracted.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stirring:<\/strong> Mix 1 kg of raw hypericum perforatum with 7 kg of solvent in an inert gas environment at 55°C and stir it for one hour. Then, centrifuge to separate the extract. Repeat the process with another 7 kg of solvent to extract more from the remaining residue.<\/li>\n\n\n\n<li><strong>Boiling:<\/strong> Gently boil the resultant mixture for four hours until it reduces to about 250 mL. Allow it to cool to room temperature for some time, then filter through paper to clarify it. Next, centrifuge at high speed for 30 minutes and filter through a fine filter. The extract can be refrigerated at 4°C or freeze-dried for storage.<\/li>\n\n\n\n<li><strong>Evaporation:<\/strong> Combine the methanol extracts, then evaporate them under a vacuum at a temperature below 50°C until the volume reduces to 10 mL. Filter the desired sample through a fine PTFE (polytetrafluoroethylene polymer) filter before using it.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-2915534366\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Hypericum Perforatum Mother Tincture<\/h2>\n\n\n\n<p>Hypericum perforatum mother tincture is an effective homeopathic medicine that is derived from the plant family of Hypericaceae. This mother tincture of hypericum perforatum is particularly effective for treating several nerve injuries, especially those affecting the toes, nails, and fingers. It is also beneficial for managing ulcers and piles. The main ingredients used for preparing hypericum perforatum mother tincture are the extracts from the entire blooming Hypericum plant.<\/p>\n\n\n\n<p>Here are the advantages of using hypericum perforatum mother tincture:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Helps manage excessive sweating (hyperhidrosis)<\/li>\n\n\n\n<li>Reduces nervousness<\/li>\n\n\n\n<li>Heals nerve injuries and crushed injuries<\/li>\n\n\n\n<li>Relieves headaches<\/li>\n\n\n\n<li>Alleviates joint pain<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits Of Hypericum Perforatum<\/h2>\n\n\n\n<p>Hypericum perforatum plant has been widely used in many medical conditions for a long time. Various research and studies have shown the effects of hypericum perforatum in various fields.<\/p>\n\n\n\n<p>Here are some benefits of hypericum perforatum discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Depression and Mood Disorders:<\/strong> Hypericum perforatum is a well-known medicine used to treat mild to moderate depression. Various studies show effective results in the treatment of seasonal affective disorder (SAD) and other mood-related conditions.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"Anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1255\">Anxiety<\/a> and Stress Relief:<\/strong> Hypericum perforatum consists of anxiolytic (anxiety-reducing) and stress-relieving properties. It helps in alleviating the symptoms of normal anxiety disorder, social anxiety, and other anxiety-related disorders.<\/li>\n\n\n\n<li><strong>Wound Healing and Anti-inflammatory Properties:<\/strong> Hypericum perforatum has a past history of curing inflammation and promoting the wound healing process. Hyperforin and hypericin are the chemical compounds present in the plant that show anti-inflammatory and antimicrobial effects. It is also used to treat minor cuts, burns, and skin conditions.<\/li>\n\n\n\n<li><strong>Nerve Pain and Neuropathy:<\/strong> Hypericum perforatum has the potential to reduce neuropathic pain, which is associated with diabetic neuropathy, shingles, and other nerve-related conditions. It has the ability to modulate neurotransmitter systems, which may contribute to its analgesic (pain-relieving) effects.<\/li>\n\n\n\n<li><strong>Menopausal Symptoms:<\/strong> Various studies represent the effect of hypericum perforatum on treating menopausal symptoms, such as hot flashes and mood disturbances.<\/li>\n\n\n\n<li><strong>Potential Cancer-Preventive Properties: <\/strong>Preliminary studies depict that hypericum perforatum shows anti-cancer properties and is used in the prevention or adjunctive treatment of certain types of cancer.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Hypericum Perforatum Treat?<\/h2>\n\n\n\n<p>Hypericum perforatum is a herbaceous plant that has been used as a medicine for centuries. It has a variety of medicinal uses that are discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Depression and Mood Disorders:<\/strong> It is a widely used herbal medicine for mild to moderate depression. It is used as a conventional antidepressant medication. It is also helpful in treating seasonal affective disorder (SAD) and other mood-related conditions.<\/li>\n\n\n\n<li><strong>Anxiety and Stress: <\/strong>Anxiolytic (anxiety-reducing) and stress-relieving properties are present in the hypericum perforatum. It also treats generalized anxiety disorder, social anxiety, and other anxiety-related disorders.<\/li>\n\n\n\n<li><strong>Nerve Pain and Neuropathy:<\/strong> Hypericum perforatum is well-studied for curing neuropathic pain, such as that associated with diabetic neuropathy, shingles, and other nerve-related conditions. Also, the plant of hypericum perforatum is capable of modulating neurotransmitter systems, which may contribute to its analgesic (pain-relieving) effects.<\/li>\n\n\n\n<li><strong>Menopausal Symptoms:<\/strong> It is also used in addressing menopausal symptoms, such as hot flashes and mood disturbances.<\/li>\n\n\n\n<li><strong>Skin Problems:<\/strong> The extracts of hypericum perforatum have been used to treat minor cuts, burns, and other skin conditions due to their anti-inflammatory and antimicrobial properties.<\/li>\n\n\n\n<li><strong>Wound Healing: <\/strong>The anti-inflammatory and wound-healing compounds present in hypericum perforatum aid in promoting wound healing pace in the body.<\/li>\n\n\n\n<li><strong>Potential Cancer-Preventive Properties:<\/strong> Hypericum perforatum also possesses anti-cancer properties and could be used in the prevention or adjunctive treatment of certain types of cancer.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-1456157214\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Hypericum Perforatum Homeopathic Uses<\/h2>\n\n\n\n<p>Hypericum perforatum is mostly used in both herbal and homeopathic medicine. The effectiveness of hypericum perforatum homeopathic medicine is a subject of ongoing scientific debate, and the use of Hypericum in homeopathy should be discussed with a qualified homeopathic practitioner.<\/p>\n\n\n\n<p>Here are some of the hypericum perforatum homeopathic medicine uses discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Hypericum is primarily used to treat various types of nerve pain, including trigeminal neuralgia (sudden, sharp facial pain), <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-sciatica-with-homeopathy\"   title=\"sciatica\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"735\">sciatica<\/a> (pain radiating down the leg), and postherpetic neuralgia (nerve pain after shingles).<\/li>\n\n\n\n<li>Homeopathic hypericum perforatum is often used to address injuries or trauma that involve the nerves. Nerve damage from cuts, lacerations, puncture wounds, crushing injuries, and nerve pain associated with bone fractures are some cases.<\/li>\n\n\n\n<li>Hypericum perforatum is used homeopathically to help relieve certain types of headaches, particularly those with a neuralgic or shooting quality. It is used for migraines accompanied by sensitivity to light and noise.<\/li>\n\n\n\n<li>In homeopathy, hypericum perforatum is used to address mental and emotional conditions, such as anxiety and nervousness, mood disorders and depression, and also Irritability and restlessness.<\/li>\n\n\n\n<li>Homeopathic hypericum perforatum is believed to have wound-healing properties and is used to support the healing process for various types of wounds, including cuts, burns, and surgical incisions.<\/li>\n\n\n\n<li>Homeopathic hypericum perforatum can also treat <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-toothache-with-homeopathy\"   title=\"toothache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"734\">toothache<\/a> and jaw pain, menstrual cramps and PMS, shingles, and postherpetic neuralgia.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Hypericum Perforatum Dosage<\/h2>\n\n\n\n<p>Hypericum perforatum is used to cure various diseases, but it has effective results when consumed in the right proportions. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>300 mg of standardized extract of hypericum perforatum can be taken three times daily. <\/li>\n\n\n\n<li>The extract should be standardized to 0.3% hypericin or 5% hyperforin, which are the active chemical compounds present in it. <\/li>\n\n\n\n<li>Forty drops of the tincture can be taken three times daily. <\/li>\n\n\n\n<li>Also, 1-2 grams of dried herb of hypericum perforatum in 150 ml of boiling water, steeped for 10-15 minutes, is taken up to three times daily in the form of a tea. <\/li>\n<\/ul>\n\n\n\n<p>It is also advised to first consult with a healthcare professional before its consumption.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Hypericum Perforatum Dosage For Adults<\/h3>\n\n\n\n<p>The correct dosage of hypericum perforatum can depend on the form in which it is taken, the standardization of the active compounds present in it, and the individual&#8217;s health status. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>The ideal dosage of standardized extract of hypericum perforatum is 300 mg taken three times daily, making a total of 900 mg per day. <\/li>\n\n\n\n<li>The extract should be standardized to contain 0.3% hypericin or 5% hyperforin. <\/li>\n\n\n\n<li>If using a tincture form, the general recommendation is 40 drops, taken three times daily. <\/li>\n\n\n\n<li>Hypericum perforatum, when consumed in the form of tea, is taken 1-2 grams of the dried herb steeped in 150 ml of boiling water. This should be consumed up to three times daily for better results.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Hypericum Perforatum Dosage For Children<\/h3>\n\n\n\n<p>The dosage of hypericum perforatum for children should be prepared with caution, and it is necessary to consult with a healthcare provider before administering this medicine to a child. The dosage of hypericum perforatum may need to be adjusted based on the child&#8217;s age, weight, and specific health needs. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>If prescribed by a doctor, the dosage of a standardized extract may be 150-300 mg per day, divided into 2-3 doses. <\/li>\n\n\n\n<li>If a tincture is used, the dosage would be lower than for adults, with a recommendation being around 10-20 drops, taken two to three times daily. <\/li>\n\n\n\n<li>For older children, a milder form like tea might be used. The preparation could involve 0.5-1 gram of the dried herb steeped in boiling water, taken once or twice daily. This is usually recommended for children over the age of 12 only.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Hypericum Perforatum?<\/h2>\n\n\n\n<p>Hypericum perforatum is a widely used herbal medicine, but it is not suitable for everyone. Here are a few groups of people who should avoid using hypericum perforatum, as well as the potential side effects and risks associated with its use:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Individuals Taking Prescription Medications:<\/strong> The interactions with various kinds of drugs such as antidepressants, anticoagulants (blood thinners), anticonvulsants, immunosuppressants, oral contraceptives, and chemotherapy drugs can reduce the effectiveness of the medications or increase the risk of side effects.<\/li>\n\n\n\n<li><strong>Pregnant and Breastfeeding Women:<\/strong> There is a potential risk of harm to the developing fetus or nursing infant in the women; hence is advised for pregnant and breastfeeding women to consume it.<\/li>\n\n\n\n<li><strong>Children and Adolescents:<\/strong> Due to a lack of reliable data on the appropriate dosing and potential risks for this age group, it is recommended not to intake it without consulting a doctor.<\/li>\n\n\n\n<li><strong>Individuals with Certain Medical Conditions: <\/strong>People with certain medical conditions like bipolar disorder or a history of mania, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"736\">diabetes<\/a>, glaucoma, neurological disorders (e.g., seizures), and liver or kidney disease should avoid its use.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-468881831\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Potential Side Effects and Risks of Hypericum Perforatum:<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Gastrointestinal effects such as nausea, vomiting, abdominal pain, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1425\">diarrhea<\/a>.<\/li>\n\n\n\n<li>Neurological effects like dizziness, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2016\">headache<\/a>, fatigue, and confusion.<\/li>\n\n\n\n<li>Skin and photosensitivity like that of increased sun sensitivity, rashes, and skin irritation.<\/li>\n\n\n\n<li>Cardiovascular effects like elevated heart rate, and irregular heartbeat.<\/li>\n\n\n\n<li>Hypericum perforatum can significantly interact with a wide range of prescription drugs, resulting in reducing their effectiveness or increasing the risk of side effects.<\/li>\n\n\n\n<li>Hypericum perforatum also has some rare cases of triggering manic episodes in individuals with bipolar disorder.<\/li>\n\n\n\n<li>When combined with certain antidepressants, hypericum perforatum increases the risk of serotonin syndrome, a potentially life-threatening condition.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>https:\/\/www.sciencedirect.com\/topics\/agricultural-and-biological-sciences\/hypericum-perforatum<br>https:\/\/www.ncbi.nlm.nih.gov\/books\/NBK92750\/<br>https:\/\/www.frontiersin.org\/journals\/plant-science\/articles\/10.3389\/fpls.2016.01004\/full<br>https:\/\/my.clevelandclinic.org\/health\/drugs\/9304-st&#8211;johns-wort<br>https:\/\/pubs.acs.org\/doi\/10.1021\/acsomega.1c06335<br>https:\/\/plants.ces.ncsu.edu\/plants\/hypericum-perforatum\/<br>https:\/\/www.fs.usda.gov\/database\/feis\/plants\/forb\/hypper\/all.html<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic hypericum perforatum safe?<\/h4><p class=\"saswp-faq-answer-text\">According to various studies, taking an oral form of hypericum perforatum for up to 12 weeks has been shown to be safe for certain people. However, research has not determined whether using beyond 12 weeks is safe.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give hypericum perforatum to babies?<\/h4><p class=\"saswp-faq-answer-text\">Due to the lack of data on safety and efficacy, giving hypericum perforatum to babies is not commonly advised. But, in some rare cases, it can be administered under strict supervision and the right dosage.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does hypericum perforatum work?<\/h4><p class=\"saswp-faq-answer-text\">Hypericum perforatum contains the compound hyperforin, which can inhibit monoamine reuptake. Individuals who find relief with hypericum perforatum supplements often experience symptom improvements comparable to those seen with SSRIs, indicating that hyperforin may influence serotonergic signaling.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does hypericum perforatum take to work?<\/h4><p class=\"saswp-faq-answer-text\">Depending on the form of hypericum perforatum medicine you take, it may take two to six weeks to experience the full effects. However, since there is no conclusive evidence that the supplement is effective, you might not notice any effects at all.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can hypericum perforatum be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, hypericum perforatum can be taken daily, only when it is in the recommended dosage, but it is important to consult a healthcare provider for personalized advice.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is hypericum perforatum used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Hypericum perforatum also contains antibacterial, antioxidant, and antiviral properties. Recent studies indicate it may be useful in treating cancer, inflammatory disorders, and bacterial and viral infections. Additionally, it may provide neuroprotective benefits and has other biological activities, including antidepressant, antifungal, anti-inflammatory, and pain-relieving effects.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is hypericum perforatum used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">It is a highly popular traditional herbal medicine due to its broad range of uses, including treating skin issues like wound healing for burns, stomach ulcers, biliary disorders, bronchial and genitourinary inflammation, colds, migraines, headaches, diabetes, and obesity.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of hypericum perforatum tonic?<\/h4><p class=\"saswp-faq-answer-text\">Hypericum perforatum tonic offers multiple benefits, such as mood enhancement, relief from mild to moderate depression, and potential anti-inflammatory, antimicrobial, and antioxidant effects.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of hypericum perforatum homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Hypericum perforatum homeopathic medicine is commonly used to treat various medical conditions like nerve pain, injuries to nerves, and conditions involving emotional stress or trauma. It is also used for its potential benefits in eliminating the symptoms of depression and anxiety.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you use hypericum perforatum mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">Hypericum perforatum mother tincture is taken 5-10 drops, that too 1-3 times a day. Mix the prescribed number of drops with a small amount of water or another liquid. This helps in easier consumption and better absorption. It is suggested to take the tincture on an empty stomach to enhance absorption. Avoid eating or drinking anything other than water for about 30 minutes before and after taking the tincture.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What Is Hypericum Perforatum? Hypericum perforatum is commonly known as St John&#8217;s wort. It is a type of flowering plant in the family of Hypericaceae. Hypericum perforatum is a perennial plant that grows up to one meter tall, with multiple yellow flowers that have clearly visible black glands around their edges, long stamens (male reproductive organs), and three pistils (female reproductive organs). Hypericum perforatum plant is local to temperate regions across Eurasia and North Africa and has been introduced to East Asia, Australia, New Zealand, and parts of North and South America. The root of the hypericum perforatum plant is <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-1969","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Hypericum Perforatum - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Hypericum Perforatum Homeopathic Uses to treat nerve pain, injuries to nerves, and conditions involving emotional stress or trauma.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Hypericum Perforatum - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Hypericum Perforatum Homeopathic Uses to treat nerve pain, injuries to nerves, and conditions involving emotional stress or trauma.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-08-31T18:19:51+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-08-31T18:19:52+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Hypericum Perforatum - Uses, Dosage, Side Effects, Composition And More","description":"Hypericum Perforatum Homeopathic Uses to treat nerve pain, injuries to nerves, and conditions involving emotional stress or trauma.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses","og_locale":"en_US","og_type":"article","og_title":"Hypericum Perforatum - Uses, Dosage, Side Effects, Composition And More","og_description":"Hypericum Perforatum Homeopathic Uses to treat nerve pain, injuries to nerves, and conditions involving emotional stress or trauma.","og_url":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-08-31T18:19:51+00:00","article_modified_time":"2024-08-31T18:19:52+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Hypericum Perforatum &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-08-31T18:19:51+00:00","dateModified":"2024-08-31T18:19:52+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses"},"wordCount":1947,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses","url":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses","name":"Hypericum Perforatum - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-08-31T18:19:51+00:00","dateModified":"2024-08-31T18:19:52+00:00","description":"Hypericum Perforatum Homeopathic Uses to treat nerve pain, injuries to nerves, and conditions involving emotional stress or trauma.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/hypericum-perforatum-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Hypericum Perforatum &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1969","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=1969"}],"version-history":[{"count":5,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1969\/revisions"}],"predecessor-version":[{"id":3172,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1969\/revisions\/3172"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=1969"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=1969"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=1969"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}