{"id":1990,"date":"2024-09-01T13:29:03","date_gmt":"2024-09-01T13:29:03","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=1990"},"modified":"2024-09-01T13:29:04","modified_gmt":"2024-09-01T13:29:04","slug":"hydrocotyle-asiatica-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses","title":{"rendered":"Hydrocotyle Asiatica &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What Is Hydrocotyle Asiatica?<\/h2>\n\n\n\n<p>Hydrocotyle Asiatica is commonly known as Centella asiatica, Indian pennywort, Asiatic pennywort, spade leaf, coin-wort, or gotu kola. It is a herbaceous, perennial plant found in the flowering plant family Apiaceae. It is found mainly in the tropical regions of Africa, Asia, Australia, and islands in the western Pacific Ocean. It is widely used and consumed as a culinary vegetable and is used in traditional medicine. <\/p>\n\n\n\n<p>Hydrocotyle asiatica grows in temperate and tropical swampy areas in many regions across the world. The stems of Hydrocotyle asiatica are slender, creeping stolons, green to reddish-green, which connects the plants. It also has long-stalked, green, rounded apices which have smooth texture with palmately netted veins.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Hydrocotyle Asiatica Chemical Constituents<\/h2>\n\n\n\n<p>Hydrocotyle asiatica contains multiple chemical compounds like pentacyclic triterpenoids and trisaccharide derivatives, such as asiaticoside, brahmoside, asiatic acid, and brahmic acid (also known as madecassic acid). It also includes other chemical compounds like centellose, centelloside, and madecassoside. Around 124 different chemical compounds have been researched in hydrocotyle asiatica. <\/p>\n\n\n\n<p>Hydrocotyle Asiatica contains multiple active chemical compounds, including triterpenoids and saponins like madecassoside, asiaticoside, centelloside, and Asiatic acid. These compounds help to promote cell growth, collagen production, and the formation of granulation tissue, as well as increase levels of DNA, protein, total collagen, and hexosamine. <\/p>\n\n\n\n<p>Asiaticoside, a key saponin, specifically stimulates type-I collagen production in human skin cells when triterpenes such as Asiatic acid, madecassic acid, and asiaticoside from hydrocotyle asiatica were found to boost collagen production in a dose-dependent way. However, the specific activity of newly formed collagen decreased.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Hydrocotyle Asiatica Preparation<\/h2>\n\n\n\n<p>Hydrocotyle Asiatica, also known as Centella Asiatica or Gotu kola, is a type of perennial plant used in homeopathy to treat various medical conditions. The plant&#8217;s leaves are the most studied, researched, and commonly used to make extracts.<\/p>\n\n\n\n<p>Here are some methods for preparing these extracts:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Alcoholic Solvent Extraction:<\/strong> Extract the aerial parts of the hydrocotyle asiatica plant while using an alcoholic solvent, then pass the resultant solution through an anionic resin. Then defat the eluate with the help of using a liquid\/liquid extraction method. The next includes concentrating the defatted aqueous-alcoholic phase into an aqueous phase. Then pass this aqueous phase through both cationic and anionic resins and lastly stabilize the aqueous phase with alcohol.<\/li>\n\n\n\n<li><strong>Water or Solvent Mixture Extraction:<\/strong> Take the aerial parts hydrocotyle asiatica and mix them with water or a solvent mixture containing at least 10% by weight, then pass the solution through an adsorbent resin. Elute the resin with a solution containing at least 30% by weight and pass it through a decolorizing resin. This whole process gives a discolored aqueous phase, which is concentrated to get extracted. The observed is dissolved in a solvent mixture of water and an alcoholic solvent at around 40°C.<\/li>\n\n\n\n<li><strong>Powder Extraction:<\/strong> The hydrocotyle asiatica herb is dried and pulverized into a fine powder. Next, add 20 grams of this powder to 100 milliliters of a 70% ethanol solution and stir the mixture vigorously for about five hours at 80°C. Filter the obtained mixture using filter paper and then freeze-dry it at -40°C for 48 hours. The resultant lyophilized powder is the crude extract of hydrocotyle asiatica.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-1193457827\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Hydrocotyle Asiatica Mother Tincture<\/h2>\n\n\n\n<p>Hydrocotyle asiatica mother tincture is a herbal remedy with anti-aging and anticonvulsant benefits. The tincture is made from this plant and is used to treat leprosy and help boost intelligence in the body. It also has a mild laxative effect and is used as a tonic for strengthening weak nerves and addressing issues like low sexual energy. <\/p>\n\n\n\n<p>It is an effective treatment for leprosy, gonorrhea, white discharge (leucorrhea), <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-jaundice-with-homeopathy\"   title=\"jaundice\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"745\">jaundice<\/a>, and various skin conditions, including those related to syphilis. Generally, hydrocotyle asiatica mother tincture is prepared using hydrocotyle asiatica with alcohol. <\/p>\n\n\n\n<p>Here are the advantages of using Hydrocotyle asiatica mother tincture:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>It is used to help treat jaundice, skin diseases, fluid retention (dropsy), elephantiasis, leprosy, gonorrhea, and leucorrhea.<\/li>\n\n\n\n<li>Hydrocotyle asiatica mother tincture acts as a gentle laxative and helps increase urine flow.<\/li>\n\n\n\n<li>Used to address weak nerves and low sexual energy.<\/li>\n\n\n\n<li>Enhances intelligence and memory.<\/li>\n\n\n\n<li>Effective for treating syphilitic skin conditions.<\/li>\n\n\n\n<li>Works as an anti-leprosy and anticonvulsant medicine.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Hydrocotyle Asiatica<\/h2>\n\n\n\n<p>Hydrocotyle asiatica has shown promising health benefits in various studies and is widely used among various people to treat multiple medical conditions.<\/p>\n\n\n\n<p>Here are some major benefits of hydrocotyle asiatica discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Skin and Wound Care:<\/strong> It consists of two active compounds, asiaticoside and madecassoside, that have wound-healing skin-regenerating effects. These ingredients may enhance collagen building, which is critical for skin repair and healing of damaged cells. Hydrocotyle asiatica has likewise been applied both topically and orally for minimizing the appearance of scars, ameliorating <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-eczema-with-homeopathy\"   title=\"eczema\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1709\">eczema<\/a> symptoms, as well as boosting skin health in general.<\/li>\n\n\n\n<li><strong>Mental Health and Cognitive Function:<\/strong> The hydrocotyle asiatica plant is being studied as a cognitive enhancer and for memory. It may help soothe stress and depression through neurovascular processes facilitated by active compounds like asiatic acid and madecassic acid, which could exert a potential effect on neuronal growth or synaptic plasticity. It does possess some studies showing that hydrocotyle asiatica might be helpful for those with alzheimers, dementia and other cognitive deficits. Hydrocotyle Asiatica also possibly has anxiolytic (anti-anxiety) and antidepressant effects, which may contribute to the stabilization of the mood state, stress symptom relief, or lowering of acute <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1257\">anxiety<\/a>.<\/li>\n\n\n\n<li><strong>Cardiovascular health:<\/strong> Hyperactivity of certain has been implicated in cardiovascular disease, and therefore, hydrocotyle asiatica was studied for its possible role as a cardioprotective agent. The active ingredients of the herb appear to possess vasodilatory (blood vessel opening) effects, helping in lowering <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"blood pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"744\">blood pressure<\/a> levels and mainstreaming circulation. Research also suggests that antioxidants and compounds present in hydrocotyle asiatica could confer anti-inflammatory properties, to protect blood vessels against inflammatory stress.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"Diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"743\">Diabetes<\/a> management: <\/strong>Hydrocotyle asiatica is another herb that has been researched for its potential benefits in diabetes and managing the complications of diabetic established hyperglycemia. This may help reduce blood sugar levels and improve insulin function, which could be particularly useful for those who have type 2 diabetes. It suggests that some of the active ingredients in hydrocotyle asiatica might also protect against diabetic neuropathy (nerve damage) and other diabetes-related health problems.<\/li>\n\n\n\n<li><strong>Anti-inflammatory and antioxidant properties:<\/strong> Hydrocotyle asiatica consist of active compounds such as asiatic acid and madecassic acid, which prove to inhibit the production of inflammatory mediators and reduce oxidative stress. Such properties may contribute to the potential benefits of hydrocotyle asiatica in medical conditions like arthritis, inflammation, and age-related diseases.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Hydrocotyle Asiatica Treat?<\/h2>\n\n\n\n<p>The main areas where hydrocotyle asiatica has shown potential therapeutic benefits and the medical conditions that it treats are discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Wound healing and skin conditions:<\/strong> Hydrocotyle asiatica encourages wound healing, as the active chemical compounds (such as asiaticoside and madecassoside) present in it stimulate the production of collagen and enhance skin regeneration. It is used topically and orally both to improve the appearance of scars and reduce the symptoms of eczema. It is also protective against ultraviolet (UV) radiation-induced skin damage.<\/li>\n\n\n\n<li><strong>Cognitive function and neurological disorders:<\/strong> Hydrocotyle asiatica has shown efficient results in improving cognitive function, memory, and overall brain health. Its active compounds, like asiatic acid and madecassic acid, show neuroprotective effects and enhance neuronal growth and synaptic plasticity. <br><br>According to some research studies, hydrocotyle asiatica may be beneficial for individuals with Alzheimer&#8217;s disease, dementia, and other cognitive impairments. It also has anxiolytic (anti-anxiety) and antidepressant-like effects for improving mood and reducing symptoms of stress and anxiety.<\/li>\n\n\n\n<li><strong>Cardiovascular health:<\/strong> Hydrocotyle asiatica consists of vasodilatory (blood vessel-widening) effects, which help in lowering blood pressure and improving blood circulation. It also contributes to the maintenance of healthy blood vessels and cardiovascular function through its anti-inflammatory and antioxidant properties.<\/li>\n\n\n\n<li><strong>Diabetes and its complications:<\/strong> Hydrocotyle asiatica helps in managing and maintaining diabetes and its associated complications. It shows insulin-sensitizing and glucose-lowering effects, which can be beneficial for individuals with type 2 diabetes.<\/li>\n\n\n\n<li><strong>Inflammation and oxidative stress-related conditions:<\/strong> Hydrocotyle asiatica has Asiatic acid and madecassic acid, inhibits the production of inflammatory mediators, and reduces oxidative stress.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-1627637382\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Hydrocotyle Asiatica Homeopathic Uses<\/h2>\n\n\n\n<p>In homeopathy, the whole plant of hydrocotyle asiatica, including the leaves, stems, and roots, are used to prepare the homeopathic remedy.<\/p>\n\n\n\n<p>Here are some of the hydrocotyle asiatica homeopathic medicine uses mentioned below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Hydrocotyle Asiatica homeopathic medicines have anti-inflammatory and healing properties for the skin. Hence, they are used to treat various skin conditions, such as eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"746\">psoriasis<\/a>, and dermatitis.<\/li>\n\n\n\n<li>Homeopathic hydrocotyle asiatica also addresses certain circulatory problems, such as poor circulation, varicose veins, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-piles-with-homeopathy\"   title=\"hemorrhoids\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"896\">hemorrhoids<\/a>. It is also helpful in improving blood flow and strengthening blood vessel walls.<\/li>\n\n\n\n<li>Some homeopathic practitioners use hydrocotyle asiatica to maintain cognitive function and memory, especially in the case of old aged people.<\/li>\n\n\n\n<li>As the hydrocotyle asiatica plant is believed to have tissue-regenerative properties, it is used to promote wound healing in the body.<\/li>\n\n\n\n<li>It is also used to address stress, anxiety, and nervous system-related issues, based on the plant&#8217;s traditional use as a brain tonic.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Hydrocotyle Asiatica Dosage<\/h2>\n\n\n\n<p>The appropriate dosage of hydrocotyle asiatica varies depending on the form used and the condition being treated. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>500 mg to 1,000 mg of dried leaf powder of hydrocotyle asiatica can be taken three times daily. <\/li>\n\n\n\n<li>30 to 60 drops of tincture (1:1, 40% alcohol) of hydrocotyle asiatica is taken three times daily. <\/li>\n\n\n\n<li>The standardized extract (with asiaticoside or madecassoside) can be given about 60 to 120 mg once or twice daily. <\/li>\n<\/ul>\n\n\n\n<p>It is important to follow the advice of the healthcare provider&#8217;s advice for proper dosing, especially for long-term use or for treating specific conditions.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Hydrocotyle Asiatica Dosage For Adults<\/h3>\n\n\n\n<p>The dosage of hydrocotyle asiatica for adults depends on the form in which it is consumed and what kind of medical conditions are being treated by it. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>500 mg to 1,000 mg of the dried leaf powder of hydrocotyle asiatica can be taken three times daily. <\/li>\n\n\n\n<li>Tincture (1:1, 40% alcohol) of hydrocotyle asiatica can be taken 30 to 60 drops, about three times daily. <\/li>\n\n\n\n<li>In some cases, 60 to 120 mg of the standardized extract of hydrocotyle asiatica can be taken once or twice daily. <\/li>\n<\/ul>\n\n\n\n<p>However, it is always advised to first consult with a specialized doctor before its intake.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Hydrocotyle Asiatica Dosage For Children<\/h3>\n\n\n\n<p>Generally, the use of hydrocotyle asiatica for children is not recommended by doctors. But under specific conditions, if given, it should be a proper dosage and the right supervision of the doctor. <\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Generally, 250 mg to 500 mg of the dried leaf powder of hydrocotyle asiatica is taken up to three times daily. This is about half the adult dose. <\/li>\n\n\n\n<li>One drop per pound of body weight of the tincture is taken three times daily, and it is very important to note that dosages should be lower than for adults, usually half of the adult dose. <\/li>\n<\/ul>\n\n\n\n<p>Still, it is best to consult with a healthcare provider for precise amounts.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Hydrocotyle Asiatica?<\/h2>\n\n\n\n<p>Although hydrocotyle asiatica is a safe medicine, yet there are some cases where people have observed certain side effects or complications in their medical conditions.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Hydrocotyle asiatica is mostly avoided during pregnancy and breastfeeding, as there is limited research on its safety for the developing fetus and nursing infants.<\/li>\n\n\n\n<li>The use of hydrocotyle asiatica in children is generally prohibited mostly. But when prescribed by the doctor, it is given in low dosage and proper supervision.<\/li>\n\n\n\n<li>Due to the anticoagulant (blood-thinning) properties of hydrocotyle asiatica, it is mostly avoided for individuals with bleeding disorders or those taking anticoagulant medications.<\/li>\n\n\n\n<li>Hydrocotyle asiatica is metabolized by the liver and eliminated through the kidneys, so it should be used cautiously in individuals with impaired liver or kidney function.<\/li>\n<\/ul>\n\n\n<div style=\"margin-left: auto;margin-right: auto;text-align: center;\" id=\"wecli-3936935682\"><a href=\"https:\/\/weclinic.in\/lead.php?utm_source=weclinic&#038;utm_medium=blog&#038;utm_content=blog_articles\" aria-label=\"WeClinic-Homeopathy\"><img loading=\"lazy\" decoding=\"async\" src=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png\" alt=\"\"  srcset=\"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy.png 943w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-300x50.png 300w, https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2024\/06\/WeClinic-Homeopathy-768x128.png 768w\" sizes=\"auto, (max-width: 943px) 100vw, 943px\" width=\"943\" height=\"157\"  style=\"display: inline-block;\" \/><\/a><\/div>\n\n\n<h2 class=\"wp-block-heading\">Potential Side Effects Of Using Hydrocotyle Asiatica<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Gastrointestinal issues:<\/strong> Hydrocotyle asiatica causes many gastrointestinal side effects, such as nausea, vomiting, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1427\">diarrhea<\/a>, and abdominal discomfort.<\/li>\n\n\n\n<li><strong>Allergic reactions:<\/strong> In some rare cases, people might experience allergic reactions, such as skin rashes, itching, or difficulty breathing, after using hydrocotyle asiatica.<\/li>\n\n\n\n<li><strong>Headaches and dizziness:<\/strong> In rare cases, hydrocotyle asiatica use has been associated with headaches and dizziness.<\/li>\n\n\n\n<li><strong>Photosensitivity:<\/strong> Hydrocotyle asiatica can also increase the skin&#8217;s sensitivity to sunlight, leading to a higher risk of sunburn or other sun-related skin irritations.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>https:\/\/www.1mg.com\/otc\/sbl-hydrocotyle-asiatica-mother-tincture-q-otc338447?srsltid=AfmBOortyDRAMZ4Aw2iR04pQY2fX05mV4l3xdMnepvyRkmvu2WU3d97Y&amp;wpsrc=Google+Organic+Search<br>https:\/\/www.allenhomoeopathy.com\/hydrocotyle-asiatica-q<br>https:\/\/www.sciencedirect.com\/topics\/agricultural-and-biological-sciences\/centella-asiatica<br>https:\/\/www.ncbi.nlm.nih.gov\/pmc\/articles\/PMC3116297\/<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Hydrocotyle asiatica safe?<\/h4><p class=\"saswp-faq-answer-text\">Homeopathic hydrocotyle asiatica is mostly considered safe when used as directed normally, but it is important to consult a healthcare professional before use, especially for children and pregnant women.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Hydrocotyle asiatica to babies?<\/h4><p class=\"saswp-faq-answer-text\">The usual dose for children aged between 0 and 11 years is half a teaspoon, which can be taken three times a day. However, during illness, the same dose may be needed every 30-60 minutes. Shake the bottle and gently administer the drops into the baby&#8217;s mouth while they are in an upright position.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Hydrocotyle asiatica work?<\/h4><p class=\"saswp-faq-answer-text\">Hydrocotyle asiatica works by promoting circulation, reducing inflammation, and supporting wound healing in the body. It contains compounds that stimulate collagen production, enhance skin repair, and improve cognitive function.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Hydrocotyle asiatica take to work?<\/h4><p class=\"saswp-faq-answer-text\">Hydrocotyle asiatica may take several weeks to show noticeable effects, depending on the condition being treated and the form used. For skin healing and cognitive benefits, improvements are observed within 4 to 8 weeks of consistent use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Hydrocotyle asiatica be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, hydrocotyle asiatica can be taken daily, but it is important to follow recommended dosages and consult with a healthcare provider for long-term use to avoid possible side effects.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Hydrocotyle asiatica used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Hydrocotyle asiatica has a mild laxative effect and is used as a tonic for addressing seminal weakness and nervous debility. It is highly effective for treating leprosy, gonorrhea, leucorrhea, jaundice, and various skin conditions. It is also beneficial for managing all types of syphilitic skin disorders.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Hydrocotyle asiatica used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In Homeopathy, hydrocotyle asiatica is used to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility. It contains a high concentration of triterpene glycoside Asiatic acid, which exhibits cytotoxic effects on cancer cells.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of Hydrocotyle asiatica tonic?<\/h4><p class=\"saswp-faq-answer-text\">Hydrocotyle Asiatica tonic offers several benefits, such as promoting wound healing, improving blood flow and reducing swelling, helping in managing stress, supporting liver function, and helping in conditions like dropsy and elephantiasis by reducing inflammation and swelling.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Hydrocotyle asiatica homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Hydrocotyle asiatica homeopathic medicine is used to treat conditions such as jaundice, skin diseases, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you use Hydrocotyle asiatica mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">To use hydrocotyle asiatica mother tincture, take 10-15 drops diluted in a small amount of water, and take it on an empty stomach that too two to three times daily.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What Is Hydrocotyle Asiatica? Hydrocotyle Asiatica is commonly known as Centella asiatica, Indian pennywort, Asiatic pennywort, spade leaf, coin-wort, or gotu kola. It is a herbaceous, perennial plant found in the flowering plant family Apiaceae. It is found mainly in the tropical regions of Africa, Asia, Australia, and islands in the western Pacific Ocean. It is widely used and consumed as a culinary vegetable and is used in traditional medicine. Hydrocotyle asiatica grows in temperate and tropical swampy areas in many regions across the world. The stems of Hydrocotyle asiatica are slender, creeping stolons, green to reddish-green, which connects the <\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-1990","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Hydrocotyle Asiatica - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Hydrocotyle Asiatica Homeopathic Uses to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Hydrocotyle Asiatica - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Hydrocotyle Asiatica Homeopathic Uses to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-09-01T13:29:03+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-09-01T13:29:04+00:00\" \/>\n<meta name=\"author\" content=\"Dheeraj Sharma\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dheeraj Sharma\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Hydrocotyle Asiatica - Uses, Dosage, Side Effects, Composition, And More","description":"Hydrocotyle Asiatica Homeopathic Uses to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses","og_locale":"en_US","og_type":"article","og_title":"Hydrocotyle Asiatica - Uses, Dosage, Side Effects, Composition, And More","og_description":"Hydrocotyle Asiatica Homeopathic Uses to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.","og_url":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-09-01T13:29:03+00:00","article_modified_time":"2024-09-01T13:29:04+00:00","author":"Dheeraj Sharma","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Dheeraj Sharma","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses"},"author":{"name":"Dheeraj Sharma","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3"},"headline":"Hydrocotyle Asiatica &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-09-01T13:29:03+00:00","dateModified":"2024-09-01T13:29:04+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses"},"wordCount":2053,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses","url":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses","name":"Hydrocotyle Asiatica - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-09-01T13:29:03+00:00","dateModified":"2024-09-01T13:29:04+00:00","description":"Hydrocotyle Asiatica Homeopathic Uses to treat jaundice, skin conditions, dropsy, elephantiasis, leprosy, gonorrhea, leucorrhea, and nervous debility.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/hydrocotyle-asiatica-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Hydrocotyle Asiatica &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3","name":"Dheeraj Sharma","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","caption":"Dheeraj Sharma"},"description":"Dr. Dheeraj Sharma stands as a distinguished figure in the field of homoeopathy and is renowned for his innovative approach and steadfast commitment to excellence. Dr. Sharma has established himself as a leader in healthcare, blending traditional healing techniques with modern medical advancements to deliver holistic and patient-centered care. His dedication to improving patient outcomes and pushing the boundaries of healthcare has earned him widespread recognition and admiration in the field.","sameAs":["https:\/\/weclinic.in\/dr-dheeraj-sharma.php","https:\/\/www.linkedin.com\/in\/dr-dheeraj-sharma-35a93821b"],"url":"https:\/\/weclinic.in\/blog\/author\/dheeraj_sharma"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1990","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=1990"}],"version-history":[{"count":7,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1990\/revisions"}],"predecessor-version":[{"id":2908,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/1990\/revisions\/2908"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=1990"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=1990"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=1990"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}