{"id":2232,"date":"2024-10-05T14:35:17","date_gmt":"2024-10-05T14:35:17","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=2232"},"modified":"2024-10-05T14:36:11","modified_gmt":"2024-10-05T14:36:11","slug":"robinia-pseudacacia-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses","title":{"rendered":"Robinia Pseudacacia &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Robinia Pseudacacia?<\/h2>\n\n\n\n<p>Robinia pseudoacacia is also famously known as a black locust in its native territory. It is a medium-sized hardwood deciduous tree. Robinia Pseudacacia belongs to the tribe Robinieae of the legume family Fabaceae. The roots of Robinia Pseudacacia contain nodules that allow the plant to fix nitrogen, as is common within the pea family. The trees of Robinia pseudoacacia reach a general height of 12–30 meters, which is 40–100 feet, with a diameter of 0.61 &#8211; 1.22 m or 2– 4 ft.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Robinia Pseudacacia Chemical Constituents<\/h2>\n\n\n\n<p>Black locust or Robinia Pseudacacia leaves contain the chemical compounds like flavone glycosides which are characterized by spectroscopic and chemical methods as the 7-O-β-ᴅ-glucuronopyranosyl-(1→2)[α-ʟ-rhamnopyranosyl-(1→6)]-β-ᴅ-glucopyranosides of acacetin (5,7-dihydroxy-4′-methoxyflavone), apigenin (5,7,4′-trihydroxyflavone), diosmetin (5,7,3′-trihydroxy-4′-methoxyflavone) and luteolin (5,7,3′,4′-tetrahydroxyflavone). <\/p>\n\n\n\n<p>The flowers of Robinia Pseudacacia contain minerals like boron, arsenic, zinc, manganese, iron, magnesium, chromium, calcium, copper, and nickel. The free sugars in the flowers include fructose, sucrose, and glucose. Additionally, the tree has stilbenes like resveratrol and piceatannol, which are antioxidants.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Robinia Pseudacacia Preparation<\/h2>\n\n\n\n<p>Preparing a homeopathic medicine from Robinia Pseudacacia involves careful processing to ensure it is safe and effective. The preparation starts with harvesting the fresh bark, leaves, or flowers of the Robinia Pseudacacia tree. Once collected, the plant material is cleaned and dried. <\/p>\n\n\n\n<p>Next, a process called maceration is performed. This involves soaking the plant parts in alcohol and water. Over time, the active ingredients from the plant are extracted into the liquid mixture. After the extraction, the mixture is filtered to remove any solid plant particles. <\/p>\n\n\n\n<p>The resulting liquid is called a mother tincture, which is a concentrated form of the medicine. After each dilution, the solution is shaken vigorously, a process known as succussion, which is believed to enhance the healing power.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Robinia Pseudacacia Mother Tincture<\/h2>\n\n\n\n<p>Robinia Pseudoacacia mother tincture is a useful medicine for treating too much stomach acid, which often leads to a <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2021\">headache<\/a> in the forehead. It also helps heal burns and soothes digestive problems like a sour stomach. Here are some of the major health benefits of Robinia Pseudoacacia mother tincture discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>Robinia Pseudoacacia mother tincture helps in treating hyperacidity and related issues.<\/li>\n\n\n\n<li>Aids in healing burns.<\/li>\n\n\n\n<li>Useful for treating mental health issues like depression caused by stomach problems.<\/li>\n\n\n\n<li>It can also be used to prevent and reduce bleeding gums.<\/li>\n\n\n\n<li>It is also safe to use with no side effects, thanks to its homeopathic composition.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Robinia Pseudacacia<\/h2>\n\n\n\n<p>Robinia Pseudacacia offers many health benefits for people struggling with digestive problems, including hyperacidity, heartburn, and related headaches. It also promotes the healing of burns, improves mental health related to stomach issues, and helps with gum bleeding. Let us discuss these benefits of Robinia Pseudacacia in detail:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><span style=\"box-sizing: border-box; margin: 0px; padding: 0px;\"><strong>Treats Hyperacidity: <\/strong>The medicine works by reducing <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-acidity-with-homeopathy\"   title=\"acidity\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1010\">acidity<\/a>, making it easier for the stomach to function properly during situations when the stomach produces too much acid.<\/span> This can lead to symptoms like heartburn, sour stomach, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-indigestion-with-homeopathy\"   title=\"indigestion\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1583\">indigestion<\/a>; in such cases, Robinia Pseudacacia is used more often.<\/li>\n\n\n\n<li><strong>Relieves Heartburn and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-acid-reflux-with-homeopathy\"   title=\"Acid Reflux\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1328\">Acid Reflux<\/a>:<\/strong> Robinia Pseudacacia helps by neutralizing the excess acid and soothing the burning feeling when the stomach acid moves up into the esophagus, causing discomfort and a burning sensation.<\/li>\n\n\n\n<li><strong>Enhances Digestion:<\/strong> People suffering from digestive discomfort, bloating, or a sour taste in their mouth after eating may benefit from Robinia Pseudacacia. It is widely used to regulate digestion by balancing the stomach&#8217;s acid levels, which prevents issues like gas and indigestion.<\/li>\n\n\n\n<li><strong>Eases Headaches:<\/strong> Robinia Pseudacacia is also known for relieving headaches that are linked to digestive problems. Some people experience pain, especially in the forehead area, when they have stomach issues.<\/li>\n\n\n\n<li><strong>Helps with Mental Health Issues:<\/strong> Robinia Pseudacacia also helps improve mood and mental well-being by reducing the discomfort that contributes to these feelings.<\/li>\n\n\n\n<li><strong>Prevents Gum Bleeding:<\/strong> Robinia Pseudacacia is also beneficial for dental health. It helps in reducing bleeding gum.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Robinia Pseudacacia Treat?<\/h2>\n\n\n\n<p>Robinia Pseudacacia is used to treat a variety of medical issues and has multiple health benefits. Let us discuss and learn about them in detail:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Excess Stomach Acid:<\/strong> Robinia Pseudacacia is very effective for treating hyperacidity, a condition in which the stomach produces too much acid. This can lead to uncomfortable symptoms like heartburn, a burning sensation in the chest, and sour burps.<\/li>\n\n\n\n<li><strong>Heartburn and Acid Reflux:<\/strong> Robinia Pseudacacia helps neutralize the acid and prevents it from causing irritation.<\/li>\n\n\n\n<li><strong>Indigestion:<\/strong> Robinia Pseudacacia is very helpful for those with indigestion or a sour stomach, where the stomach feels uncomfortable, bloated, or overly full after eating.<\/li>\n\n\n\n<li><strong>Gastric Headaches:<\/strong> Robinia Pseudacacia helps by treating the stomach issue, which in turn reduces the headache. These headaches are often felt in the forehead area and are linked to too much acid in the stomach.<\/li>\n\n\n\n<li><strong>Bleeding Gums:<\/strong> It helps reduce the bleeding and improves gum health, especially if the problem is related to digestive disturbances.<\/li>\n\n\n\n<li><strong>Mental Health:<\/strong> Robinia Pseudacacia not only treats stomach issues but can also improve mood by relieving the discomfort that often leads to these emotional symptoms.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Robinia Pseudacacia Homeopathic Uses<\/h2>\n\n\n\n<p>Robinia Pseudacacia is a versatile homeopathic medicine primarily used to treat multiple health issues. Here are some discussed below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Treats Hyperacidity:<\/strong> Robinia Pseudacacia is known for its ability to reduce the production of stomach acid. When too much acid builds up, it can cause heartburn, sour burps, and discomfort after eating.<\/li>\n\n\n\n<li><strong>Eases Heartburn and Acid Reflux:<\/strong> Robinia Pseudacacia helps to stop burning feelings in the chest and throat by reducing the amount of acid in the stomach and preventing the acid from rising.<\/li>\n\n\n\n<li><strong>Relieves Indigestion and Sour Stomach:<\/strong> Robinia Pseudacacia balances the stomach’s acid levels, making digestion smoother and reducing discomforts like bloating or gas.<\/li>\n\n\n\n<li><strong>Cures Gastric Headaches:<\/strong> Robinia Pseudacacia can help relieve headaches associated with digestive issues by treating the root cause, which is too much acid in the stomach.<\/li>\n\n\n\n<li><strong>Aids Gum Bleeding:<\/strong> It reduces the bleeding and strengthens the gums, especially when the bleeding is related to digestive disturbances.<\/li>\n\n\n\n<li><strong>Improves Mental Health Linked to Stomach Issues:<\/strong> Stomach problems, especially chronic ones, can lead to mental health concerns like depression, irritability, or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1269\">anxiety<\/a>. By relieving stomach discomfort, Robinia Pseudacacia can also help improve mood and mental well-being.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Robinia Pseudacacia Dosage<\/h2>\n\n\n\n<p>The dosage of Robinia Pseudacacia in homeopathy depends on the individual&#8217;s symptoms, age, and overall health. It is typically used in various potencies, such as 6C, 30C, or 200C, and the dose can vary based on the condition being treated. For hyperacidity, heartburn, gastric headaches, and indigestion, it is advised to take 3-5 pellets 2-3 times a day or as directed by a homeopath. For chronic conditions, a higher potency like 200C may be used, but only under professional supervision.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Robinia Pseudacacia Dosage For Adults<\/h3>\n\n\n\n<p>The dosage of Robinia Pseudacacia for adults depends on the health issue being treated. For various health conditions like hyperacidity, heartburn, indigestion or sour stomach, and for headaches from stomach problems, Take 3-5 pellets 2-3 times daily until the symptoms improve. Take the pellets of the Robinia Pseudacacia medicine at least 15-30 minutes before or after eating or drinking. Always consult a homeopathic doctor for the correct dosage, especially if using higher potencies like 200C.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Robinia Pseudacacia Dosage For Children<\/h3>\n\n\n\n<p>The dosage of Robinia Pseudacacia for children is generally lower than for adults, and it is important to consult a healthcare professional before giving any homeopathic remedy to a child. Generally, it is avoided to be administered to the children without proper supervision from the healthcare provider. <\/p>\n\n\n\n<p>For hyperacidity and heartburn, indigestion or sour stomach, and for headaches linked to stomach issues, give 2-3 pellets, 2-3 times a day to the children. Give the remedy 15-30 minutes before or after food or drinks. Reduce the dosage frequency as symptoms improve. Always consult a pediatric homeopath for the correct dosage, especially for young children or if higher potencies are needed.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Robinia Pseudacacia?<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant or Nursing Women:<\/strong> The safety of Robinia Pseudacacia during pregnancy and lactation has not been established well in the research and studies, so it is best to avoid it, as per the doctors.<\/li>\n\n\n\n<li><strong>Children: <\/strong>Young children are more susceptible to complications caused by the medicine due to the toxic effects of certain plant compounds.<\/li>\n\n\n\n<li><strong>Individuals with Allergies:<\/strong> People with known allergies to legumes may also react to Robinia Pseudacacia, hence it is avoided for consumption.<\/li>\n\n\n\n<li><strong>People with Certain Medical Conditions:<\/strong> Certain people suffering from liver or kidney health issues should avoid it, as it may exacerbate their conditions.<\/li>\n\n\n\n<li><strong>Individuals on Certain Medications:<\/strong> It may interact with medications, particularly those affecting liver metabolism.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects and Risks of Using Robinia Pseudacacia<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Toxicity:<\/strong> The leaves and unripe pods of Robinia Pseudacacia may contain toxic compounds, including alkaloids, which can cause nausea, vomiting, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diarrhea-with-homeopathy\"   title=\"diarrhea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1441\">diarrhea<\/a>, and even more severe reactions if ingested in significant amounts.<\/li>\n\n\n\n<li><strong>Gastrointestinal Distress:<\/strong> Even small amounts can lead to stomach upset or digestive issues.<\/li>\n\n\n\n<li><strong>Allergic Reactions:<\/strong> Skin rashes, itching, or respiratory issues may occur in susceptible individuals.<\/li>\n\n\n\n<li><strong>Neurological Effects: <\/strong>High doses of Robinia Pseudacacia can potentially lead to symptoms such as dizziness or confusion.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>https:\/\/en.wikipedia.org\/wiki\/Robinia_pseudoacacia<\/li>\n\n\n\n<li>https:\/\/www.sciencedirect.com\/topics\/pharmacology-toxicology-and-pharmaceutical-science\/robinia-pseudoacacia<\/li>\n\n\n\n<li>https:\/\/www.fs.usda.gov\/database\/feis\/plants\/tree\/robpse\/all.html<\/li>\n\n\n\n<li>https:\/\/www.sciencedirect.com\/topics\/agricultural-and-biological-sciences\/robinia-pseudoacacia<\/li>\n\n\n\n<li>https:\/\/homoeocart.in\/product\/sbl-robinia-pseudacacia-30-ch-30ml\/<\/li>\n\n\n\n<li>https:\/\/www.fs.usda.gov\/database\/feis\/plants\/tree\/robpse\/all.html#:~:text=Percent%20density%20of%20all%20trees,mesic%20to%20wet%20forests%20%5B222%5D<\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Robinia Pseudacacia safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathic Robinia Pseudacacia is generally considered safe when used as directed. It is made from highly diluted substances, which minimizes the risk of side effects. However, it&#8217;s important to consult a healthcare professional before use, especially for children or individuals with specific health conditions.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Robinia Pseudacacia to babies?<\/h4><p class=\"saswp-faq-answer-text\">To give Robinia Pseudacacia to babies, first consult a pediatric homeopath to determine the appropriate potency, usually 6C or 30C. For the dosage, dissolve 1-2 pellets in a small amount of water or place them directly on the tongue. Administer the remedy 15-30 minutes before or after feeding to ensure better absorption.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Robinia Pseudacacia work?<\/h4><p class=\"saswp-faq-answer-text\">Robinia Pseudacacia works primarily by balancing stomach acid levels and alleviating digestive issues. It helps reduce hyperacidity, relieving symptoms like heartburn and indigestion by calming the stomach lining. Its effectiveness is attributed to its bioactive compounds, which have antioxidant and soothing properties, making it beneficial in homeopathic treatments for various conditions.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Robinia Pseudacacia take to work?<\/h4><p class=\"saswp-faq-answer-text\">Robinia Pseudacacia typically takes effect within a few hours to a few days, depending on the individual&#8217;s condition and response to treatment. For acute issues like hyperacidity or heartburn, relief may be noticeable relatively quickly, while chronic conditions may require longer use to see significant improvements.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Robinia Pseudacacia be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Robinia Pseudacacia can be taken daily, but it&#8217;s important to follow the guidance of a healthcare professional or homeopath regarding the appropriate dosage and duration based on individual needs. Regular monitoring of symptoms is also advisable.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Robinia Pseudacacia used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Robinia Pseudacacia is used to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns. It may also help address psychological issues related to digestive problems.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Robinia Pseudacacia used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, Robinia Pseudacacia is used to treat conditions such as hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns. It may also be indicated for psychological disturbances linked to digestive issues.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of Robinia Pseudacacia tonic?<\/h4><p class=\"saswp-faq-answer-text\">The benefits of Robinia Pseudacacia tonic include alleviating hyperacidity and heartburn, improving digestion, relieving gastric headaches, promoting healing of minor burns, and reducing bleeding gums. It may also help with psychological issues related to digestive discomfort.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Robinia Pseudacacia homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Robinia Pseudacacia homeopathic medicine is used to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns. It may also address psychological symptoms linked to digestive problems.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you use Robinia Pseudacacia mother tincture?<\/h4><p class=\"saswp-faq-answer-text\">To use Robinia Pseudacacia mother tincture, dilute 5-10 drops in a glass of water and take it 2-3 times a day, or as directed by a healthcare professional. It is best to take it 15-30 minutes before or after meals for optimal absorption.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Robinia Pseudacacia? Robinia pseudoacacia is also famously known as a black locust in its native territory. It is a medium-sized hardwood deciduous tree. Robinia Pseudacacia belongs to the tribe Robinieae of the legume family Fabaceae. The roots of Robinia Pseudacacia contain nodules that allow the plant to fix nitrogen, as is common within the pea family. The trees of Robinia pseudoacacia reach a general height of 12–30 meters, which is 40–100 feet, with a diameter of 0.61 &#8211; 1.22 m or 2– 4 ft. Robinia Pseudacacia Chemical Constituents Black locust or Robinia Pseudacacia leaves contain the chemical compounds <\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-2232","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Robinia Pseudacacia - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Robinia Pseudacacia Homeopathic Uses to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Robinia Pseudacacia - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Robinia Pseudacacia Homeopathic Uses to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-10-05T14:35:17+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-10-05T14:36:11+00:00\" \/>\n<meta name=\"author\" content=\"Dheeraj Sharma\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dheeraj Sharma\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"7 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Robinia Pseudacacia - Uses, Dosage, Side Effects, Composition And More","description":"Robinia Pseudacacia Homeopathic Uses to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses","og_locale":"en_US","og_type":"article","og_title":"Robinia Pseudacacia - Uses, Dosage, Side Effects, Composition And More","og_description":"Robinia Pseudacacia Homeopathic Uses to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns.","og_url":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-10-05T14:35:17+00:00","article_modified_time":"2024-10-05T14:36:11+00:00","author":"Dheeraj Sharma","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Dheeraj Sharma","Est. reading time":"7 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses"},"author":{"name":"Dheeraj Sharma","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3"},"headline":"Robinia Pseudacacia &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-10-05T14:35:17+00:00","dateModified":"2024-10-05T14:36:11+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses"},"wordCount":1580,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses","url":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses","name":"Robinia Pseudacacia - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-10-05T14:35:17+00:00","dateModified":"2024-10-05T14:36:11+00:00","description":"Robinia Pseudacacia Homeopathic Uses to treat hyperacidity, heartburn, indigestion, gastric headaches, bleeding gums, and minor burns.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/robinia-pseudacacia-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Robinia Pseudacacia &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3","name":"Dheeraj Sharma","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","caption":"Dheeraj Sharma"},"description":"Dr. Dheeraj Sharma stands as a distinguished figure in the field of homoeopathy and is renowned for his innovative approach and steadfast commitment to excellence. Dr. Sharma has established himself as a leader in healthcare, blending traditional healing techniques with modern medical advancements to deliver holistic and patient-centered care. His dedication to improving patient outcomes and pushing the boundaries of healthcare has earned him widespread recognition and admiration in the field.","sameAs":["https:\/\/weclinic.in\/dr-dheeraj-sharma.php","https:\/\/www.linkedin.com\/in\/dr-dheeraj-sharma-35a93821b"],"url":"https:\/\/weclinic.in\/blog\/author\/dheeraj_sharma"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2232","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=2232"}],"version-history":[{"count":11,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2232\/revisions"}],"predecessor-version":[{"id":3177,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2232\/revisions\/3177"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=2232"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=2232"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=2232"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}