{"id":2378,"date":"2024-11-03T10:46:34","date_gmt":"2024-11-03T10:46:34","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=2378"},"modified":"2024-11-03T10:47:42","modified_gmt":"2024-11-03T10:47:42","slug":"yohimbinum-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/yohimbinum-uses","title":{"rendered":"Yohimbinum &#8211; Uses, Dosage, Side Effects, Composition And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Yohimbinum?<\/h2>\n\n\n\n<p>Yohimbinum is a homeopathic preparation of the drug yohimbine obtained from the bark of the tree known as Pausinystalia yohimbe. Its compound, yohimbine, is particularly used in managing erectile dysfunction and the nervous system. <\/p>\n\n\n\n<p>This remedy is mainly prescribed for males who have erectile dysfunction and where the problem is usually compounded by psychological factors such as anxiety or stress. Apart from enhancing sexual activity, Yohimbinum might also benefit in absent-mindedness and physical restlessness. It can also help to help circulation and ease the signs of heat in the body. <\/p>\n\n\n\n<p>It is recommended that those who require this remedy tend to feel emotional and sensitive as well as warm or congested. Although it is generally regarded as safe, Yohimbinum should only be taken under supervision to eliminate the possibility of side effects or contraindications with other substances.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Yohimbinum Chemical Constituents<\/h2>\n\n\n\n<p>Yohimbinum contains several important chemical constituents primarily classified as alkaloids. The main active compound is yohimbine, which constitutes about 10% to 15% of the total alkaloid content in authentic Yohimbe bark.<\/p>\n\n\n\n<p><strong>Key Chemical Constituents<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Yohimbine:<\/strong> The primary alkaloid known for its effects on sexual function and as an alpha-2 adrenergic receptor antagonist.<\/li>\n\n\n\n<li><strong>Other Alkaloids:<\/strong> Other alkaloids include corynantheidine, yohimbine beta, yohimbine pseudo, rauwolscine, and coryanthine. All of these compounds affect the pharmacological actions of yohimbine.<\/li>\n\n\n\n<li><strong>Total Alkaloids:<\/strong> Pure yohimbe bark can contain 0.4 &#8211; 6% of total alkaloids, of which yohimbine is the most substantial.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Yohimbinum Preparation<\/h2>\n\n\n\n<p>Yohimbinum, primarily known for its active ingredient, yohimbine, is prepared through a detailed extraction process from the bark of the Pausinystalia yohimbe tree. The preparation method generally involves the following steps:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Crushing the Bark:<\/strong> The raw yohimbe bark is initially reduced into very small particles to enhance the surface area and improve extraction yields.<\/li>\n\n\n\n<li><strong>Extraction with Ethanol: <\/strong>The crushed bark is refluxed with ethanol (generally 80 to 90%) in the specific mass ratio of 5 to 6: 1 to extract the alkaloids. It makes it easier to dissolve the active compounds in a system undergoing this process.<\/li>\n\n\n\n<li><strong>Precipitation:<\/strong> Subsequently, water is added to the concentrated solution, and the alkaloids precipitate. The solid precipitate is then separated from the liquid by filtration techniques commonly used in the laboratory.<\/li>\n\n\n\n<li><strong>Acid Treatment:<\/strong> The precipitate is then refluxed several times with aqueous acids, such as hydrochloric or citric acid, to clean the yohimbine further. One boiling session generally takes about 1.5 hours.<\/li>\n\n\n\n<li><strong>Filtration and Concentration:<\/strong> This treatment produces a filtrate that is then concentrated to extract the substance&#8217;s active ingredients.<\/li>\n\n\n\n<li><strong>Purification Using Resin: <\/strong>The saturated solution may be filtered through the macroporous resin to purify yohimbine further and reduce the content of impurities.<\/li>\n\n\n\n<li><strong>Crystallization:<\/strong> Last, after the extract is purified, the substance forms crystals with the help of such solvents as ethyl acetate, and the substance yield is over 98% of yohimbine.<\/li>\n<\/ul>\n\n\n\n<p>This meticulous preparation process ensures that Yohimbinum retains its medicinal properties while minimizing impurities, making it suitable for various therapeutic applications.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Yohimbinum Mother Tincture<\/h2>\n\n\n\n<p>The process of making Yohimbinum mother tincture in homeopathy involves extracting the active compounds from the Yohimbe tree bark and preparing them in a solution. Here’s a simplified overview of the process:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Collection:<\/strong> The finest Yohimbe tree barks are collected gently, mostly from mature trees, because they provide the best alkaline.<\/li>\n\n\n\n<li><strong>Cleaning and Drying: <\/strong>The bark is washed to eliminate unwanted materials and sun-dried to eliminate wetness.<\/li>\n\n\n\n<li><strong>Grinding: <\/strong>The bark is dried before it’s ground into a fine powder, which ensures that as much surface area as possible is vacated in the extraction process.<\/li>\n\n\n\n<li><strong>Maceration:<\/strong> The powdered bark is dissolved in an alcohol-water solution. This solution, typically a 1:10 ratio, in which each part of the bark is mixed with ten parts of the solution, is called the maceration phase, during which the active ingredients dissolve into the liquid.<\/li>\n\n\n\n<li><strong>Filtration:<\/strong> After several weeks of maceration, the mass is filtered, and what remains is a rather thick extract of the drug in spirits called tincture.<\/li>\n\n\n\n<li><strong>Quality Testing:<\/strong> The final tincture undergoes some tests to determine its purity, strength, and quality before it is packed into bottles for use.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Yohimbinum<\/h2>\n\n\n\n<p>Yohimbinum is primarily known for its effects on sexual health and the central nervous system. Here are some of the key benefits associated with Yohimbinum:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Improves Sexual Function:<\/strong> Yohimbinum is the most popular of all the drugs that are used to improve the level of sexual activity, especially in patients with <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-impotence-with-homeopathy\"   title=\"impotence\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1143\">impotence<\/a>. It improves blood circulation to the penis hence resulting in harder and lasting longer erections.<\/li>\n\n\n\n<li><strong>Aphrodisiac Properties:<\/strong> The cure on its own is known to have sexual enhancement properties as it helps in the arousal of sex. Indeed, it can be more advantageous for those people with low sexual drive or <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-ed-with-homeopathy\"   title=\"erectile dysfunction\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1290\">erectile dysfunction<\/a>.<\/li>\n\n\n\n<li><strong>Supports Circulation:<\/strong> Yohimbinum may help enhance the general blood flow around the body and relieve symptoms associated with congestion, specifically in the pelvic area.<\/li>\n\n\n\n<li><strong>Rels Agitation: <\/strong>This is useful for any person experiencing nervousness or stress. It relaxes the nervous tissue while elevating mood.<\/li>\n\n\n\n<li><strong>Addresses Congestive Conditions:<\/strong> They are useful in treating diseases such as menorrhagia, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-piles-with-homeopathy\"   title=\"hemorrhoids\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1141\">hemorrhoids<\/a>, and anything related to congestion.<\/li>\n\n\n\n<li><strong>Enhances Mood and Energy:<\/strong> It often provides more energy and a better mood so that it can help people with emotional stress or fatigue.<\/li>\n\n\n\n<li><strong>Potential <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-homeopathy-can-help-with-weight-loss\"   title=\"Weight Loss\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1142\">Weight Loss<\/a> Aid:<\/strong> Several sources show that yohimbine has the potential to aid fat reduction by raising metabolic activity and the rate of lipolysis, although limited research exists on this topic.<\/li>\n\n\n\n<li><strong>Holistic Approach:<\/strong> Yohimbinum is employed in homeopathy to treat not only the physical but also the emotional system, making it a complementary cure for most ailments.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Yohimbinum Treat?<\/h2>\n\n\n\n<p>Yohimbinum is primarily used to treat various conditions related to sexual health and emotional well-being. Here are some specific uses of Yohimbinum:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Erectile Dysfunction:<\/strong> Yohimbinum is used frequently for impotence and in cases originating from psychological problems or due to neurasthenia.<\/li>\n\n\n\n<li><strong>Sexual Stimulation:<\/strong> It works as an erectile tissue, increasing users’ desire for sex, and is useful for those users who experience low desire for sex.<\/li>\n\n\n\n<li><strong>Congestive Conditions:<\/strong> It works well where there is congestion in the pelvic area, and the remedy can be used to manage ailments like bleed­ing piles (hemorrhoids) and menorrhagia.<\/li>\n\n\n\n<li><strong>Nervous Agitation:<\/strong> It assists in soothing signs of nervous fatigue and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1277\">anxiety<\/a> and actually has a quieting impact on the central nervous system.<\/li>\n\n\n\n<li><strong>Circulatory Issues:<\/strong> Yohimbinum may help where pathological blood circulation is involved, especially in the hyperemia of the sexual organs.<\/li>\n\n\n\n<li><strong>Lactation Support:<\/strong> It has been reported to cause galactorrhea in nursing mothers, that is, secretions of breast milk.<\/li>\n\n\n\n<li><strong>Weight Management:<\/strong> Research shows that yohimbine may enhance fat loss by upregulating metabolic rate; however, this has not been well substantiated in other research studies.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Yohimbinum Homeopathy Uses<\/h2>\n\n\n\n<p>Yohimbinum is widely used in homeopathy for its potential effects on the circulatory, nervous, and reproductive systems. Here’s a detailed look at its key uses in homeopathic medicine:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Male Health and Vitality: <\/strong>Yohimbinum is often used as a natural remedy for conditions affecting male reproductive health. It is thought to help with low vitality, especially in cases where lack of energy affects physical performance. The tincture may help stimulate energy and blood flow, which could support the body’s natural response in this area.<\/li>\n\n\n\n<li><strong>Circulatory Health:<\/strong> Yohimbinum is believed to help improve circulation, which may be beneficial for people experiencing poor blood flow, particularly in the extremities like hands and feet. It’s sometimes recommended for individuals who experience symptoms like <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-cold-with-homeopathy\"   title=\"cold\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2420\">cold<\/a> limbs due to low blood circulation. This effect on blood flow also extends to the reproductive organs, where improved circulation can be beneficial.<\/li>\n\n\n\n<li><strong>Nervous System Support and Exhaustion:<\/strong> Homeopathic practitioners can prescribe this remedy for physical and mental fatigue. It is usually advised to be taken when one feels exhausted, whether from work or from getting tired in one&#8217;s mind. Because Yohimbinum can stimulate the nervous system, it is therefore useful for increasing energy.<\/li>\n\n\n\n<li><strong>Mood and Energy Boost:<\/strong> Yohimbinum as an agent is sometimes prescribed to stimulate a slightly uplifting mood. In those who are sad or apathetic, it may cause an upturn in energy and mood. However, this effect is mostly mild. However, it is recommended for use in mild cases rather than in a charged mood disorder.<\/li>\n\n\n\n<li><strong>Respiratory Support:<\/strong> The effects on circulation may also seem to impact respiratory disease in the long run positively. Increased circulation can help deliver oxygen to tissues or could sometimes at least help those with mild respiratory issues feel more lively.<\/li>\n\n\n\n<li><strong>Heart and Cardiovascular Support:<\/strong> Yohimbinum has the potential to enhance circulation and, in turn, it can be considered to affect the cardiovascular system in some ways positively. In patients with mild cardiovascular disorders with regard to low blood circulation, some benefits might be derived from the Yohimbinum in improving blood movement as well as encouraging the normal functioning of the heart, though its use should be under medical prescription.<\/li>\n\n\n\n<li><strong>Restlessness and Anxiety:<\/strong> Some people only experience slight anxiety or some level of restlessness, and Yohimbinum in low doses can alleviate this problem. The remedy may calm down nervous tension in patients with mild anxiousness; however, the effect can be different each time.<\/li>\n\n\n\n<li><strong>Low <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"Blood Pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1144\">Blood Pressure<\/a>:<\/strong> Yohimbinum is sometimes prescribed for patients with hypotension (low blood pressure) since this substance can elevate blood pressure owing to enhanced blood circulation. However, this should be done cautiously because the application of hormones has a stimulating impact on heart activity in the case of incorrect dosage.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Yohimbinum Dosage<\/h2>\n\n\n\n<p>The dosage of Yohimbinum in homeopathy depends on individual needs, health conditions, and the form in which it is used. Here are general guidelines, but it&#8217;s essential to consult a qualified homeopathic practitioner for personalized advice, as Yohimbinum can have strong effects:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother Tincture (Q):<\/strong> Typically, 10-15 drops of Yohimbinum mother tincture in water are taken once or twice daily. This form is concentrated and should be used with caution.<\/li>\n\n\n\n<li><strong>Low Potencies (e.g., 3X, 6X):<\/strong> These potencies are sometimes used for mild cases and can be taken as 2-3 drops or pellets 2-3 times per day. This dosage is usually safe for short-term use under guidance.<\/li>\n\n\n\n<li><strong>Higher Potencies (e.g., 30C, 200C):<\/strong> Higher potencies are generally used for more specific cases and should be administered less frequently (e.g., once weekly) to avoid overstimulation. Higher potencies are usually reserved for cases requiring more significant stimulation of the body’s response.<\/li>\n\n\n\n<li><strong>Dosage Duration:<\/strong> For acute cases, short-term use (days to weeks) may be recommended. Chronic conditions may require a longer duration but with more controlled dosing.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Yohimbinum Dosage For Adults<\/h3>\n\n\n\n<p>In homeopathy, adults&#8217; main dose of Yohimbinum can be as follows, but it is advisable to be taken under some prescription. The usual dosage of the preparation as a first aid is 10-15 drops of the mother tincture (Q) in water, 1 or 2 times a day. Low potencies like 3X or 6X can be used either in the form of drops and pellets, 2-3 drops or 2-3 pellets of the selected potency, 2-3 times a day. <\/p>\n\n\n\n<p>In more serious conditions, you would be prescribed, for example, 30C or 200C, which are taken less often than regular potencies, maybe once a week, to avoid overstimulation. This means that for some acute conditions, lesser amounts are probably more innocuous, whereas for long-term states of illness, the treatment is often going to take more time and will have to be controlled much more. Overuse may, however, cause side effects such as high heart rate and dizziness, therefore requiring constant checks.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Yohimbinum Dosage For Children<\/h3>\n\n\n\n<p>In children, Yohimbinum should be used especially carefully and only under the direction of a homeopathic therapist, as the substance has very powerful actions. <\/p>\n\n\n\n<p>In general, low potencies, such as 3X or 6X, should be used in minuscule doses like 1-2 drops or pellets, one or two times a day, depending on the child’s age and state. Even third decimal potencies like 30C are not advised to be mostly administered to a child, and if administered, they are given in the least amount possible once a week only. <\/p>\n\n\n\n<p>Concentrated mother tincture has the quality mark of Q and is not recommended for use in children. Due to possible side effects, children should be observed, and use of the product should cease if restlessness, rapid heartbeat, or dizziness occurs.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Yohimbinum?<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>People with Heart Issues:<\/strong> Those with high blood pressure, heart disease, or arrhythmias, as Yohimbinum can increase heart rate and blood pressure.<\/li>\n\n\n\n<li><strong>Individuals with Anxiety or Mood Disorders:<\/strong> Yohimbinum can cause anxiety, restlessness, and mood swings, which may worsen these conditions.<\/li>\n\n\n\n<li><strong>Children and Pregnant or Nursing Women:<\/strong> Safety has not been established for these groups, so it is best to avoid them.<\/li>\n\n\n\n<li><strong>Individuals on Medications:<\/strong> Those taking antidepressants, blood pressure medication, or stimulants, such as Yohimbinum, may interact negatively.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Side Effects And Risks Of Using Yohimbinum<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Increased Heart Rate and Blood Pressure:<\/strong> Yohimbinum stimulates the nervous system, with the possible side effects of nervous palpitation and high blood pressure.<\/li>\n\n\n\n<li><strong>Dizziness and Headaches:<\/strong> These are widespread, especially when one begins or takes a higher dose of a substance containing caffeine.<\/li>\n\n\n\n<li><strong>Anxiety and Restlessness:<\/strong> Some may develop an increased rate of anxiety, agitation, or mood changes.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"Nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1852\">Nausea<\/a> and Gastrointestinal Issues:<\/strong> It may lead to conditions such as stomach upset, nausea, or stomach cramps.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>https:\/\/medsmedia.com\/yohimbinum-personality-in-homeopathy\/<\/li>\n\n\n\n<li>https:\/\/www.drugs.com\/npp\/yohimbe.html<\/li>\n\n\n\n<li>https:\/\/medicosage.com\/yohimbinum\/<\/li>\n\n\n\n<li>https:\/\/www.healthline.com\/nutrition\/yohimbe<\/li>\n\n\n\n<li>https:\/\/patents.google.com\/patent\/CN102030747A\/en<\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Yohimbinum safe?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum is generally safe in low, controlled doses under a practitioner’s guidance, but it can have side effects, especially at higher doses or if misused.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Yohimbinum homeopathic medicine used for?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum is primarily used for treating sexual dysfunction, including erectile dysfunction and low libido, as well as congestive conditions like menorrhagia and hemorrhoids.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How do you give Yohimbinum to babies?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum is typically not recommended for babies due to its potency and potential side effects.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Yohimbinum work?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum works by stimulating the central nervous system and increasing blood flow to the sexual organs, leading to improved sexual function and arousal.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Yohimbinum take to work?<\/h4><p class=\"saswp-faq-answer-text\">The effects of Yohimbinum can vary; some users may notice improvements within a few hours, while others might require several days of consistent use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Yohimbinum be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Yohimbinum can be taken daily at low doses under professional supervision, but prolonged use should be monitored.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Yohimbinum used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum is used to treat erectile dysfunction, low libido, and various congestive conditions such as heavy menstrual bleeding and hemorrhoids.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Yohimbinum used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, Yohimbinum is indicated for sexual dysfunctions, nervous agitation, and conditions characterized by congestion in the pelvic region.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of the Yohimbinum tonic?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum tonic may help boost energy, support circulation, and improve overall vitality.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Yohimbinum malt homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">Yohimbinum malt is typically formulated to enhance stamina, boost energy, and support general wellness.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Yohimbinum? Yohimbinum is a homeopathic preparation of the drug yohimbine obtained from the bark of the tree known as Pausinystalia yohimbe. Its compound, yohimbine, is particularly used in managing erectile dysfunction and the nervous system. This remedy is mainly prescribed for males who have erectile dysfunction and where the problem is usually compounded by psychological factors such as anxiety or stress. Apart from enhancing sexual activity, Yohimbinum might also benefit in absent-mindedness and physical restlessness. It can also help to help circulation and ease the signs of heat in the body. It is recommended that those who require <\/p>\n","protected":false},"author":4,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-2378","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Yohimbinum - Uses, Dosage, Side Effects, Composition And More<\/title>\n<meta name=\"description\" content=\"Yohimbinum Homeopathy Uses to treat erectile dysfunction, low libido, heavy menstrual bleeding and hemorrhoids.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/yohimbinum-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Yohimbinum - Uses, Dosage, Side Effects, Composition And More\" \/>\n<meta property=\"og:description\" content=\"Yohimbinum Homeopathy Uses to treat erectile dysfunction, low libido, heavy menstrual bleeding and hemorrhoids.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/yohimbinum-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-11-03T10:46:34+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-11-03T10:47:42+00:00\" \/>\n<meta name=\"author\" content=\"Dheeraj Sharma\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Dheeraj Sharma\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Yohimbinum - Uses, Dosage, Side Effects, Composition And More","description":"Yohimbinum Homeopathy Uses to treat erectile dysfunction, low libido, heavy menstrual bleeding and hemorrhoids.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/yohimbinum-uses","og_locale":"en_US","og_type":"article","og_title":"Yohimbinum - Uses, Dosage, Side Effects, Composition And More","og_description":"Yohimbinum Homeopathy Uses to treat erectile dysfunction, low libido, heavy menstrual bleeding and hemorrhoids.","og_url":"https:\/\/weclinic.in\/blog\/yohimbinum-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-11-03T10:46:34+00:00","article_modified_time":"2024-11-03T10:47:42+00:00","author":"Dheeraj Sharma","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Dheeraj Sharma","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses"},"author":{"name":"Dheeraj Sharma","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3"},"headline":"Yohimbinum &#8211; Uses, Dosage, Side Effects, Composition And More","datePublished":"2024-11-03T10:46:34+00:00","dateModified":"2024-11-03T10:47:42+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses"},"wordCount":2238,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses","url":"https:\/\/weclinic.in\/blog\/yohimbinum-uses","name":"Yohimbinum - Uses, Dosage, Side Effects, Composition And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-11-03T10:46:34+00:00","dateModified":"2024-11-03T10:47:42+00:00","description":"Yohimbinum Homeopathy Uses to treat erectile dysfunction, low libido, heavy menstrual bleeding and hemorrhoids.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/yohimbinum-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/yohimbinum-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Yohimbinum &#8211; Uses, Dosage, Side Effects, Composition And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/716a699ad661e8a4057e60c4b8047de3","name":"Dheeraj Sharma","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/7144f85db436eeeda9d9e8d476bfa8cf.jpg?ver=1751313075","caption":"Dheeraj Sharma"},"description":"Dr. Dheeraj Sharma stands as a distinguished figure in the field of homoeopathy and is renowned for his innovative approach and steadfast commitment to excellence. Dr. Sharma has established himself as a leader in healthcare, blending traditional healing techniques with modern medical advancements to deliver holistic and patient-centered care. His dedication to improving patient outcomes and pushing the boundaries of healthcare has earned him widespread recognition and admiration in the field.","sameAs":["https:\/\/weclinic.in\/dr-dheeraj-sharma.php","https:\/\/www.linkedin.com\/in\/dr-dheeraj-sharma-35a93821b"],"url":"https:\/\/weclinic.in\/blog\/author\/dheeraj_sharma"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2378","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/4"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=2378"}],"version-history":[{"count":8,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2378\/revisions"}],"predecessor-version":[{"id":3493,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2378\/revisions\/3493"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=2378"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=2378"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=2378"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}