{"id":2396,"date":"2024-11-03T15:46:28","date_gmt":"2024-11-03T15:46:28","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=2396"},"modified":"2024-11-03T16:00:28","modified_gmt":"2024-11-03T16:00:28","slug":"symphytum-officinale-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses","title":{"rendered":"Symphytum Officinale &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Symphytum Officinale?<\/h2>\n\n\n\n<p>Symphytum Officinale, commonly known as comfrey, has been used in herbal medicine for centuries. It is famous for helping with bone and tissue healing, which is why it is often called bone-knit. This plant grows in damp areas near rivers or streams, and it has large green leaves and purple or blue flowers. <\/p>\n\n\n\n<p>People have used Symphytum Officinale in different forms, like teas, creams, and tinctures, to treat a range of health issues. In modern times, it is mainly used in homeopathy and herbal medicine for external treatments, mainly for things like sprains, bruises, and broken bones. <\/p>\n\n\n\n<p>Although this plant has many benefits, it also contains some compounds that can be harmful if taken internally. That is why it is mostly applied to the skin rather than ingested.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Symphytum Officinale Chemical Constituents<\/h2>\n\n\n\n<p>Symphytum Officinale has many natural chemicals that give it its healing powers. The main compounds of Symphytum Officinale are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Allantoin:<\/strong> Allantoin is the healing ingredient in Symphytum Officinale. This is the reason why comfrey has been used for centuries: to speed up the repair of damaged skin and tissues. This compound helps cells regenerate more quickly, meaning cuts, bruises, and even broken bones. By promoting healthy tissue growth, it makes comfrey an effective natural remedy for various minor injuries and skin issues.<\/li>\n\n\n\n<li><strong>Rosmarinic Acid:<\/strong> It is a natural anti-inflammatory and antioxidant ingredient found in comfrey. This compound plays a main role in protecting cells from damage and reducing swelling. Comfrey can also help to soothe sore areas and reduce pain, making it a go-to for people who want relief from inflammation and discomfort in the skin and muscles.<\/li>\n\n\n\n<li><strong>Tannins:<\/strong> Comfrey can tighten and firm up tissues, making it useful for treating cuts and wounds. It helps to close up small injuries and stop minor bleeding. Tannins create a protective layer over the wound, helping it heal while reducing the risk of further damage.<\/li>\n\n\n\n<li><strong>Pyrrolizidine Alkaloids (PAs):<\/strong> They are complex compounds that can be toxic if ingested or used in high amounts for long periods. These chemicals can be harmful to the liver, which is why it is generally recommended to use comfrey only on the skin and avoid internal consumption. Using comfrey in small amounts and only topically can provide healing benefits without the risk of toxicity from PAs.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Symphytum Officinale Preparation<\/h2>\n\n\n\n<p>There are many ways to prepare Symphytum Officinale for use. It depends on what you need it for:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Teas and Infusions:<\/strong> Traditionally, people made comfrey tea by soaking the leaves or roots in hot water. Today, it’s less common because of potential risks from certain compounds like pyrrolizidine alkaloids. Some people still use it as a mouth rinse to soothe sore gums or teeth. If you are considering this, remember it is meant for rinsing, not swallowing.<\/li>\n\n\n\n<li><strong>Comfrey Paste:<\/strong> A poultice is like a homemade paste you make by crushing fresh comfrey leaves, wrapping them in a cloth, and applying it to sore areas. This is mainly useful for bruises, sprains, or swelling. The natural ingredients in comfrey can help reduce pain and swelling in these areas.<\/li>\n\n\n\n<li><strong>Tinctures:<\/strong> These are strong liquids made by soaking comfrey in alcohol or vinegar. This draws out the helpful ingredients and allows you to apply just a few drops to the skin. You can make your own or buy one in stores. Just remember that these are only for external use on the skin.<\/li>\n\n\n\n<li><strong>Creams and Ointments:<\/strong> Comfrey is also available in creams and ointments that make it easy to apply to sore muscles, joint pain, or mild skin irritations. These creams are one of the safest ways to use comfrey, as they can be directly applied to the skin.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Symphytum Officinale Mother Tincture<\/h2>\n\n\n\n<p>A mother tincture is the purest form of an herbal extract, made by soaking a plant in alcohol or another solvent. The Symphytum Officinale mother tincture is prepared by taking the fresh or dried leaves and roots of the comfrey plant and letting them sit in alcohol for a few weeks. This process extracts the active compounds from the plant, making them easier to use and apply. <\/p>\n\n\n\n<p>The mother tincture is very concentrated, so it’s often diluted before being used. In homeopathy, small amounts of this tincture are used to make other remedies. The Symphytum Officinale mother tincture is mainly used for external purposes, like treating bruises, strains, or muscle pain. Applying the tincture directly to the skin can help speed up the healing process, thanks to the powerful ingredients that are concentrated in the liquid. <\/p>\n\n\n\n<p>However, it&#8217;s important to care for the mother tincture. Because it’s so strong, it should never be ingested without professional advice. Many people find that using the tincture topically by applying it to the skin is the safest and most effective way to enjoy the benefits of Symphytum Officinale.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Symphytum Officinale<\/h2>\n\n\n\n<p>Symphytum Officinale offers a range of benefits, especially when it comes to healing and recovery. Here are some of the main benefits of using this plant:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Bone Healing:<\/strong> One of the most well-known benefits of comfrey is its ability to help bones heal faster. This is why it’s sometimes called “bone-knit.” It can be especially useful for minor fractures or broken bones when applied as a poultice or in a cream form.<\/li>\n\n\n\n<li><strong>Pain Relief:<\/strong> Symphytum Officinale can reduce pain in sore muscles and joints. Many people use it to soothe aches from arthritis, sprains, or other injuries. By reducing inflammation, comfrey helps ease discomfort naturally.<\/li>\n\n\n\n<li><strong>Skin Healing:<\/strong> The plant’s allantoin content promotes cell growth, which means it can help wounds, cuts, and bruises heal more quickly. It also helps reduce scarring, making it useful for minor burns or abrasions.<\/li>\n\n\n\n<li><strong>Anti-Inflammatory Properties:<\/strong> Comfrey’s natural chemicals can decrease inflammation and swelling, making it a popular choice for injuries that involve swelling, like sprains or twisted ankles.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Symphytum Officinale Treat?<\/h2>\n\n\n\n<p>Symphytum Officinale is a natural remedy used for various bone, skin, and muscle issues. It treats some common conditions given below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Fractures and Minor Broken Bones:<\/strong> Comfrey has properties that may encourage bone growth, making it useful for minor fractures. People believe it can help bones &#8220;knit&#8221; back together faster.<\/li>\n\n\n\n<li><strong>Sprains and Strains:<\/strong> Comfrey’s anti-inflammatory qualities make it a good choice for easing the swelling and pain of sprains or strains. Using a comfrey poultice or cream can help speed up recovery and bring relief from these injuries.<\/li>\n\n\n\n<li><strong>Bruises and Swelling:<\/strong> Comfrey can improve blood flow to the affected area, which helps reduce bruising and swelling. It is great for those black-and-blue marks or puffy injuries that need a little extra care.<\/li>\n\n\n\n<li><strong>Joint Pain Relief:<\/strong> People with joint pain use comfrey to soothe stiffness and pain. Comfrey can make moving around more comfortable and less painful.<\/li>\n\n\n\n<li><strong>Minor Cuts and Scrapes:<\/strong> Comfrey may help speed healing and reduce infection risk for small cuts and wounds. Its natural cell-repair properties support the skin in healing itself.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Symphytum Officinale Homeopathic Uses<\/h2>\n\n\n\n<p>Symphytum Officinale is used mainly for its healing properties related to bones and tissues. It’s majorly recommended for people who have fractures, sprains, or deep bruises. Homeopathic medicine uses very diluted amounts of Symphytum Officinale, which is believed to help stimulate the body’s natural healing process without the risk of toxicity. <\/p>\n\n\n\n<p>Some common uses of Symphytum Officinale in homeopathic practice are given below:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Helping Broken Bones Heal:<\/strong> Homeopathic practitioners sometimes recommend Symphytum Officinale to aid bone healing after a fracture. It’s often used alongside traditional methods like casts, with the goal of helping the bone knit together more quickly and comfortably.<\/li>\n\n\n\n<li><strong>Relieving Eye Injuries:<\/strong> For injuries near or around the eye, such as a black eye or strain, Symphytum Officinale may be suggested to help ease pain and reduce swelling. It’s a natural option that may gently support recovery in delicate areas like the eyes.<\/li>\n\n\n\n<li><strong>Easing Joint and Muscle Pain:<\/strong> Symphytum Officinale can be beneficial for joint and muscle pain, especially when the discomfort follows an injury or strain. People with arthritis or rheumatism sometimes find it useful for reducing stiffness and soreness.<\/li>\n\n\n\n<li><strong>Helping with Tooth and Gum Pain:<\/strong> This remedy is sometimes used for dental pain, particularly when it’s caused by recent surgery or an injury to the teeth. It may provide comfort during the healing process for tooth or gum issues.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Symphytum Officinale Dosage<\/h2>\n\n\n\n<p>The right dosage for Symphytum Officinale depends on factors like your age, health, and the form of the remedy you are using. Here is a simple guide to help you understand the general dosing for different types:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Creams or Ointments:<\/strong> Apply a small amount of Symphytum Officinale cream or ointment directly to the affected area about 2-3 times a day. This is commonly used for bruises, muscle pain, or minor skin cuts. Just a small amount is enough, and you can gently rub it in.<\/li>\n\n\n\n<li><strong>Homeopathic Tablets: <\/strong>The dosage for homeopathic tablets varies depending on the dilution (like 6X or 30X). Generally, these tablets are taken 2-3 times daily and dissolve under the tongue. They are typically used for short-term support, so follow any specific instructions on the label or from your homeopathic practitioner.<\/li>\n\n\n\n<li><strong>Tinctures:<\/strong> Tinctures are more concentrated, so you will only need a few drops at a time. These drops are often diluted in water before use. Since tinctures can be strong, it is best to follow the exact directions on the label or consult a healthcare provider.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Symphytum Officinale Dosage For Adults<\/h3>\n\n\n\n<p>It can be used in various forms for adults. Starting with a low dose is generally advised, and adjustments are made as needed. Here is a breakdown of typical dosages for each form:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Topical Applications:<\/strong> Adults can apply comfrey creams or ointments directly to the skin over the affected area about 2-3 times a day. This is ideal for temporary relief of bruises, sprains, or sore muscles. However, it is important not to use comfrey on broken skin or open wounds.<\/li>\n\n\n\n<li><strong>Homeopathic Tablets:<\/strong> A common dosage for adults is one 30C tablet, taken twice daily until symptoms improve. Homeopathic remedies are very diluted and considered safe for most adults, but it is best to follow the product instructions for the specific dilution.<\/li>\n\n\n\n<li><strong>Tinctures: <\/strong>Adults typically take 10-15 drops in a small amount of water, up to three times daily, for tinctures. Tinctures are strong, so it’s essential to follow recommended doses closely and consult a healthcare provider if you’re unsure.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Symphytum Officinale Dosage For Children<\/h3>\n\n\n\n<p>Children can also use Symphytum Officinale, but in small amounts only, and it is very important to consult with a healthcare provider first:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Topical use Only:<\/strong> Comfrey creams or ointments can be applied sparingly to children’s skin for short-term use, but only on unbroken skin.<\/li>\n\n\n\n<li><strong>Homeopathic Tablets:<\/strong> For children, a smaller dosage is often advised, such as a 6C or 12C potency tablet. Generally, one tablet is given once or twice a day, depending on the child’s age and symptoms.<\/li>\n\n\n\n<li><strong>Avoid Tinctures for Internal Use:<\/strong> Tinctures are generally not recommended for children due to their concentrated nature and the presence of alcohol.<\/li>\n\n\n\n<li>Children are more sensitive to herbal remedies, so it’s always best to check with a pediatrician or a homeopathic doctor before using Symphytum Officinale for a child.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Symphytum Officinale?<\/h2>\n\n\n\n<p>While Symphytum Officinale can be beneficial, it is not suitable for everyone. There are some risks and side effects to be aware of:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant and Breastfeeding Women:<\/strong> It contains compounds called pyrrolizidine alkaloids, which can be harmful to the liver. Pregnant and breastfeeding women should avoid using comfrey because compounds can transfer to the baby and potentially cause health issues.<\/li>\n\n\n\n<li><strong>People with Liver Conditions: <\/strong>Comfrey’s pyrrolizidine alkaloids can put additional stress on the liver, so anyone with liver issues should steer clear of it, especially for internal use. Even topical use should be done with caution.<\/li>\n\n\n\n<li><strong>Avoiding Use on Open Wounds:<\/strong> Although comfrey can be beneficial for bruises and sore muscles, it should not be applied to broken skin or open wounds. This can irritate or, in some cases, allow the compounds to enter the bloodstream, which could lead to complications.<\/li>\n\n\n\n<li><strong>Allergic Reactions: <\/strong>Some people may be sensitive to comfort and experience skin rashes, itching, or swelling. If you notice any of these symptoms, stop using it right away and seek medical advice.<\/li>\n\n\n\n<li><strong>Risks of Long-Term Use: <\/strong>Using comfrey over a long period, particularly internally, can lead to serious issues like liver damage or toxicity. This is due to the cumulative effect of pyrrolizidine alkaloids in the body. For this reason, it’s safest to limit comfrey use to short-term treatment and to use it only for specific, external purposes.<\/li>\n<\/ul>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li>https:\/\/pubmed.ncbi.nlm.nih.gov\/31105555\/<\/li>\n\n\n\n<li>https:\/\/pubmed.ncbi.nlm.nih.gov\/23224633\/<\/li>\n\n\n\n<li>https:\/\/pmc.ncbi.nlm.nih.gov\/articles\/PMC10020234\/<\/li>\n<\/ul>\n\n\n\n<p><strong>Faqs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homeopathic Symphytum Officinale safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, when used in diluted homeopathic doses, it is generally safe for most people. However, it’s best to consult a healthcare provider before use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Symphytum Officinale to babies?<\/h4><p class=\"saswp-faq-answer-text\">It’s best to avoid giving Symphytum Officinale to babies without medical advice. If recommended, only use diluted homeopathic forms and consult a pediatrician.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Symphytum Officinale work?<\/h4><p class=\"saswp-faq-answer-text\">Symphytum Officinale promotes cell growth and reduces inflammation, helping to speed up the healing of bones, muscles, and tissues.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Symphytum Officinale take to work?<\/h4><p class=\"saswp-faq-answer-text\">This can vary, but you might see relief within a few days to a week for minor injuries. Bone healing may take longer, depending on the severity.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Symphytum Officinale be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, it’s generally used for short-term treatment rather than daily long-term use. Always follow the guidance of a healthcare provider.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Symphytum Officinale used to treat?<\/h4><p class=\"saswp-faq-answer-text\">It’s commonly used to treat bone fractures, sprains, bruises, joint pain, and minor cuts, especially for external healing.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Symphytum Officinale used for in homeopathy?<\/h4><p class=\"saswp-faq-answer-text\">In homeopathy, it is used to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What are the benefits of Symphytum Officinale tonic?<\/h4><p class=\"saswp-faq-answer-text\">A Symphytum Officinale tonic might support bone health and aid in injury recovery, but due to potential risks, it should be used under professional advice.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is the use of Symphytum Officinale malt homeopathic medicine?<\/h4><p class=\"saswp-faq-answer-text\">This preparation may help with bone healing and general recovery, although it’s not as commonly used as other forms of the remedy.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What is Symphytum Officinale? Symphytum Officinale, commonly known as comfrey, has been used in herbal medicine for centuries. It is famous for helping with bone and tissue healing, which is why it is often called bone-knit. This plant grows in damp areas near rivers or streams, and it has large green leaves and purple or blue flowers. People have used Symphytum Officinale in different forms, like teas, creams, and tinctures, to treat a range of health issues. In modern times, it is mainly used in homeopathy and herbal medicine for external treatments, mainly for things like sprains, bruises, and broken <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-2396","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Symphytum Officinale - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Symphytum Officinale Homeopathic Uses to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Symphytum Officinale - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Symphytum Officinale Homeopathic Uses to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-11-03T15:46:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-11-03T16:00:28+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"10 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Symphytum Officinale - Uses, Dosage, Side Effects, Composition, And More","description":"Symphytum Officinale Homeopathic Uses to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses","og_locale":"en_US","og_type":"article","og_title":"Symphytum Officinale - Uses, Dosage, Side Effects, Composition, And More","og_description":"Symphytum Officinale Homeopathic Uses to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.","og_url":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-11-03T15:46:28+00:00","article_modified_time":"2024-11-03T16:00:28+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"10 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Symphytum Officinale &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-11-03T15:46:28+00:00","dateModified":"2024-11-03T16:00:28+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses"},"wordCount":2144,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses","url":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses","name":"Symphytum Officinale - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-11-03T15:46:28+00:00","dateModified":"2024-11-03T16:00:28+00:00","description":"Symphytum Officinale Homeopathic Uses to heal bones, treat eye injuries, relieve joint pain, and aid dental recovery.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/symphytum-officinale-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/symphytum-officinale-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Symphytum Officinale &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2396","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=2396"}],"version-history":[{"count":2,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2396\/revisions"}],"predecessor-version":[{"id":2399,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/2396\/revisions\/2399"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=2396"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=2396"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=2396"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}