{"id":561,"date":"2024-02-29T12:05:07","date_gmt":"2024-02-29T12:05:07","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=561"},"modified":"2024-05-12T18:07:12","modified_gmt":"2024-05-12T18:07:12","slug":"coca-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/coca-uses","title":{"rendered":"Coca &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What is Coca?<\/h2>\n\n\n\n<p>Coca is a plant native to South America, specifically in the Andes mountains. Indigenous peoples have used it for thousands of years for medicinal and cultural purposes. The plant contains alkaloids, including cocaine, which have psychoactive effects. However, in homoeopathy, Coca is used in highly diluted forms, making it safe and non-addictive.<\/p>\n\n\n\n<p>Coca, derived from the Erythroxylum coca plant, holds a significant place in traditional medicine and modern pharmacology. Its history intertwines cultural practices, medicinal applications, and controversies surrounding its psychoactive properties.<\/p>\n\n\n\n<p>Coca leaves are used to make homoeopathic remedies that treat various health conditions, such as altitude sickness, digestive problems, and mouth sores. The leaves are harvested, dried, and then prepared in a homoeopathic lab to create a tincture. This tincture is then diluted and succussed (shaken) to make the final homoeopathic remedy.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Coca Chemical Constituents<\/h2>\n\n\n\n<p>Coca&#8217;s therapeutic efficacy stems from its unique chemical composition, comprising a complex array of alkaloids, flavonoids, and other bioactive compounds. Among these constituents, the following stand out for their medicinal significance:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Cocaine:<\/strong> The most well-known alkaloid in Coca, cocaine exerts powerful stimulant and local anaesthetic effects. However, its potential for abuse and addiction has led to strict regulations and controlled use.<\/li>\n\n\n\n<li><strong>Hydrocyanine:<\/strong> This alkaloid has soothing properties.<\/li>\n\n\n\n<li><strong>Tropacocaine:<\/strong> This alkaloid has local anaesthetic properties similar to cocaine.<\/li>\n\n\n\n<li><strong>Ecgonine:<\/strong> A precursor to cocaine, ecgonine possesses similar stimulant and anaesthetic properties but with a reduced risk of abuse.<\/li>\n\n\n\n<li><strong>Benzoylecgonine: <\/strong>This alkaloid exhibits stimulant and euphoric effects, albeit milder than those of cocaine.<\/li>\n\n\n\n<li><strong>Cuscohygrine:<\/strong> A stimulant alkaloid with broncho-dilatory and antispasmodic properties, relieving respiratory ailments.<\/li>\n\n\n\n<li><strong>Hygrine:<\/strong> Another stimulant alkaloid, hygrine, contributes to Coca&#8217;s overall stimulating and invigorating effects.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Coca Preparation<\/h2>\n\n\n\n<p>Homoeopathic preparations of Coca utilise various parts of the plant, including its leaves, flowers, and seeds. These preparations undergo a meticulous process to extract their medicinal properties while minimising the presence of potentially harmful substances.<\/p>\n\n\n\n<p>Coca is prepared in a homoeopathic lab by following these steps:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Harvesting:<\/strong> The coca leaves are harvested at their peak potency, typically around the flowering stage.<\/li>\n\n\n\n<li><strong>Drying: <\/strong>The leaves are carefully dried to preserve their medicinal properties.<\/li>\n\n\n\n<li><strong>Maceration:<\/strong> The dried leaves are macerated (soaked) in alcohol and water. This process helps to extract the active compounds from the plant material.<\/li>\n\n\n\n<li><strong>Filtration:<\/strong> The macerated mixture is filtered to remove any solid plant material.<\/li>\n\n\n\n<li><strong>Dilution: <\/strong>The resulting liquid extract is diluted in steps according to the desired potency.<\/li>\n\n\n\n<li><strong>Succussion:<\/strong> The mixture is vigorously shaken or succeeded at each dilution stage. This process helps to activate the medicinal properties of the remedy further. <\/li>\n<\/ul>\n\n\n\n<p>The final remedy is available in different potencies, such as 6C, 12C, and 30C. The potency indicates the level of dilution and succussion.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Coca Mother Tincture<\/h2>\n\n\n\n<p>The mother tincture of Coca is the initial tincture created from the maceration of the leaves in alcohol. It is used as a starting point for the preparation of homoeopathic remedies. The mother tincture is further diluted and succeeded in creating the final remedy.<\/p>\n\n\n\n<p>The mother tincture of Coca is used for different types of diseases, such as:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Digestive problems:<\/strong> Coca can stimulate appetite and improve digestion.<\/li>\n\n\n\n<li><strong>Mouth sores:<\/strong> It can provide relief from pain and promote healing.<\/li>\n\n\n\n<li><strong>Altitude sickness:<\/strong> Coca can help alleviate symptoms such as headache, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1772\">nausea<\/a>, and shortness of breath.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits of Coca<\/h2>\n\n\n\n<p>Coca&#8217;s medicinal properties have been recognised for centuries, with homoeopathic preparations offering a range of therapeutic benefits:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Stimulant: <\/strong>Coca&#8217;s stimulant effects combat fatigue, enhance focus, and improve cognitive performance.<\/li>\n\n\n\n<li><strong>Anaesthetic:<\/strong> Its local anaesthetic properties relieve pain, particularly in the mouth, throat, and gastrointestinal tract.<\/li>\n\n\n\n<li><strong>Digestive Aid:<\/strong> Coca&#8217;s stimulating effect on the digestive system aids in digestion and alleviates symptoms of <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-indigestion-with-homeopathy\"   title=\"indigestion\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1542\">indigestion<\/a> and flatulence.<\/li>\n\n\n\n<li><strong>Respiratory Support:<\/strong> Coca&#8217;s bronchodilatory and antispasmodic properties help relieve respiratory ailments such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-asthma-with-homeopathy\"   title=\"asthma\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"849\">asthma<\/a> and bronchitis.<\/li>\n\n\n\n<li><strong>Cardiotonic: <\/strong>Coca&#8217;s stimulant action on the heart strengthens its contractions, improving circulation and overall cardiovascular function.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What does Coca treat?<\/h2>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mouth Sores:<\/strong> Coca can treat canker sores and other <a href=\"https:\/\/weclinic.in\/blog\/how-to-treat-mouth-ulcers-with-homeopathy\">mouth ulcers<\/a>, relieving pain and accelerating healing.<\/li>\n\n\n\n<li><strong>Altitude Sickness:<\/strong> Coca can alleviate symptoms of altitude sickness, such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1985\">headache<\/a>, nausea, and shortness of breath.<\/li>\n\n\n\n<li><strong>Pain: <\/strong>Coca can provide relief from pain, such as headaches and menstrual cramps, due to its analgesic properties.<\/li>\n\n\n\n<li><strong>Mental Health:<\/strong> Coca&#8217;s mood-elevating effects combat depression and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1199\">anxiety<\/a>, promoting a sense of well-being.<\/li>\n\n\n\n<li><strong>Energy and Vitality:<\/strong> Coca&#8217;s stimulant properties counteract fatigue, restoring energy levels and vitality.<\/li>\n\n\n\n<li><strong>Digestive Disorders:<\/strong> Coca alleviates indigestion, flatulence, and other digestive problems, promoting healthy digestion and reducing discomfort.<\/li>\n\n\n\n<li><strong>Respiratory Conditions:<\/strong> Coca&#8217;s bronchodilatory and antispasmodic properties provide relief from asthma, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-bronchitis-with-homeopathy\"   title=\"bronchitis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2043\">bronchitis<\/a>, and other respiratory ailments, improving breathing and reducing inflammation.<\/li>\n\n\n\n<li><strong>Cardiovascular Health:<\/strong> Coca&#8217;s cardiotonic effects strengthen heart contractions, improving circulation and overall cardiovascular health.<\/li>\n\n\n\n<li><strong>Skin Conditions:<\/strong> Coca&#8217;s anti-inflammatory and healing properties help soothe eczema, <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-psoriasis-with-homeopathy\"   title=\"psoriasis\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"156\">psoriasis<\/a>, and other skin irritations, promoting healthy skin and reducing inflammation.<\/li>\n\n\n\n<li><strong>Eye Conditions:<\/strong> Coca extracts have been used traditionally to treat eye infections and inflammation, improving eye health and reducing discomfort.<\/li>\n\n\n\n<li><strong>Appetite Stimulation:<\/strong> Coca stimulates the appetite, making it beneficial for individuals with poor appetite or undergoing recovery.<\/li>\n\n\n\n<li><strong>Cognitive Function:<\/strong> Coca&#8217;s stimulant properties improve focus, concentration, and memory, enhancing mental clarity and performance.<\/li>\n\n\n\n<li><strong>Athletic Performance:<\/strong> Coca&#8217;s energising effects enhance endurance and athletic performance, making it a popular supplement among athletes.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Coca Homeopathic Uses<\/h2>\n\n\n\n<p>Coca&#8217;s versatility extends beyond its medicinal applications:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Traditional Medicine:<\/strong> Indigenous populations in South America have traditionally used coca leaves for their stimulant, medicinal, and ceremonial properties.<\/li>\n\n\n\n<li><strong>Culinary Applications:<\/strong> Coca leaves are incorporated into various culinary preparations, such as teas, beverages, and traditional dishes.<\/li>\n\n\n\n<li><strong>Local Anaesthetic:<\/strong> Coca extracts have been used as a local anaesthetic in dentistry and ophthalmology, particularly in the past.<\/li>\n\n\n\n<li><strong>Recreational Use:<\/strong> Coca leaves have been chewed or brewed into a tea for their stimulating and euphoric effects. However, this use is illegal in most countries due to the potential for abuse and addiction.<\/li>\n\n\n\n<li><strong>Traditional Medicine:<\/strong>\n<ul class=\"wp-block-list\">\n<li>In traditional homoeopathic medicine, coca leaves are revered for their medicinal and spiritual properties.<\/li>\n\n\n\n<li>Coca leaves are chewed to combat fatigue, enhance endurance, and alleviate altitude sickness.<\/li>\n\n\n\n<li>Coca tea is consumed to relieve digestive problems, headaches, and menstrual pain.<\/li>\n\n\n\n<li>Coca leaves are also used in traditional ceremonies and rituals to connect with the divine and promote spiritual healing.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Culinary Applications:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Coca leaves are used in various culinary preparations, particularly in South American cuisine.<\/li>\n\n\n\n<li>Coca-tea is a popular beverage, often consumed for its stimulating and refreshing effects.<\/li>\n\n\n\n<li>Coca leaves are also used to flavour dishes such as soups, stews, and sauces.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Local Anaesthetic:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Coca extracts have been used as a local anaesthetic in dentistry and ophthalmology due to their numbing properties.<\/li>\n\n\n\n<li>Coca alkaloids, such as cocaine, have been isolated and used in modern medicine as local anaesthetics.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<p><strong>Coca Dosage<\/strong><\/p>\n\n\n\n<p>Coca is available in various forms and potencies, including tinctures, tablets, and pellets. A qualified healthcare practitioner should determine The potency and dosage based on the individual&#8217;s needs and the condition being treated.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Tinctures:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Tinctures are typically taken in drops, mixed with water or a beverage, and sipped slowly.<\/li>\n\n\n\n<li>The recommended dosage may vary from a few drops to a teaspoon, depending on the potency and the individual&#8217;s needs.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Tablets and Pellets:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Tablets and pellets are usually taken sublingually, allowing them to dissolve under the tongue.<\/li>\n\n\n\n<li>The recommended dosage may vary from one to several tablets or pellets, depending on the potency and the individual&#8217;s needs.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Potencies:<\/strong>\n<ul class=\"wp-block-list\">\n<li>Potencies refer to the level of dilution and succussion.<\/li>\n\n\n\n<li>Lower potencies (6C, 12C) may be more appropriate for acute conditions, while higher potencies (30C, 200C) may be more suitable for chronic conditions.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Frequency:<\/strong>\n<ul class=\"wp-block-list\">\n<li>The dosage frequency may vary depending on the individual&#8217;s needs and the condition being treated.<\/li>\n\n\n\n<li>Acute conditions may require more frequent doses, while chronic conditions may require less frequent doses.<\/li>\n\n\n\n<li>The dosage of Coca depends on the form of medication and the type of disease. Here are some general guidelines:<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Tea:<\/strong> Steep 1-2 teaspoons of dried coca leaves in hot water for 5-10 minutes. Drink 1-2 cups per day.<\/li>\n\n\n\n<li><strong>Chewing:<\/strong> Chew a small amount of dried coca leaves slowly for 20-30 minutes. Do not swallow the leaves.<\/li>\n<\/ul>\n\n\n\n<p><strong>Dosage for Adults<\/strong><\/p>\n\n\n\n<p>Adults may be prescribed a dosage of 3-12 drops of the mother tincture, diluted in a small amount of water, two to three times daily.<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Tea:<\/strong> Drink 1-2 cups per day.<\/li>\n\n\n\n<li><strong>Chewing:<\/strong> Chew a small amount of dried coca leaves slowly for 20-30 minutes.<\/li>\n<\/ul>\n\n\n\n<p><strong>Dosage for Children<\/strong><\/p>\n\n\n\n<p>The dosage for children is as follows:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Tea:<\/strong> Steep 1 teaspoon of dried coca leaves in hot water for 5-10 minutes. Give 1\/2-1 cup per day.<\/li>\n\n\n\n<li><strong>Chewing:<\/strong> Not recommended for children.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Who should avoid Coca?<\/h2>\n\n\n\n<p>While generally safe for most individuals, specific groups should exercise caution when using Coca:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pregnant and Nursing Women:<\/strong> Due to the potential for adverse effects on foetal development and infant health, Coca is not recommended for pregnant or nursing women.<\/li>\n\n\n\n<li><strong>Individuals with Heart Conditions:<\/strong> Coca&#8217;s stimulant effects may exacerbate existing heart conditions, making it inadvisable for individuals with known cardiovascular issues.<\/li>\n\n\n\n<li><strong>People with High <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"Blood Pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"117\">Blood Pressure<\/a>:<\/strong> Coca&#8217;s stimulant properties can elevate blood pressure, posing a risk for individuals with hypertension.<\/li>\n\n\n\n<li><strong>Anxiety:<\/strong> Coca&#8217;s stimulant effects can aggravate anxiety symptoms in susceptible individuals.<\/li>\n\n\n\n<li><strong>Headache:<\/strong> Coca can cause headaches, especially when taken in high doses.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-insomnia-with-homeopathy\"   title=\"Insomnia\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"16\">Insomnia<\/a>: <\/strong>Coca&#8217;s stimulant properties can interfere with sleep, leading to insomnia.<\/li>\n\n\n\n<li><strong>Skin Reactions:<\/strong> Coca can cause skin reactions, such as rashes and itching, in some individuals.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What are the Side Effects and Risks of using of Coca?<\/h2>\n\n\n\n<p>The side effects of Coca include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Nausea:<\/strong> Coca can cause nausea, especially when taken in high doses or on an empty stomach.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vomiting-with-homeopathy\"   title=\"Vomiting\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2139\">Vomiting<\/a>:<\/strong> Vomiting is another potential side effect of Coca, particularly when taken in high doses.<\/li>\n\n\n\n<li><strong>Diarrhoea:<\/strong> Coca can stimulate the bowels, leading to diarrhoea.<\/li>\n\n\n\n<li><strong>Dizziness:<\/strong> Coca can cause dizziness, especially when taken in high doses or by individuals sensitive to its effects.<\/li>\n\n\n\n<li><strong>Increased Heart Rate and Blood Pressure:<\/strong> Coca&#8217;s stimulant properties can increase heart rate and blood pressure. This can concern individuals with heart conditions or high blood pressure.<\/li>\n<\/ul>\n\n\n\n<p>The risks of using Coca include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Addiction:<\/strong> In its non-diluted form, Coca can be addictive.<\/li>\n\n\n\n<li><strong>Legal issues:<\/strong> In some countries, possession and use of Coca are illegal.<\/li>\n<\/ul>\n\n\n\n<p>It is essential to use the coca remedy under the guidance of a qualified <a href=\"https:\/\/weclinic.in\/\">healthcare practitioner<\/a>. Suppose you experience any adverse effects or have concerns about your use of Coca.<\/p>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<p>Coca: A Comprehensive Overview<br>Coca: A Medicinal Plant with a Chequered History<br>The Traditional Uses and Potential Health Benefits of Coca<\/p>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: disc\"><h4 class=\"\">Is homoeopathic Coca safe?<\/h4><p class=\"saswp-faq-answer-text\">Homoeopathic Coca is generally safe when used as directed by a qualified healthcare practitioner. However, individuals with certain health conditions should exercise caution.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Coca used for?<\/h4><p class=\"saswp-faq-answer-text\">Homoeopathic Coca is traditionally used to combat fatigue, enhance cognitive function, alleviate digestive Beschwerden, and relieve respiratory ailments.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How to give Coca to babies?<\/h4><p class=\"saswp-faq-answer-text\">Coca is not recommended for use in babies or young children. Please consult a healthcare professional for safe and effective treatment options for your child.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How does Coca work?<\/h4><p class=\"saswp-faq-answer-text\">Coca&#8217;s stimulant and anaesthetic properties contribute to its therapeutic effects. It enhances focus, reduces pain, and improves digestion.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">How long does Coca take to work?<\/h4><p class=\"saswp-faq-answer-text\">The onset of Coca&#8217;s effects can vary depending on the individual and the condition being treated. It is essential to follow the dosage and usage instructions a healthcare professional provides.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Can Coca be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">A qualified healthcare practitioner should determine the frequency of Coca intake. Daily use may be appropriate for some conditions, while others may require intermittent use.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">What is Coca used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Coca is commonly used to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Cocoa good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">Coca&#8217;s potential to alleviate digestive problems may provide some relief from acid reflux symptoms. However, it is essential to consult a healthcare professional for proper diagnosis and treatment.<\/p><li style=\"list-style-type: disc\"><h4 class=\"\">Is Coca safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">Coca is not recommended for use during pregnancy due to potential adverse effects on foetal development. Please consult a healthcare professional for safe and effective treatment options during pregnancy.<\/p><\/ul><\/div>\n\n\n<p><br><\/p>\n","protected":false},"excerpt":{"rendered":"<p>What is Coca? Coca is a plant native to South America, specifically in the Andes mountains. Indigenous peoples have used it for thousands of years for medicinal and cultural purposes. The plant contains alkaloids, including cocaine, which have psychoactive effects. However, in homoeopathy, Coca is used in highly diluted forms, making it safe and non-addictive. Coca, derived from the Erythroxylum coca plant, holds a significant place in traditional medicine and modern pharmacology. Its history intertwines cultural practices, medicinal applications, and controversies surrounding its psychoactive properties. Coca leaves are used to make homoeopathic remedies that treat various health conditions, such as <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-561","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Coca - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Coca Homeopathic Uses to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/coca-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Coca - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Coca Homeopathic Uses to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/coca-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-02-29T12:05:07+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-05-12T18:07:12+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Coca - Uses, Dosage, Side Effects, Composition, And More","description":"Coca Homeopathic Uses to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/coca-uses","og_locale":"en_US","og_type":"article","og_title":"Coca - Uses, Dosage, Side Effects, Composition, And More","og_description":"Coca Homeopathic Uses to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.","og_url":"https:\/\/weclinic.in\/blog\/coca-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-02-29T12:05:07+00:00","article_modified_time":"2024-05-12T18:07:12+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/coca-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/coca-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Coca &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-02-29T12:05:07+00:00","dateModified":"2024-05-12T18:07:12+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/coca-uses"},"wordCount":1729,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/coca-uses","url":"https:\/\/weclinic.in\/blog\/coca-uses","name":"Coca - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-02-29T12:05:07+00:00","dateModified":"2024-05-12T18:07:12+00:00","description":"Coca Homeopathic Uses to address fatigue, mental exhaustion, digestive problems, respiratory ailments, and cardiovascular issues.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/coca-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/coca-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/coca-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Coca &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/561","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=561"}],"version-history":[{"count":12,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/561\/revisions"}],"predecessor-version":[{"id":3272,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/561\/revisions\/3272"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=561"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=561"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=561"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}