{"id":693,"date":"2024-04-09T16:38:59","date_gmt":"2024-04-09T16:38:59","guid":{"rendered":"https:\/\/weclinic.in\/blog?p=693"},"modified":"2024-04-09T16:39:00","modified_gmt":"2024-04-09T16:39:00","slug":"aconitum-napellus-uses","status":"publish","type":"post","link":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses","title":{"rendered":"Aconitum Napellus &#8211; Uses, Dosage, Side Effects, Composition, And More"},"content":{"rendered":"\n<h2 class=\"wp-block-heading\">What Is Aconitum Napellus?<\/h2>\n\n\n\n<p>Aconitum napellus, commonly known as monkshood or wolfsbane, is a perennial, toxic herb that can be found throughout Europe, Asia, and North America. It is well-known for its beautiful blue-purple flowers and lance-shaped greenish-blue leaves. <\/p>\n\n\n\n<p>In homeopathy, Aconitum napellus is used as a medicine due to its various therapeutic properties. Aconitum napellus has been used in traditional medicine for centuries to treat a wide range of ailments. In traditional Chinese medicine, it is used to treat headaches, toothaches, and skin conditions. In traditional European medicine, it is used to treat fever, pain, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-anxiety-with-homeopathy\"   title=\"anxiety\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1209\">anxiety<\/a>.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Aconitum Napellus Chemical Constituents<\/h2>\n\n\n\n<p>Aconitum napellus contains a number of active compounds, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Aconitine: <\/strong>Aconitine is a potent alkaloid that is responsible for the plant&#8217;s toxicity. It has a number of effects on the body, including:\n<ul class=\"wp-block-list\">\n<li>Slowing the heart rate<\/li>\n\n\n\n<li>Lowering <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-blood-pressure-with-homeopathy\"   title=\"blood pressure\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"122\">blood pressure<\/a><\/li>\n\n\n\n<li>Relaxing muscles<\/li>\n\n\n\n<li>Stimulating the nervous system<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Mesaconitine: <\/strong>Mesaconitine is another alkaloid that is found in Aconitum napellus. It has similar effects to aconitine, but it is less potent.<\/li>\n\n\n\n<li><strong>Hypaconitine: <\/strong>Hypaconitine is a third alkaloid that is found in Aconitum napellus. It has similar effects to aconitine and mesaconitine, but it is even less potent.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aconitum Napellus Preparation<\/h2>\n\n\n\n<p>There are several ways to prepare Aconitum napellus for use in homeopathy, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother tincture:<\/strong> To prepare the mother tincture of Aconitum napellus, follow these steps:\n<ul class=\"wp-block-list\">\n<li>Clean and chop the leaves, flowers, and roots into small pieces.<\/li>\n\n\n\n<li>Place the plant material in a clean, sterile jar.<\/li>\n\n\n\n<li>Add enough water to fill the jar up to the level of the plant material.<\/li>\n\n\n\n<li>Cover the jar with a tight-fitting lid and leave it in a dark, cool place for 4-6 weeks.<\/li>\n\n\n\n<li>After 4-6 weeks, strain the solution through a cheesecloth or coffee filter into a new jar.<\/li>\n\n\n\n<li>Pour the liquid into a clean, sterile container.<\/li>\n\n\n\n<li>Let the mother tincture sit for another few days to allow any remaining impurities to settle to the bottom.<\/li>\n\n\n\n<li>Use the clear liquid at the top of the jar as the mother tincture. <\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Diluted solution: <\/strong>To prepare a diluted solution of Aconitum napellus, follow these steps:\n<ul class=\"wp-block-list\">\n<li>Measure out the desired amount of mother tincture.<\/li>\n\n\n\n<li>Add an equal amount of distilled water.<\/li>\n\n\n\n<li>Stir gently to mix.<\/li>\n\n\n\n<li>The resulting solution is ready to use.<\/li>\n<\/ul>\n<\/li>\n\n\n\n<li><strong>Herbal extract: <\/strong>To prepare the herbal extract of Aconitum napellus, follow these steps:\n<ul class=\"wp-block-list\">\n<li>Clean and chop the leaves, flowers, and roots into small pieces.<\/li>\n\n\n\n<li>Place the plant material in a clean, sterile jar.<\/li>\n\n\n\n<li>Add enough water to fill the jar up to the level of the plant material.<\/li>\n\n\n\n<li>Cover the jar with a tight-fitting lid and leave it in a dark, cool place for 4-6 weeks.<\/li>\n\n\n\n<li>After 4-6 weeks, strain the solution through a cheesecloth or coffee filter into a new jar.<\/li>\n\n\n\n<li>Pour the liquid into another clean, sterile container.<\/li>\n\n\n\n<li>Add a small amount of distilled water and stir gently.<\/li>\n\n\n\n<li>Let the herbal extract sit for another few days to allow any remaining impurities to settle to the bottom.<\/li>\n\n\n\n<li>Use the clear liquid at the top of the jar as the herbal extract.<\/li>\n<\/ul>\n<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aconitum Napellus Mother Tincture<\/h2>\n\n\n\n<p>The mother tincture of Aconitum napellus is prepared by diluting the plant&#8217;s extract in water to a potency of 1X. The mother tincture is then used to prepare further dilutions. Aconitum napellus mother tincture can be used to treat a wide range of conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Fever: <\/strong>Aconitum napellus mother tincture is commonly used to treat fevers, particularly in the early stages of an illness. It is believed that Aconitum napellus stimulates the immune system, which helps to reduce inflammation and lower body temperature.<\/li>\n\n\n\n<li><strong>Pain:<\/strong> Aconitum napellus mother tincture can help relieve pain, including headaches, muscle aches, and nerve pain. It is believed that Aconitum napellus works by numbing the affected area, which reduces pain and inflammation.<\/li>\n\n\n\n<li><strong>Anxiety:<\/strong> Aconitum napellus mother tincture can help to reduce anxiety and stress. It is believed that Aconitum napellus works by calming the mind and promoting relaxation.<\/li>\n\n\n\n<li><strong>Colds and flu: <\/strong>Aconitum napellus mother tincture can help to treat colds and flu symptoms, such as fever, chills, and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-headache-with-homeopathy\"   title=\"headache\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1994\">headache<\/a>. It is believed that Aconitum napellus stimulates the immune system, which helps to reduce inflammation and fight off viral infections.<\/li>\n\n\n\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-sore-throat-with-homeopathy\"   title=\"Sore throat\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2307\">Sore throat<\/a>:<\/strong> Aconitum napellus mother tincture can help to relieve sore throat pain and inflammation. It is believed that Aconitum napellus works by soothing the throat and reducing mucus production.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Benefits Of Aconitum Napellus<\/h2>\n\n\n\n<p>Aconitum napellus has several therapeutic benefits. Some of the benefits are:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Pain relief: <\/strong>It is used to provide relief from pain in various parts of the body.<\/li>\n\n\n\n<li><strong>Anti-inflammatory:<\/strong> Aconitum napellus has anti-inflammatory properties, making it useful in treating conditions such as arthritis.<\/li>\n\n\n\n<li><strong>Fever relief: It reduces<\/strong> fever and chill in the early stages of an illness.<\/li>\n\n\n\n<li><strong>Headache relief:<\/strong> Aconitum napellus is useful in treating headaches, particularly those accompanied by fever and chills.<\/li>\n\n\n\n<li><strong>Neuritis relief:<\/strong> Neuritis is also used to relieve neuritis nerve tissue inflammation.<\/li>\n\n\n\n<li><strong>Reduced fever:<\/strong> Aconitum napellus can help to reduce fever.<\/li>\n\n\n\n<li><strong>Reduced anxiety:<\/strong> Aconitum napellus can help to reduce anxiety and stress.<\/li>\n\n\n\n<li><strong>Boosted immunity:<\/strong> Aconitum napellus can help to boost the immune system and protect against illness.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">What Does Aconitum Napellus Treat?<\/h2>\n\n\n\n<p>Aconitum napellus is used to treat a wide range of conditions, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Fever:<\/strong> Aconitum napellus is commonly used to treat fever, especially in the early stages of illness. It is believed to stimulate the immune system, which helps reduce inflammation and lower body temperature.<\/li>\n\n\n\n<li><strong>Pain:<\/strong> Aconitum napellus can help to relieve pain, including headaches, muscle aches, and nerve pain. It is believed that Aconitum napellus works by numbing the affected area, which helps to reduce pain and inflammation.<\/li>\n\n\n\n<li><strong>Anxiety:<\/strong> Aconitum napellus can help reduce anxiety and stress. It is believed that it works by calming the mind and promoting relaxation.<\/li>\n\n\n\n<li><strong>Colds and flu:<\/strong> Aconitum napellus can help treat colds and flu symptoms such as fever, chills, and headache. It is believed to stimulate the immune system, which helps reduce inflammation and fight viral infections.<\/li>\n\n\n\n<li><strong>Sore throat:<\/strong> Aconitum napellus can help to relieve sore throat pain and inflammation. It is believed that Aconitum napellus works by soothing the throat and reducing mucus production.<\/li>\n<\/ul>\n\n\n\n<p>It is important to note that the effectiveness of Aconitum napellus may vary depending on the individual and the severity of the condition being treated. If you are considering using Aconitum napellus, it is essential to follow the instructions provided by a qualified <a href=\"https:\/\/weclinic.in\/\">homeopathic practitioner<\/a> and consult with them.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Aconitum Napellus Homeopathic Uses<\/h2>\n\n\n\n<p>Aconitum napellus can be used in various forms, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother Tincture:<\/strong> The mother tincture of Aconitum napellus is used to treat pain, inflammation, and fever. It is commonly used to treat headaches, particularly those accompanied by fever and chills. It is also used to treat neuritis, which is nerve tissue inflammation.<\/li>\n\n\n\n<li><strong>Diluted Solution:<\/strong> A diluted solution of Aconitum napellus is used to relieve pain, inflammation, and fever. It is commonly used to treat arthritis, particularly the acute form.<\/li>\n\n\n\n<li><strong>Herbal Extract: <\/strong>Aconitum napellus is an herbal extract used to treat pain, inflammation, and fever. It is commonly used to treat headaches, particularly those accompanied by fever and chills. It is also used to treat neuritis, which is nerve tissue inflammation.<\/li>\n<\/ul>\n\n\n\n<p>Aconitum napellus can be used in a variety of forms, including:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Oral tablets:<\/strong> Aconitum napellus oral tablets are the most common form of the remedy. They are taken by mouth, typically three times per day.<\/li>\n\n\n\n<li><strong>Liquid drops:<\/strong> Aconitum napellus liquid drops are another common remedy. They are taken by mouth, typically three times per day.<\/li>\n\n\n\n<li><strong>Topical ointment:<\/strong> Aconitum napellus topical ointment is applied to the skin to treat pain and inflammation.<\/li>\n<\/ul>\n\n\n\n<h2 class=\"wp-block-heading\">Aconitum Napellus Dosage<\/h2>\n\n\n\n<p>The dosage of <a href=\"https:\/\/weclinic.in\/blog\/cantharis-uses\">Aconitum napellus <\/a> depends on the form of the medicine and the individual&#8217;s condition. Here are some general guidelines for the dosage of Aconitum napellus:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong>Mother tincture:<\/strong> Use one to three drops of the mother tincture every three to four hours or as directed by a homeopathic practitioner.<\/li>\n\n\n\n<li><strong>Diluted solution: <\/strong>Use one to three drops of the diluted solution every three to four hours or as directed by a homeopathic practitioner.<\/li>\n\n\n\n<li><strong>Herbal extract:<\/strong> Use one to two drops of the herbal extract every three to four hours or as directed by a homeopathic practitioner.<\/li>\n<\/ul>\n\n\n\n<h3 class=\"wp-block-heading\">Aconitum Napellus Dosage For Adults<\/h3>\n\n\n\n<p>The dosage of Aconitum napellus for adults depends on the individual&#8217;s condition and sensitivity to the medicine.<br>The typical dosage of Aconitum napellus for adults is 30C potency, taken three times per day.<br>It is important to follow the instructions provided by a homeopathic practitioner when taking Aconitum napellus.<\/p>\n\n\n\n<h3 class=\"wp-block-heading\">Aconitum Napellus Dosage For Children<\/h3>\n\n\n\n<p>The dosage of Aconitum napellus for children depends on the individual&#8217;s age and weight.<br>The typical dosage of Aconitum napellus for children is 12C potency, taken three times per day.<br>It is important to follow the instructions provided by a homeopathic practitioner when taking Aconitum napellus.<\/p>\n\n\n\n<h2 class=\"wp-block-heading\">Who Should Avoid Aconitum Napellus?<\/h2>\n\n\n\n<p>Aconitum napellus is a toxic herb and should be used with caution. It should be avoided by individuals with a history of hypersensitivity to the herb, and it is not suitable for use in pregnant or breastfeeding women. Some of the potential side effects of Aconitum napellus include:<\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><strong><a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-nausea-with-homeopathy\"   title=\"Nausea\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"1783\">Nausea<\/a> and vomiting:<\/strong> These are among the most common side effects of Aconitum napellus. They can occur as soon as the herb is consumed or several hours later. Symptoms of nausea and <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-vomiting-with-homeopathy\"   title=\"vomiting\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"2146\">vomiting<\/a> can be treated with medications such as antiemetic drugs.<\/li>\n\n\n\n<li><strong>Dizziness and fainting:<\/strong> Some individuals may experience dizziness and fainting when taking Aconitum napellus. This medicine can be particularly dangerous for individuals with certain medical conditions such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-diabetes-with-homeopathy\"   title=\"diabetes\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"54\">diabetes<\/a> or heart disease. Rest and hydration can treat dizziness and fainting symptoms.<\/li>\n\n\n\n<li><strong>Rapid or irregular heartbeat: <\/strong>Aconitum napellus can cause a rapid or irregular heartbeat, which can be particularly dangerous for individuals with certain medical conditions, such as heart disease. Beta-blockers can be used to treat symptoms of a rapid or irregular heartbeat.<\/li>\n\n\n\n<li><strong>Difficulty breathing:<\/strong> In some cases, Aconitum napellus can cause trouble breathing. This medicine is hazardous for individuals with certain medical conditions, such as <a class=\"wpil_keyword_link\" href=\"https:\/\/weclinic.in\/blog\/how-to-treat-asthma-with-homeopathy\"   title=\"asthma\" data-wpil-keyword-link=\"linked\"  data-wpil-monitor-id=\"855\">asthma<\/a> or bronchitis. Bronchodilators can be used to treat symptoms of difficulty breathing.<\/li>\n<\/ul>\n\n\n\n<p>If you experience any side effects from Aconitum napellus, stop taking the remedy and contact your healthcare provider.<\/p>\n\n\n\n<p><strong>References<\/strong><\/p>\n\n\n\n<ul class=\"wp-block-list\">\n<li><a href=\"https:\/\/www.homeopathic.com\/materia-medica\/aconitum-napellus\">Homoeopathic Materia Medica<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.webmd.com\/vitamins\/ai\/ingredientmono-763\/aconitum-napellus\">Aconitum Napellus<\/a><\/li>\n\n\n\n<li><a href=\"https:\/\/www.verywellhealth.com\/aconitum-napellus-89452\">The Benefits of Aconitum Napellus<\/a><\/li>\n<\/ul>\n\n\n\n<p><strong>FAQs<\/strong><\/p>\n\n\n<div class=\"saswp-faq-block-section\"><ul><li style=\"list-style-type: number\"><h4 class=\"\">Is homoeopathy Aconitum napellus safe?<\/h4><p class=\"saswp-faq-answer-text\">Yes, homeopathy, Aconitum napellus, is generally safe for most people to use. However, some people may experience side effects, and homeopathy should not be used to replace conventional medical care.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Aconitum napellus used for?<\/h4><p class=\"saswp-faq-answer-text\">Aconitum napellus is used to treat a wide range of conditions, including fever, pain, and anxiety. It can also be used to treat colds and flu, sore throat, and other conditions.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How to give Aconitum napellus to babies?<\/h4><p class=\"saswp-faq-answer-text\">Aconitum napellus should be given to babies with caution and under the guidance of a homeopathic practitioner. The dosage for babies depends on their age and weight, and it should be provided in small amounts. The dosage should be monitored and adjusted as needed to ensure its safe and effective use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How does Aconitum napellus work?<\/h4><p class=\"saswp-faq-answer-text\">Aconitum napellus is believed to work by stimulating the body&#8217;s natural healing processes and restoring its balance.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">How long does Aconitum napellus take to work?<\/h4><p class=\"saswp-faq-answer-text\">The effectiveness of Aconitum napellus varies from person to person and depends on the severity of the condition being treated. Some individuals may experience relief within a few hours, while others may require several days of use. It is important to monitor the medicine&#8217;s effectiveness and consult with a homeopathic practitioner as needed to ensure its safe and effective use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Can Aconitum napellus be taken daily?<\/h4><p class=\"saswp-faq-answer-text\">Yes, Aconitum napellus can be taken daily. However, it should be taken as directed by a homeopathic practitioner and only with their guidance. The dosage for adults and children varies depending on the condition being treated and the severity of the symptoms. It is important to monitor the effectiveness of the medicine and consult with a homeopathic practitioner as needed to ensure its safe and effective use.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">What is Aconitum napellus used to treat?<\/h4><p class=\"saswp-faq-answer-text\">Aconitum napellus treats various diseases, including headache and pain, arthritis, neuritis, fever, and chills. It is commonly used to treat pain, inflammation, and fever, particularly those accompanied by fever and chills.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Aconitum napellus good for acid reflux?<\/h4><p class=\"saswp-faq-answer-text\">No, Aconitum napellus is not generally recommended for treating acid reflux.<\/p><li style=\"list-style-type: number\"><h4 class=\"\">Is Aconitum napellus safe for pregnancy?<\/h4><p class=\"saswp-faq-answer-text\">No, Aconitum napellus is not generally recommended for use during pregnancy.<\/p><\/ul><\/div>","protected":false},"excerpt":{"rendered":"<p>What Is Aconitum Napellus? Aconitum napellus, commonly known as monkshood or wolfsbane, is a perennial, toxic herb that can be found throughout Europe, Asia, and North America. It is well-known for its beautiful blue-purple flowers and lance-shaped greenish-blue leaves. In homeopathy, Aconitum napellus is used as a medicine due to its various therapeutic properties. Aconitum napellus has been used in traditional medicine for centuries to treat a wide range of ailments. In traditional Chinese medicine, it is used to treat headaches, toothaches, and skin conditions. In traditional European medicine, it is used to treat fever, pain, and anxiety. Aconitum Napellus <\/p>\n","protected":false},"author":3,"featured_media":0,"comment_status":"closed","ping_status":"open","sticky":false,"template":"","format":"standard","meta":{"footnotes":""},"categories":[128],"tags":[],"class_list":["post-693","post","type-post","status-publish","format-standard","hentry","category-medicine"],"yoast_head":"<!-- This site is optimized with the Yoast SEO plugin v24.7 - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Aconitum Napellus - Uses, Dosage, Side Effects, Composition, And More<\/title>\n<meta name=\"description\" content=\"Aconitum Napellus Homeopathic Uses to treat a wide range of conditions, including fever, pain, anxiety, colds and flu, and sore throat.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"Aconitum Napellus - Uses, Dosage, Side Effects, Composition, And More\" \/>\n<meta property=\"og:description\" content=\"Aconitum Napellus Homeopathic Uses to treat a wide range of conditions, including fever, pain, anxiety, colds and flu, and sore throat.\" \/>\n<meta property=\"og:url\" content=\"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses\" \/>\n<meta property=\"og:site_name\" content=\"WeClinic&trade; Blog\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/weclinic.in\" \/>\n<meta property=\"article:published_time\" content=\"2024-04-09T16:38:59+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2024-04-09T16:39:00+00:00\" \/>\n<meta name=\"author\" content=\"Deeksha Katiyar\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Deeksha Katiyar\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"8 minutes\" \/>\n<!-- \/ Yoast SEO plugin. -->","yoast_head_json":{"title":"Aconitum Napellus - Uses, Dosage, Side Effects, Composition, And More","description":"Aconitum Napellus Homeopathic Uses to treat a wide range of conditions, including fever, pain, anxiety, colds and flu, and sore throat.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses","og_locale":"en_US","og_type":"article","og_title":"Aconitum Napellus - Uses, Dosage, Side Effects, Composition, And More","og_description":"Aconitum Napellus Homeopathic Uses to treat a wide range of conditions, including fever, pain, anxiety, colds and flu, and sore throat.","og_url":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses","og_site_name":"WeClinic&trade; Blog","article_publisher":"https:\/\/www.facebook.com\/weclinic.in","article_published_time":"2024-04-09T16:38:59+00:00","article_modified_time":"2024-04-09T16:39:00+00:00","author":"Deeksha Katiyar","twitter_card":"summary_large_image","twitter_misc":{"Written by":"Deeksha Katiyar","Est. reading time":"8 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses#article","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses"},"author":{"name":"Deeksha Katiyar","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e"},"headline":"Aconitum Napellus &#8211; Uses, Dosage, Side Effects, Composition, And More","datePublished":"2024-04-09T16:38:59+00:00","dateModified":"2024-04-09T16:39:00+00:00","mainEntityOfPage":{"@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses"},"wordCount":1713,"publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"articleSection":["Medicine"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses","url":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses","name":"Aconitum Napellus - Uses, Dosage, Side Effects, Composition, And More","isPartOf":{"@id":"https:\/\/weclinic.in\/blog\/#website"},"datePublished":"2024-04-09T16:38:59+00:00","dateModified":"2024-04-09T16:39:00+00:00","description":"Aconitum Napellus Homeopathic Uses to treat a wide range of conditions, including fever, pain, anxiety, colds and flu, and sore throat.","breadcrumb":{"@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/weclinic.in\/blog\/aconitum-napellus-uses"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/weclinic.in\/blog\/aconitum-napellus-uses#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Home","item":"https:\/\/weclinic.in\/blog"},{"@type":"ListItem","position":2,"name":"Aconitum Napellus &#8211; Uses, Dosage, Side Effects, Composition, And More"}]},{"@type":"WebSite","@id":"https:\/\/weclinic.in\/blog\/#website","url":"https:\/\/weclinic.in\/blog\/","name":"WeClinic&trade; Blog","description":"India's Leading Online Homeopathic Clinic Blog","publisher":{"@id":"https:\/\/weclinic.in\/blog\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/weclinic.in\/blog\/?s={search_term_string}"},"query-input":{"@type":"PropertyValueSpecification","valueRequired":true,"valueName":"search_term_string"}}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/weclinic.in\/blog\/#organization","name":"WeClinic™","url":"https:\/\/weclinic.in\/blog\/","logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/uploads\/2023\/10\/logo.png","width":163,"height":45,"caption":"WeClinic™"},"image":{"@id":"https:\/\/weclinic.in\/blog\/#\/schema\/logo\/image\/"},"sameAs":["https:\/\/www.facebook.com\/weclinic.in","https:\/\/www.linkedin.com\/company\/weclinic\/","https:\/\/www.youtube.com\/channel\/UCD_SOXTnuzzLsMKk3kcvnzA"]},{"@type":"Person","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/9d24a415482c7129d17b7a8d8671d91e","name":"Deeksha Katiyar","image":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/weclinic.in\/blog\/#\/schema\/person\/image\/","url":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","contentUrl":"https:\/\/weclinic.in\/blog\/wp-content\/litespeed\/avatar\/ba095b4dd260c1719e81996c6ab81d8f.jpg?ver=1751313076","caption":"Deeksha Katiyar"},"description":"Experienced Doctor with a demonstrated history of working in the health wellness and fitness industry. Skilled in Homeopathy, Clinical Research, Medicine, Public Health, and Wellness. Strong healthcare services professional with a post graduation focused in Homoeopathy from The London college of Homoeopathy, Hounslow, U.K..","sameAs":["https:\/\/weclinic.in\/"],"url":"https:\/\/weclinic.in\/blog\/author\/deeksha-katiyar"}]}},"_links":{"self":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/693","targetHints":{"allow":["GET"]}}],"collection":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/users\/3"}],"replies":[{"embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/comments?post=693"}],"version-history":[{"count":11,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/693\/revisions"}],"predecessor-version":[{"id":3395,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/posts\/693\/revisions\/3395"}],"wp:attachment":[{"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/media?parent=693"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/categories?post=693"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/weclinic.in\/blog\/wp-json\/wp\/v2\/tags?post=693"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}